{"_id":"gDN8XlvRYw4WtzJD","name":"(Fog) Eldritch Mist","permission":{"default":0,"fKShf9sFzL9Lwpkr":3},"folder":"xM09aQVUSD0X0fG6","sort":200000,"flags":{"exportSource":{"world":"toril","system":"dnd5e","coreVersion":"0.6.6","systemVersion":0.96}},"img":"icons/svg/d20-grey.svg","description":"","results":[{"_id":"g6lARd9RmevWw8Oi","flags":{},"type":0,"text":"<h2>ELDRITCH MIST</h2> <p><b>Type: </b>Ghost Fog</p> <p><b>Difficulty Class: </b>DC 15 Intelligence (Arcana) check to recognize it as an eldritch mist</p> <p><b>Description: </b>The souls of the dead want the living to join them.</p> <p><b>Effect: </b>Every hour a ship is immersed in ghost fog, roll any die. On an even number, [[2d4]] hostile specters appear and attack those on the ship.</p> <p>If a humanoid creature dies in ghost fog, its spirit rises as a specter that is hostile toward all creatures that aren't undead. </p><p> All non-undead creatures immersed in ghost fog are vulnerable to necrotic damage.</p>","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[1,1],"drawn":false},{"_id":"hv2X0XD2hvcVEb30","flags":{},"type":0,"text":"<h2>ELDRITCH MIST</h2> <p><b>Type: </b>Shadowfell Fog</p> <p><b>Difficulty Class: </b>DC 15 Intelligence (Arcana) check to recognize it as an eldritch mist</p> <p><b>Description: </b>When a vessel travels through this oppressive, shadow-haunted miasma, its crew and passengers feel despair.</p> <p><b>Effects: </b>Each hour a vessel is immersed in the fog, the crew must make a quality score check by rolling a [[1d20]] and adding their quality score to the number. The DC for this check is 10 + the number of hours the ship has been immersed in the Shadowfell fog. </p><p> If the crew fails this check, their quality score decreases by 1 while within the Shadowfell fog and for 1 day afterward. </p>","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[2,2],"drawn":false},{"_id":"u2a2xeEwbBVDKTc4","flags":{},"type":0,"text":"<h2>ELDRITCH MIST</h2> <p><b>Type: </b>Wild Magic Fog</p> <p><b>Difficulty Class: </b>DC 15 Intelligence (Arcana) check to recognize it as an eldritch mist</p> <p><b>Description: </b>Few know the origins of wild magic fog, with some claiming it is the creation of capricious gods while others believe it is the result of magical experimentation gone wrong.</p> <p><b>Effects: </b>Whenever a creature in wild magic fog casts a spell of 1st level or higher, roll on the Wild Magic Surge table in chapter 3, \"Classes,\" of the Player's Handbook to create a magical effect. </p>","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[3,3],"drawn":false}],"formula":"1d3","replacement":true,"displayRoll":true}