{"_id":"O8kRiPcNF3dWR3wL","name":"Arctic (Non-combat)","permission":{"default":0,"fKShf9sFzL9Lwpkr":3},"folder":"p3w6kHMgSIJ498Ol","sort":500000,"flags":{},"img":"icons/svg/d20-grey.svg","description":"","results":[{"_id":"9QLmDpKJvG8sfOBl","flags":{},"type":0,"text":"A white dragon feasts on dead carriage horses in the center of a large field, will the players sneak past or fight?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[1,1],"drawn":false},{"_id":"ESGdhtrqCNHpzqUU","flags":{},"type":0,"text":"The player's suddenly find their path blocked by a frozen lake, and must complete a skill challenge to cross safely.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[2,2],"drawn":false},{"_id":"KWzCHzWEbjgn8BtJ","flags":{},"type":0,"text":"The party stumbles across a group of orcs chopping town a grove of trees for firewood, and the local fey aren't pleased.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[3,3],"drawn":false},{"_id":"8wkOLaHCiuBS2CiO","flags":{},"type":0,"text":"An NPC is trapped on a block of ice in the center of a lake, and will fall in without help.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[4,4],"drawn":false},{"_id":"c8GnhcpUOH57pYoV","flags":{},"type":0,"text":"A blizzard has blown in, severely limiting visibility.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[5,5],"drawn":false},{"_id":"Qo8n0dyoRNev0bxF","flags":{},"type":0,"text":"A band of orc raiders, the chief is on a polar bear. [u/mfarnach]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[6,6],"drawn":false},{"_id":"m3ii9GbWbpRQBJJo","flags":{},"type":0,"text":"A white ooze is disguised as a snow drift and your party has wandered into it. [u/Skele11]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[7,7],"drawn":false},{"_id":"ec8G8ClF6Ea6yGyV","flags":{},"type":0,"text":"Winter wolves [u/Boneguy1998]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[8,8],"drawn":false},{"_id":"TeMA7DkhdCtAiXLM","flags":{},"type":0,"text":"The party melts ice only to find out they thawed a water elemental. [u/Captnlunch]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[9,9],"drawn":false},{"_id":"8ZWLOGSzL0EosnLD","flags":{},"type":0,"text":"A crazed Wizard has made an illusion around the party, making them walk in circles. [u/Golden-Owl-official]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[10,10],"drawn":false},{"_id":"5KK73q36m01ZK2qj","flags":{},"type":0,"text":"The party comes across a table that has been enchanted to stub their toes as they pass. [u/Golden-Owl-official]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[11,11],"drawn":false},{"_id":"0oFBRVsgcOxVG0Cm","flags":{},"type":0,"text":"A dragon flies over, causing an avalanche, DC15 Dex save or be trapped under the snow. [u/Golden-Owl-official]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[12,12],"drawn":false},{"_id":"R350KFUneuFZ8MUi","flags":{},"type":0,"text":"The party sees a strange man just ahead, when they approach they see that it is a snowman with a cloak on it. [u/Golden-Owl-official]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[13,13],"drawn":false},{"_id":"3L8V7mOBvSjcXcOi","flags":{},"type":0,"text":"Up ahead the party hears a Rhemoraz and a dragon fighting, but cannot see them yet. [u/Golden-Owl-official]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[14,14],"drawn":false},{"_id":"XsGTymbPcNzUbnsg","flags":{},"type":0,"text":"Approached by a gang of goblins in sleds pulled by dire wolves [u/unoriginalname2]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[15,15],"drawn":false},{"_id":"aTYu0jpODqSHSUeq","flags":{},"type":0,"text":"The ice cracks around them and they are now adrift on the water. [u/unoriginalname2]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[16,16],"drawn":false},{"_id":"c5j6Mb7VrrQ4knVX","flags":{},"type":0,"text":"The party comes across an ice locked ship frozen, and crushed by the ice long ago. Loot, lore, and maybe skeletons inside. [u/mikeymanza]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[17,17],"drawn":false},{"_id":"0Xh3lBHq9w064A6x","flags":{},"type":0,"text":"The players encounter a frozen lake with a massive dark shape in the middle, and on the frozen surface are cultists chanting and sacrificing frozen corpses to the thing in the ice. [u/Amitisgod]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[18,18],"drawn":false},{"_id":"7m30XVHKdjT7sRXN","flags":{},"type":0,"text":"The party is trudging across the ice alongside a freezing river/ocean/lake, and suddenly the ice cracks, leaving the player stuck on an ice raft in the middle of a dangerously cold body of water. [u/XXmilleniumXX]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[19,19],"drawn":false},{"_id":"kxaW6PIzLLzysFlv","flags":{},"type":0,"text":"A skill challenge (can use magic): A lone herder asks the party to help him catch 4 specific reindeer with (or without) a lasso. Those 8 reindeer have different shaped ears than others (Perception check DC14). You can lure, try to catch, try to lasso, anything. Just doing the same thing increases the DC by one, baseline DC 15. The size of the herd is around 100. The reindeer love some hay or lichen and will come immediately to check. Otherwise no reindeer allows a human within 10 feet. Prize: A whistle, carved out of an antler, that let's out a high pitched, yet weirdly beautiful sound when blown into. Will attract all wild animals within 500 feet. [u/Salliin]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[20,20],"drawn":false},{"_id":"jbx30panl1b8QwSz","flags":{},"type":0,"text":"An old sailing ship has been locked in the ice for generations. Only the skeletons of the crew remain on board, along with a hold full of gold and treasure. At it's center, the skull of a dragon. The treasure, however, is cursed. Should one piece of gold leave the hold and make its way topside, the skeletons come to life, and should that piece of gold leave the ship, a giant skeletal dragon shall rise from within the ship and murder any who steals its treasure - to which it has bound it's eternal life by way of its ancient greed. [u/hcaneandrew]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[21,21],"drawn":false},{"_id":"t574U1xjkFmRyV19","flags":{},"type":0,"text":"A Bheur Hag starts stalking the party. She won't directly attack them unless they attack her, but she will attempt to sabotage them at every opportunity. [u/Quantext609]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[22,22],"drawn":false},{"_id":"5A5cnXBPxbUuRZSc","flags":{},"type":0,"text":"The party encounters a wandering white dragonborn who's searching for a lost ruin that is supposed to be in this area. Because of his cold resistance, he wears almost nothing because he's immune to hypothermia. [u/Quantext609]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[23,23],"drawn":false},{"_id":"o3ynPEcnBZfAiNdz","flags":{},"type":0,"text":"The party stumbles across a colossal igloo with it's only entrance being at the top. Inside the igloo is a Silver Dragon that has been protecting the people inside for generations. They worship it as a god and have no concept of the outside world. [u/Quantext609]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[24,24],"drawn":false},{"_id":"DUofpdB3dS7iPGZ7","flags":{},"type":0,"text":"The party encounters a Yuki-Onna. She takes interest in any male party members and will first attempt to seduce them into coming with her. If they reject her offers, she gets angry and will attempt to freeze the party to death. [u/Quantext609]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[25,25],"drawn":false},{"_id":"T1S8SNHhxmDSevix","flags":{},"type":0,"text":"A unicorn that, if followed, will lead the party to a secluded glen sheltered from the harsh elements. [u/Brand_News_Detritus]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[26,26],"drawn":false},{"_id":"e5wSb2ODi7pMNiNA","flags":{},"type":0,"text":"A band of ghosts wandering the tundra, if they attempt to communicate the ghosts reveal they cannot pass on until their bodies are properly disposed of (the players must find the bodies and burn them on funeral pyres). [u/Brand_News_Detritus]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[27,27],"drawn":false},{"_id":"k6JWstOAEPeLgoEi","flags":{},"type":0,"text":"A village of people who graciously offer the party food and shelter but it’s clear they’re hiding something. The villagers are all werebears and, while Neutral-Good, are wary of outsiders discovering their secret. [u/Brand_News_Detritus]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[28,28],"drawn":false},{"_id":"mBtgOk9BI9uXvwMr","flags":{},"type":0,"text":"A hunting party of frost giants whose chieftain is seeking a Remorhaz to add to his trophy collection. [u/Brand_News_Detritus]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[29,29],"drawn":false},{"_id":"P6NLLAvycpkg7VOQ","flags":{},"type":0,"text":"A barren field where will-o’-wisps appear at night, these wisps trail colors behind them like the aurora. A massive battle happened here, but who fought? And how long ago? [u/Brand_News_Detritus]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[30,30],"drawn":false},{"_id":"dvNmdNsTvy92uaGu","flags":{},"type":0,"text":"A mated pair of yeti stalking the tundra for prey. [u/Brand_News_Detritus]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[31,31],"drawn":false},{"_id":"UHoW1lpKk3UndPI6","flags":{},"type":0,"text":"A silver dragon who hasn’t had mortals pass through their lands in decades. Very friendly but will chew the party’s ear off about recent events and changes in the outside world. [u/Brand_News_Detritus]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[32,32],"drawn":false},{"_id":"F5p5qGzM2DMBJEVJ","flags":{},"type":0,"text":"An arctic fox runs out crossing the path of the players carrying a dismembered human hand. The fox will not fight the party instead fleeing leaving the hand behind. Roll 1D4 for the number of rings on the hand. [u/Bwabit3VS]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[33,33],"drawn":false},{"_id":"HHuuBXU32Jw3AROS","flags":{},"type":0,"text":"The temperature drops dramatically making hypothermia/ frost damage even more potent than before.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[34,34],"drawn":false},{"_id":"CUzWdj8mHWXdO4xT","flags":{},"type":0,"text":"The party encounters a strange reverse-oasis (or hot springs, for some people), which has a hut and a small inn. Is it a true rest area, though, or does something more sinister lurk?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[35,35],"drawn":false},{"_id":"1rZFFiGHtignFv0z","flags":{},"type":0,"text":"A ripple waves against the icy ground, as the already cold air drops even more, and the party is warped to the Elemental Plane of Ice. (use only on mid-high level characters).","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[36,36],"drawn":false},{"_id":"06IJBV9dliblSeEP","flags":{},"type":0,"text":"The party wakes up at camp surrounded by magically enchanted snowmen (using the Scarecrow stat block). They act as guards for an Ice Hag, making sure the party don't get too close to her lair...or perhaps, beckoning them toward her.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[37,37],"drawn":false},{"_id":"99lo9FJtCiptTBEb","flags":{},"type":0,"text":"A magic-user stands over a group of orc/giant corpses (depending on party's level), drawing a tote of power from them. What is the purpose of this, and who's the truely evil one here?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[38,38],"drawn":false},{"_id":"3kPUxJRecqFfzHNj","flags":{},"type":0,"text":"A clan of Ice Giants, carrying sufficient amount of meat for them off a recent kill, come across the party. They demand the party retreat, or prove their might as warriors, throwing a few of their champions/captives/pets to fight. Perhaps as a twist, this was just a random giant throwing out the challenge, thinking himself bigger, and the leader shows up, quells the fight (regardless of who's winning), and welcomes the party to their feast.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[39,39],"drawn":false},{"_id":"mdFSpGHvIys5XgXJ","flags":{},"type":0,"text":"A trading vessel has become stranded along the ice, and those onboard are likely going to die or freeze without help. They could be legit traders, secretly diplomats for a city important to the PCs, or actually agents for the BBEG, who might be using this opportunity as a trap.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[40,40],"drawn":false},{"_id":"0ldvenqfTBrgUJ9r","flags":{},"type":0,"text":"The party comes across a caravan of pilgrims out to see a variant of the aurora that only comes out once a decade. They'll gladly take on anyone who wants to join, and they can share valuable tips about food caches and shelter in the nearby area.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[41,41],"drawn":false},{"_id":"bHpV9OgAyX2VydWd","flags":{},"type":0,"text":"The party is being stalked by a chittering pack of ice and steam mephits, which are looking for victims upon which they can enact petty evils. They try to keep themselves hidden and motionless when they think the party might detect them, but swarm the party when they realize they've been noticed.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[42,42],"drawn":false},{"_id":"4t3gX5GUUcsDMy7f","flags":{},"type":0,"text":"The party encounters a group of hunters attempting to find and take trophies from a giant polar owlbear. The hunters are on the lookout for a little extra manpower, especially since they're racing against another group with the same objective, with honor and prestige at stake.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[43,43],"drawn":false},{"_id":"wJEJrntRBIwACOD8","flags":{},"type":0,"text":"Unexplained angels in the snow that are different sizes and shapes due to other races doing that.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[44,44],"drawn":false},{"_id":"MeeRBQEdlrRG3xUd","flags":{},"type":0,"text":"The party comes across an enormous wailing Ice Giant, if they approach too closely the giant will spot them and attempt to bring them back to their lair. It is friendly, but clearly insane. Referring to the party as pets, and even attempting to pick them up and stroke their hair. [u/TheGentlemanK]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[45,45],"drawn":false},{"_id":"AriHzn7SctCUWyvf","flags":{},"type":0,"text":"Your party realizes they are being stalked night and day by an enormous dire polar bear. [u/TheGentlemanK]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[46,46],"drawn":false},{"_id":"U2AyWV2WgoHeDckg","flags":{},"type":0,"text":"A pack of winter wolves runs in front of you chasing a great elk or moose. If the party interferes, the great elk will lead them to a nearby Arctic Druid. [u/TheGentlemanK]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[47,47],"drawn":false},{"_id":"8LS7gDfpGoCUBfkk","flags":{},"type":0,"text":"A penguin pops out of some nearby ice and waddles up close to the party. It is friendly. But immediately deals 1d8 psychic damage to anyone who questions what a penguin is doing in an arctic environment, before disappearing. [u/TheGentlemanK]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[48,48],"drawn":false},{"_id":"drUl0R7BeNnuPFk1","flags":{},"type":0,"text":"A man or orc encounters the party stark naked and raving mad. He’s quite likely suffering from hypothermia. If the party can help him survive he will lead them to a village for refuge and a grateful family that has been searching for him. [u/TheGentlemanK]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[49,49],"drawn":false},{"_id":"BFRVyFyApISHxGSn","flags":{},"type":0,"text":"A village carved entirely out of magical unmelting ice. [u/TheGentlemanK]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[50,50],"drawn":false},{"_id":"5I8EI2qNhSoA8ahn","flags":{},"type":0,"text":"In the long darkness of the artic night, the party sees a glow like the sun in the distance. An entire farming village in the midst of the vast tundra sits beneath a warm and brightly glowing stone. [u/TheGentlemanK]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[51,51],"drawn":false},{"_id":"TU9b1QHWnHqnPkzS","flags":{},"type":0,"text":"A group of frost giant hunters riding mammoths","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[52,52],"drawn":false},{"_id":"Cxi5aynG8to1fYpm","flags":{},"type":0,"text":"The party are traveling across a thick sheet of ice, with no issues of it cracking and falling into the chilly waters below. They come across a wizard/cultists who are using magic to heat the vicinity in an attempt to acquire a relic frozen in the ice below. They attack the party in fear that they're after the same treasure. The heat causes the ice to start to melt and crack, at the start of each PC's turn roll 1dX to see if the ice below them breaks, submerging them and forcing them to swim to thicker ice, or take 1dX cold damage. Could spice it up by having the heavier PC's rolling if they move across the ice to see if they break it. Would cause melee PC's to have a conflict about rushing down the cultists.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[53,53],"drawn":false},{"_id":"HjCzIPNKt4Qs8CPu","flags":{},"type":0,"text":"That one scene from the polar express where the train goes initial D, but the party faces struggles to remain on the right path to safety across the frozen lake. Too far away from the frozen rails will end with a dip into the lake and some monsters coming from the icy depths","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[54,54],"drawn":false},{"_id":"Riahj3HoOMMN4SVw","flags":{},"type":0,"text":"The party crossing the ice comes across an impass. The ice has cracked and several small floating ice islands litter their path. Large enough to hold 4 them as they cross, they must hop from island to island to cross this frozen body of water.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[55,55],"drawn":false},{"_id":"pWD9FgMu8YSkhQTt","flags":{},"type":0,"text":"But something lurks underneath, a megalodon is hungry and wants a snack.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[56,56],"drawn":false},{"_id":"5AgNZ9aRNS8vdwnX","flags":{},"type":0,"text":"The party becomes aware of this threat after completing a successful perception check, they spot an animal on one of the far islands before they start crossing, then suddenly the meg attacks and drags it under.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[57,57],"drawn":false},{"_id":"onITxttgT52RZwJ8","flags":{},"type":0,"text":"The players must complete successfull acrobatics and stealth checks to avoid being spotted by the Meg, if they do, the meg starts destroying islands behind them.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[58,58],"drawn":false},{"_id":"ak2Rq1qSKIIINE52","flags":{},"type":0,"text":"Hot Springs. [u/World_Of_Ideas]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[59,59],"drawn":false},{"_id":"1jj0Pe3KPVGmvQUo","flags":{},"type":0,"text":"A strange fruit tree, that seems to thrive despite the cold. [u/World_Of_Ideas]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[60,60],"drawn":false},{"_id":"0IbH5R1wK9UE59ox","flags":{},"type":0,"text":"A castle made of ice. [u/World_Of_Ideas]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[61,61],"drawn":false},{"_id":"A8yTiQnigeWmQsxp","flags":{},"type":0,"text":"An extinct creature, frozen in ice. [u/World_Of_Ideas]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[62,62],"drawn":false},{"_id":"eOIEHYkcFtqgtSb6","flags":{},"type":0,"text":"An arctic fox chasing a snowshoe hare. [u/World_Of_Ideas]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[63,63],"drawn":false},{"_id":"bIAnt877MyThMdsN","flags":{},"type":0,"text":"The hunting party of a small arctic tribe. They are willing to trade with the PCs. [u/World_Of_Ideas]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[64,64],"drawn":false},{"_id":"HhnvWnAoKoTmG3pG","flags":{},"type":0,"text":"Ice trolls. [u/World_Of_Ideas]","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[65,65],"drawn":false},{"_id":"niSpScRAv3Wfb56u","flags":{},"type":0,"text":"A pack of 5 wolves are displeased to find the party in their territory.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[66,66],"drawn":false},{"_id":"dPGKD2yWPzkxQIpo","flags":{},"type":0,"text":"A baby yeti is crying, it must have lost its mother. Does the party help it find its potentially aggressive mother or leave it to die?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[67,67],"drawn":false},{"_id":"pAqSE4zsibjyDa2R","flags":{},"type":0,"text":"The ice cave was a great idea. Shields you from the cold. Keeps the chill well away from your bones. The fire creates a comforting aura all around the adventurers as the heat slowly melts the ice above to reveal the barely-alive Gelatinous Cube frozen into the bottom of a summer-thawed melt water stream.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[68,68],"drawn":false},{"_id":"8P7zsEq6xOBaBUyM","flags":{},"type":0,"text":"A small dan of huts full of hunters that carve holes in the ice. They live with some druids that can call to giant whales who live under the ice and contain the wisdom of the deep if you can speak to them.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[69,69],"drawn":false},{"_id":"bbMkyobRjLHvpu75","flags":{},"type":0,"text":"At first you see what look to be large blocks of ice amount the trees as you draw nearer you see what they are. People frozen solid. Arms reaching out, faces terrified. I wonder what they were running from and if its still close...","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[70,70],"drawn":false},{"_id":"tU7i0KnPWB1FJh2Z","flags":{},"type":0,"text":"The party hears crys for help and sees a woman has fallen through the ice and is wildly flailing in the water, likely to drown. They may be able to notice either: The large number of dead bodies frozen under the surrounding ice. Or The long scaled antenna attached to her back, leading down to two huge murky eyes deep in the water.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[71,71],"drawn":false},{"_id":"ZRmu8RhO0Pkpj7Iq","flags":{},"type":0,"text":"Rock trolls, heavily covered in lichen and hoarfrost","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[72,72],"drawn":false},{"_id":"Ly4CmdNImCK4IWUh","flags":{},"type":0,"text":"A puppy made of animated lichen","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[73,73],"drawn":false},{"_id":"ODxh2a2xo4buF7Yd","flags":{},"type":0,"text":"An elemental of frozen mist","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[74,74],"drawn":false},{"_id":"GS3Krzw8SsLnGSwa","flags":{},"type":0,"text":"A mystic who whistles to channel the power of the aurora borealis","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[75,75],"drawn":false},{"_id":"GTdXCJ4iVJON5hgR","flags":{},"type":0,"text":"A dolmen","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[76,76],"drawn":false},{"_id":"8lQMesuBR16Ax8Ho","flags":{},"type":0,"text":"A village of semi-subterrainian houses with roofs of lichen turf","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[77,77],"drawn":false},{"_id":"K1KYfgFtlXTHi4QG","flags":{},"type":0,"text":"A vampire that can only move and attack during the few hours of night","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[78,78],"drawn":false},{"_id":"0Lwa6yJkMeQaPVS6","flags":{},"type":0,"text":"A merchant with a sled pulled by a giant elk","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[79,79],"drawn":false},{"_id":"kTMGhNgXHZWobnBZ","flags":{},"type":0,"text":"A kushtaka (a shapeshifter that has a human and otter form. It imitates the cries of a child to lure people to the water so it can drown them. It is vulnerable to copper, urine, dogs, and fire. It whistles low-high-low.)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[80,80],"drawn":false},{"_id":"crxRENMZJI0Fjfz7","flags":{},"type":0,"text":"A house made of dragon bones, inhabited by a family of barbarian-bards","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[81,81],"drawn":false},{"_id":"theTiFZifvaGEVaC","flags":{},"type":0,"text":"The partially eaten carcass of a mammoth, from which 1d4 weeks of rations can be harvested.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[82,82],"drawn":false},{"_id":"i6UE5uCSDVACqeRp","flags":{},"type":0,"text":"Single File tracks in the snow that stop abruptly","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[83,83],"drawn":false},{"_id":"nWCIaIIu1bntpSQn","flags":{},"type":0,"text":"A frozen pond with a jagged hole in the ice that appears recently made","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[84,84],"drawn":false},{"_id":"uL2HHTVpzfKeRPfb","flags":{},"type":0,"text":"A half-orc druid tending to a wounded polar bear. If the players assist the druid, she gives them a vial of antitoxin","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[85,85],"drawn":false},{"_id":"kAMHaoqlNFwAoMaM","flags":{},"type":0,"text":"1d4 hours of extreme cold","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[86,86],"drawn":false},{"_id":"aJmL9Son0kOtmW4n","flags":{},"type":0,"text":"A howl that echoes over the land for 1d4 minutes","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[87,87],"drawn":false},{"_id":"jgtPOKD3BXjjrPQl","flags":{},"type":0,"text":"A blizzard that reduces visibility to 5 feet for 1d6 hours","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[88,88],"drawn":false},{"_id":"svhK3xV5xoyjy6Bs","flags":{},"type":0,"text":"A herd of 80 caribou moving through the snow","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[89,89],"drawn":false},{"_id":"MVgpyieuJ8lxoasy","flags":{},"type":0,"text":"A mile-wide frozen lake in which is preserved corpses of strange creatures","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[90,90],"drawn":false},{"_id":"vSLvhh3YhtyL1lf9","flags":{},"type":0,"text":"A crumbling ice castle littered with the frozen bodies of blue-skinned corpses","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[91,91],"drawn":false},{"_id":"pdVW0hLicYaUnKwN","flags":{},"type":0,"text":"A circular patch of black ice on the ground. The air temperature around the patch is warmer than in the surrounding area, and characters who inspect the ice find bits of machinery frozen within","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[92,92],"drawn":false},{"_id":"cnVlXMEP1AUjfaeY","flags":{},"type":0,"text":"An adventurer Frozen 6 feet under the ice; DMs discretion if it has a rare magic Item on it","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[93,93],"drawn":false},{"_id":"rcgyqYY43rLktP0w","flags":{},"type":0,"text":"500ft tall wall of ice that is 300ft thick and spread across 1d4 miles","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[94,94],"drawn":false},{"_id":"kCRYBpgmX4ZZhRld","flags":{},"type":0,"text":"The likeness of a stern Woman carved into the side of a mountain","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[95,95],"drawn":false},{"_id":"APzbVzAG0XvGrT7K","flags":{},"type":0,"text":"Two Ice Giants arguing over weapons, fish, and women. Are two caught up in their arguement to notice the players at first","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[96,96],"drawn":false},{"_id":"XE1B7C6USwtkNDaj","flags":{},"type":0,"text":"A 12ft tall snow man. A ruinic stone for one of its eyes has given it life, but not mobility. It is friendly and willing to give directions to travelers, but only if they're polite.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[97,97],"drawn":false},{"_id":"O4yT6Z4qMeXKw8mV","flags":{},"type":0,"text":"A man in furs driving a sleigh pulled by a polar bear","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[98,98],"drawn":false},{"_id":"4M1qqs4iNIEW6G2J","flags":{},"type":0,"text":"The cracked and broken remains of an exploration ship. Crudely dug graves can be found a few miles upshore of the ship","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[99,99],"drawn":false},{"_id":"u6NVNdUnm1lsjIza","flags":{},"type":0,"text":"A march of penguins","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[100,100],"drawn":false},{"_id":"R0fBy1zBAwj8bhQh","flags":{},"type":0,"text":"A cave which contains a bonfire that never goes out, despite the fierce winds and lack of kindling","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[101,101],"drawn":false},{"_id":"zAxdoqU5miRJMF7v","flags":{},"type":0,"text":"Natives dismembering the corpse of a killer whale they have hunted. The hunt went well and they are in good spirits, so they might share some of their catch with the players","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[102,102],"drawn":false},{"_id":"XV4STnLOf7ErHA0x","flags":{},"type":0,"text":"A hunting spear floating just off the ground. The spear head gives off a warm glow, glinting like fire in the sun.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[103,103],"drawn":false},{"_id":"rByyVUgSreUiv5NZ","flags":{},"type":0,"text":"An abandoned igloo with signs of a struggle inside","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[104,104],"drawn":false},{"_id":"CawTfOYnYSGdna1W","flags":{},"type":0,"text":"As they cross a frozen lake, they can see the vague silhouette of some ginormous creature frozen beneath the ice.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[105,105],"drawn":false},{"_id":"ak9jyMzx36WfkJPO","flags":{},"type":0,"text":"The abandoned remains of a previous explorers/adventurers camp.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[106,106],"drawn":false},{"_id":"CTRWcQckOI7GQ2QI","flags":{},"type":0,"text":"Several crude and shallow graves which contain some frozen bodies.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[107,107],"drawn":false},{"_id":"prZtPZK6whrMVoEm","flags":{},"type":0,"text":"a beached whale, several miles too far inland to make sense","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[108,108],"drawn":false},{"_id":"DxSsNUAhkzNrdjOe","flags":{},"type":0,"text":"a suspiciously warm iron mine entrance, with mysterious sounds coming from below ground","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[109,109],"drawn":false},{"_id":"QqroKNkeAilvEswh","flags":{},"type":0,"text":"a hot water spring, fed from a volcanic vent nearby","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[110,110],"drawn":false},{"_id":"hyqG6Fii550ZYETG","flags":{},"type":0,"text":"sealed caves with \"doors\" of almost clear ice, some of which appear to be recently shut","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[111,111],"drawn":false},{"_id":"N61A4H5JYv0hPDnA","flags":{},"type":0,"text":"an open crater in the icy ground, roughly a half mile across, evidently where something large exited","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[112,112],"drawn":false},{"_id":"1x2a9QrAoH1snPTi","flags":{},"type":0,"text":"an iced over corpse, frozen in place, still clutching their hands together in prayer for mercy","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[113,113],"drawn":false},{"_id":"11cMe8xNMSh6jtgr","flags":{},"type":0,"text":"heaps of discarded cold-weather gear next to a handmade structure's entrance, as if the occupants stripped down and walked into the snow nearly nude","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[114,114],"drawn":false},{"_id":"UxSso5g1ieeClhTh","flags":{},"type":0,"text":"mumbling, shambling plant creatures on the move, moving in single file for some distant location","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[115,115],"drawn":false}],"formula":"1d115","replacement":true,"displayRoll":true}