{"_id":"Jv5CaJJUUff1ezQi","name":"Mountain (Non-combat)","permission":{"default":0,"fKShf9sFzL9Lwpkr":3},"folder":"eP4cPev0ZTI9NM5J","sort":500000,"flags":{},"img":"icons/svg/d20-grey.svg","description":"","results":[{"_id":"Fj0J2zW5SlsXY38H","flags":{},"type":0,"text":"It is migration season, thousands of goats are making their way up the mountain. They are blocking the path the party wishes to cross. To try and pass through them may cause trouble","weight":1,"range":[1,1],"drawn":false},{"_id":"IbhzCnrf2TGPsldj","flags":{},"type":0,"text":"(Prep needed for exploring the city ruins) The remains of an abandoned city lies quietly in a valley between two great mountains. Evidence for the city’s collapse is not well hidden and perhaps even a bit devious in nature","weight":1,"range":[2,2],"drawn":false},{"_id":"JxVKQZahy5gHPEFE","flags":{},"type":0,"text":"Friendly Stone Golems patrol the mountains in order to help smaller beings climb to the top. They cannot speak and often throw giant boulders for fun. This can be lead to serious misunderstandings of course","weight":1,"range":[3,3],"drawn":false},{"_id":"AWgl6hYSugbwn6l7","flags":{},"type":0,"text":"(Prep needed if exploring the kobold city) All of the mountain peaks are covered in snow, all but one. The odd one out is home to a dormant volcano that is home to a small civilization of kobolds/goblins who worship an efreeti who only appears to the kobolds in the shape of a dragon. The efreeti is tricking the kobolds into thinking it is a dragon and would like to keep its ruse going.","weight":1,"range":[4,4],"drawn":false},{"_id":"Mb1SQWKaay39XU8O","flags":{},"type":0,"text":"Birds in the cliffs nearby have grown to the size of lions due to their lack of competition when it comes to hunting prey. They are intelligent and offer wisdom or mockery depending on their mood","weight":1,"range":[5,5],"drawn":false},{"_id":"eTzWzZZyRGdNDWPU","flags":{},"type":0,"text":"(Prep needed if party wants to do how the Grinch stole Christmas) You discover the cavern of a ghoulish green furred beast that is plotting to attack a nearby town and ruin their festival. This information is easy to discover as there are plans strewn about all over the place","weight":1,"range":[6,6],"drawn":false},{"_id":"JzOeZVtdm8pUEQp4","flags":{},"type":0,"text":"There is a dimensional rift cracking through the stone of this portion of the mountain range, gravity occasionally reverses, and other spontaneous magic effects occur","weight":1,"range":[7,7],"drawn":false},{"_id":"lJLF1jaBGPvVIDSF","flags":{},"type":0,"text":"A ski resort operates on a hidden slope, it is run by Goblins who desire rare metals","weight":1,"range":[8,8],"drawn":false},{"_id":"YNDAATzgKlio1lsP","flags":{},"type":0,"text":"(Prep needed if they want to explore further into the mountain) A PC has a near fatal slip which leads to the discovery of an abandoned mineshaft within a deep ravine.","weight":1,"range":[9,9],"drawn":false},{"_id":"U2pmLXhCUPHOIqKR","flags":{},"type":0,"text":"A rickety bridge must be crossed in order for the party to continue on their journey. In the canyon walls is a harpy nest. The harpies live here and attack anyone who attempts to cross the bridge. If they kill the harpies their nest is not easily reachable, but if the party manages to climb into the canyon the harpy will have a few small trinkets they have collected from travelers who were not so lucky.","weight":1,"range":[10,10],"drawn":false},{"_id":"3zMSr5yIXBwiFDrZ","flags":{},"type":0,"text":"A lone monk sits peacefully atop of the peaks. They claim to have mastered the art of reversing time","weight":1,"range":[11,11],"drawn":false},{"_id":"c6CTB8LUidHUr2yG","flags":{},"type":0,"text":"Due to a magical accident hundreds of years ago the mountains radiate elemental energy. Random combustion is not uncommon and neither are Elementals","weight":1,"range":[12,12],"drawn":false},{"_id":"ls1VCaU2bcjIACve","flags":{},"type":0,"text":"In the middle of the night a bear has dug into the party’s packs and has stolen the underwear of one party member.","weight":1,"range":[13,13],"drawn":false},{"_id":"mw3q16epCb4ka2Ch","flags":{},"type":0,"text":"Shattered statues of gold litter the snow, neglected by time. They appear to be adventurers rumored to have gone missing a few months before","weight":1,"range":[14,14],"drawn":false},{"_id":"gT0Q3Z9cCNsG4Wqu","flags":{},"type":0,"text":"A powerful spirit guardian visits the party at night and attempts to lead them to their destination. They either take on the form of a four headed deer or a small white fox","weight":1,"range":[15,15],"drawn":false},{"_id":"8k5O8Qza4pulTPxU","flags":{},"type":0,"text":"Atop the highest peak is a pool of clean spring water. Rumors say that those who drink from it will find their true love within a week. It is a well sought after ingredient for potion making","weight":1,"range":[16,16],"drawn":false},{"_id":"mmcBqpEmpvepEQcn","flags":{},"type":0,"text":"Medicinal herbs grow all around the rocky slopes of this area, they are believed to be able to cure any illness. But they are guarded by poisonous ants who use it to feed their queen. If the party tries to mass collect the herbs the ants will attack.","weight":1,"range":[17,17],"drawn":false},{"_id":"WKYYKNE8no2i9VMo","flags":{},"type":0,"text":"Every few weeks a strange light emanates from the mountains in the dead of night","weight":1,"range":[18,18],"drawn":false},{"_id":"pdERY1vRYg6FJ3i2","flags":{},"type":0,"text":"Abandoned minecart rails and minecarts run through entire range and can offer a quicker, but more dangerous, way to travel","weight":1,"range":[19,19],"drawn":false},{"_id":"6Ep0TsMI41wKWsXB","flags":{},"type":0,"text":"A stoic Cloud Giant lives near in the peaks of the mountain, they know where the party needs to go to finish their quest. But they will only give directions if they can make the giant laugh. They haven’t laughed in almost a century (This can either be really difficult or really easy to achieve)","weight":1,"range":[20,20],"drawn":false},{"_id":"ZZO541Voevsxqt3K","flags":{},"type":0,"text":"Nomadic Bards offer a detour through the mountains. They claim to know a, “Secret Tunnel”, they plan to get the party lost in the cavern network and then rob them.","weight":1,"range":[21,21],"drawn":false},{"_id":"9wkOwRn1NmZs9rHj","flags":{},"type":0,"text":"A crazed old hobgoblin challenges the party to a shield surf race down the snow packed slopes. The first to the bottom gets a prize.","weight":1,"range":[22,22],"drawn":false},{"_id":"ZDoOuGjedPsqKe8C","flags":{},"type":0,"text":"(Prep needed if exploring the dwarven forge) Within the mountain is a dwarven forge and after a serious accident molten metals begin exploding out from the natural vents and caves.","weight":1,"range":[23,23],"drawn":false},{"_id":"0cSkK7ORZuJXbEvq","flags":{},"type":0,"text":"Beautiful crystals line hard to reach cliffs. If your players are fortunate enough to collect some they will unfortunately discover it begins growing on exposed skin","weight":1,"range":[24,24],"drawn":false},{"_id":"lrQCR0MSuSY08Fep","flags":{},"type":0,"text":"Rock insects have infested the entire range. Their camouflage allows them to be nearly invisible, watch your step of face their wrath","weight":1,"range":[25,25],"drawn":false},{"_id":"y1DjCIrXWEXflYYb","flags":{},"type":0,"text":"Wounded and dying of exposure, a warrior lies slumped in a pile of snow. She is incredibly strong and is hunting a Warlock who they have sworn to kill.","weight":1,"range":[26,26],"drawn":false},{"_id":"Ulue3o4o3tfE5DJ5","flags":{},"type":0,"text":"Strong winds threaten to force the party off the side of the mountain. Is it the wrath of nature or perhaps a supernatural entity?","weight":1,"range":[27,27],"drawn":false},{"_id":"K8OwDlCMfHvFcwkp","flags":{},"type":0,"text":"Fairies dance around a roaring waterfall. They act friendly and offer to heal the party, but beware.. They like to trick people into taking leaps of faith from the waterfall. If the a member goes to the bottom of the waterfall there is a small chest at the bottom of the pool, but they need to survive the jump first.","weight":1,"range":[28,28],"drawn":false},{"_id":"S7DRKqHqIK6Ea6RX","flags":{},"type":0,"text":"(Prep needed to build stalactites villages) Numerous quarries line the mountain range. Villages are littered throughout, all of them are hanging upside down like stalactites","weight":1,"range":[29,29],"drawn":false},{"_id":"Bl6YbbpBmyHDCQDL","flags":{},"type":0,"text":"A never ending fire burns within a crater. Travelers often come here to collect the flame, it is rumored that a god crashed here eons ago.","weight":1,"range":[30,30],"drawn":false},{"_id":"y8BN5fBqc0j6oEru","flags":{},"type":0,"text":"The only effective means of travel is a long winding road that forces the party to walk in a single file line. It is not much of an issue until an Orc party discovers the vulnerable party and sets a trap for them from the high ground.","weight":1,"range":[31,31],"drawn":false},{"_id":"PnuTsA4leXvj2dac","flags":{},"type":0,"text":"In a ravine the party is passing through there are a series of large stone pillars that are blade shaped. They cut through anything that touches them. The “blades” are razor sharp and they say that they were once the weapons of gods. Several Griffons will swoop overhead and use the blade pillars as a natural trap to kill their prey.","weight":1,"range":[32,32],"drawn":false},{"_id":"23T11hXqNHPAxejp","flags":{},"type":0,"text":"Deep within the blizzarding alps a lone peak is laced with flames. It is home to an ancient Dragon and a Sorcerer who worships and protects their master","weight":1,"range":[33,33],"drawn":false},{"_id":"L57vdYsB4sME3hgy","flags":{},"type":0,"text":"Roll for which player who is going to be kidnapped by a Giant. Have fun!","weight":1,"range":[34,34],"drawn":false},{"_id":"FxBVu35WGempxHmQ","flags":{},"type":0,"text":"A range of glass mountains shine brilliantly in the light. Their reason for existing is unknown","weight":1,"range":[35,35],"drawn":false},{"_id":"3IIRleNGye2YTFH4","flags":{},"type":0,"text":"Clouds swirl around the peak, they are dense and have an almost unnatural appearance to them, as if they were stairs leading up to the heavens, if the party chooses to walk on the clouds they discover an Aarakocra city that is built around a portal to the plane of air. They guard this portal to protect the material plane.","weight":1,"range":[36,36],"drawn":false},{"_id":"sXzTdbVZXHFQlTEc","flags":{},"type":0,"text":"Avalanche! The party are now trapped in a monster’s den. For a more dramatic challenge, all but one player is unconscious","weight":1,"range":[37,37],"drawn":false},{"_id":"CVxj2vDe1NIkcJHk","flags":{},"type":0,"text":"A sickly looking child is wandering alone in the cold, they speak incoherent gibberish. If the party help this child and let them travel along, after reaching a safe destination they will reveal themselves as a spirit of the mountain, rewarding the party with blessings or treasure","weight":1,"range":[38,38],"drawn":false},{"_id":"MuukFOYi3zW9ncfK","flags":{},"type":0,"text":"The mountain pass is long but not too difficult to traverse. However, this specific path is looping over and over again without end. A wizard is playing a prank on the party, by using illusions to force the party to go in circles. He likes to test how long a party will continue before they realize it. After the party figures it out he wishes to test the most intelligent member to game of intellect.","weight":1,"range":[39,39],"drawn":false},{"_id":"iuWamID6nWLOdrg7","flags":{},"type":0,"text":"Flail Snails emerge from the mountain caves at night, their shells lighting up the dark night. They are dangerous but can be easily tamed","weight":1,"range":[40,40],"drawn":false},{"_id":"GPM7GwczihH3Zxge","flags":{},"type":0,"text":"A meteor blasts through the summit, the debris rains down upon the party. It is quite deadly if they are hit. The crater is smoking and is home to a new mysterious plant","weight":1,"range":[41,41],"drawn":false},{"_id":"PAsBiPVnBmGjB0Iv","flags":{},"type":0,"text":"Smoke blows up from a dozen chimneys atop a bizarrely shaped house. It is home to a shy alchemist who collects rare materials from the alps","weight":1,"range":[42,42],"drawn":false},{"_id":"Sn265hHShikuWRbp","flags":{},"type":0,"text":"Clockwork animals occupy the area. They act like regular animals… All except for Archimedes the glitchy owl. A loud creature that claims to have been created by a space demon, a small crashed spaceship can be found if the party spends the day searching the mountainside","weight":1,"range":[43,43],"drawn":false},{"_id":"cAM8hGZONtdyDoV4","flags":{},"type":0,"text":"(Prep needed if party follows to find the city) Civilians are traveling all throughout the mountain pass. With all of their belongings they venture toward a developing city in the valley. It’s a great/safe place to make new connections","weight":1,"range":[44,44],"drawn":false},{"_id":"PBFmwKWhJBILban1","flags":{},"type":0,"text":"Spider webbing covers the entrance to a cave. Within the webs a sign reads, “Fortune readings in exchange for beautiful cups or tankards.” Sounds trustworthy enough. Inside is an old tabaxi that has trained two phase spiders. If she does not like the offerings made by the party she will not allow them to leave.","weight":1,"range":[45,45],"drawn":false},{"_id":"YtKOq2EKMo0i0ko4","flags":{},"type":0,"text":"An icy spring protected by a fey spirit who will become angry at anyone who attempts to drink out of it","weight":1,"range":[46,46],"drawn":false},{"_id":"S3XAZFpWsALq5x15","flags":{},"type":0,"text":"A camp of miners ask your party to sit down and join them for drinks. They are fascinated by the life of adventure your party leads","weight":1,"range":[47,47],"drawn":false},{"_id":"GXBg17T1Dm4OuAcn","flags":{},"type":0,"text":"Poisonous mist swirls around the sierra, be careful not to lose consciousness while it seeps through your skin","weight":1,"range":[48,48],"drawn":false},{"_id":"a0NG1y68czsNPpqD","flags":{},"type":0,"text":"(Prep needed if the party wishes to go to the monastery) Built into the side of the jagged stone, a Monk Temple sits peacefully amidst the storm","weight":1,"range":[49,49],"drawn":false},{"_id":"p5t1QKKx5KLwOl0T","flags":{},"type":0,"text":"Bound to the mountain, a hellish warrior slaughters anyone who enters their domain. They warrior cannot leave his domain (DM discretion how large this area is) They are horrendously powerful and would wipe out any unsuspecting low-level party","weight":1,"range":[50,50],"drawn":false},{"_id":"D3AA1bF32d4zn9rB","flags":{},"type":0,"text":"Hosting a prestigious singing competition, a Purple Dragon with a tie and top hat invites all to watch this once in a lifetime event. Gods, Spirits, Giants, Beholders, etc.. are all participants","weight":1,"range":[51,51],"drawn":false},{"_id":"mDbWtXOeoj8AJgjO","flags":{},"type":0,"text":"A campfire burns brightly on the side of the road, no one is around. Food is roasting, bottles left unopened, treasure left untouched. Do you search for those who set up this camp or take it for yourselves? It is another party of adventurers who may be on the same quest as you, but for different purposes.","weight":1,"range":[52,52],"drawn":false},{"_id":"cZxhiuzY994GGROD","flags":{},"type":0,"text":"The party comes across a range of cliffs that have the appearance of blood cascading down the sides. The \"blood\" is an overgrowth of Ruby Blushroses and Undead Bloodroses, which make the area beautiful up close but also sinister. If the party enters the cliff area the aroma of the Bloodroses becomes distinct and the area is heavily populated with undead. Party will be attacked as they try to leave. Those that die in this patch of the mountains become part of the undead that wander within the smell of the Bloodroses. You become attracted to the smell as part of the undead.","weight":1,"range":[53,53],"drawn":false},{"_id":"UHMj6zPndJ5KVkVH","flags":{},"type":0,"text":"Atop the highest peak is a pool of black liquid. Rumors say that those who drink from it have visions of the future. It is a well sought after ingredient for potion making","weight":1,"range":[54,54],"drawn":false},{"_id":"uVvlsp1KCg4C72V8","flags":{},"type":0,"text":"Frozen in ice a monstrous beast is slowly thawing, it is extremely powerful and once loose it would wreak havoc on all the countryside","weight":1,"range":[55,55],"drawn":false},{"_id":"PqnKD8wBskZXBqDN","flags":{},"type":0,"text":"During a storm the party while looking for shelter sees an old temple. In the middle of the temple is an altar with an opening that exposes open sky. If a party member approaches and touch the altar lightning will strike the altar and course through the party member. PC takes [[3d10]] lightning damage, but the party member’s eyes begin to glow as they have gained newfound powers. They’ve been selected by a powerful deity to carry out a prophecy","weight":1,"range":[56,56],"drawn":false},{"_id":"9TtIcvknvkpx7pfE","flags":{},"type":0,"text":"Thrown from the top of the mountain, a wooden chest filled with cursed magic items has been disposed of, never to be found again. Well until you rolled this random encounter","weight":1,"range":[57,57],"drawn":false},{"_id":"iGEm0aYBYxRIklNP","flags":{},"type":0,"text":"Hidden away from the rest of the world, an observatory keeps track of planetary movement, stars, and unusual phenomenon. The observatory is run by a elf who is part of a secret organization. The elf is unwilling to part with his secrets that reside within the somber halls.","weight":1,"range":[58,58],"drawn":false},{"_id":"zmKzJfTXqbHcYEOU","flags":{},"type":0,"text":"\"Single Large Obelisk Stone: The Obelisk is home to the Stoneman. A fey who can earthglide about and loves to insults adventurers. At the base of the Obelisk is a table with pies. The pies are made up of dirt and fungi. Each pie has a different effect. One pie might heal you. One pie might poison you. There are [[1d4]] pies, and with the [[1d6]] effect.","weight":1,"range":[59,59],"drawn":false},{"_id":"ymCdilELTl3ACoTY","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[60,60],"drawn":false},{"_id":"fXPeWlKzHWMsKCzR","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[61,61],"drawn":false},{"_id":"R4qTziht3jA2wCQd","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[62,62],"drawn":false},{"_id":"fyfeAeWT6le4m3v6","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[63,63],"drawn":false},{"_id":"bcM0q6OimQ1WGnTH","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[64,64],"drawn":false},{"_id":"XHWEGaY8NGd5Ss6c","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[65,65],"drawn":false},{"_id":"UtQ0SRysFMeyQZx0","flags":{},"type":0,"text":"60. Stone Well with Arcane Ruins, drinking the water grants the drinker the spell feather fall for one day","weight":1,"range":[66,66],"drawn":false},{"_id":"Ezu9OTHEtftYiKZM","flags":{},"type":0,"text":"61. Dragon Temple, Archway is cut into the mountain. Inside is a 6ft egg that is all stone. It is on a platform with pillars all around it. There is some weird language write on the walls and the pillars. This is a copper dragon egg, but the mother is away from the nest…for now.","weight":1,"range":[67,67],"drawn":false},{"_id":"SHivbTmaDKpyFhP3","flags":{},"type":0,"text":"62. A rope with pitons, old, hanging in the wall above. If the party climbs up to the where the rope ends a set of good climbing gear and a Human mythril pocket watch can be found in a crevice on a ledge with the skeleton of the poor Human, hand bones still stuck between a boulder and the cliffside.","weight":1,"range":[68,68],"drawn":false},{"_id":"LMoEkND2FizfwqQC","flags":{},"type":0,"text":"63. Ancient Stone Pillar that is destroyed.","weight":1,"range":[69,69],"drawn":false},{"_id":"pFE7YZ7caPeL4fQi","flags":{},"type":0,"text":"64. Cave opening, if Players come inside have a swarm of bats come out at them.","weight":1,"range":[70,70],"drawn":false},{"_id":"7XQd9CBz4NHxvuFO","flags":{},"type":0,"text":"65. Players come upon a large nest. Inside the nest is [[1d4+1]] eggs. There is nothing else in the nest right now. Roll [[1d100]], on a 50+ a Roc will show up in [[1d4]] hours if the eggs are taken and is very angry.[","weight":1,"range":[71,71],"drawn":false},{"_id":"wd6niqELVUSvAN2V","flags":{},"type":0,"text":"\"66. Party finds a cave roll a [[1d6]] to determine what is in it.","weight":1,"range":[72,72],"drawn":false},{"_id":"6EuOGqO3fu9TZzNG","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[73,73],"drawn":false},{"_id":"dTJarHE9qkJxyoYU","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[74,74],"drawn":false},{"_id":"Skpmd4UWvblVp6fq","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[75,75],"drawn":false},{"_id":"4sl142gwjpyakMDK","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[76,76],"drawn":false},{"_id":"a0p97gYlvOBVlGkM","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[77,77],"drawn":false},{"_id":"b0zSkxuVTzPVC0We","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[78,78],"drawn":false},{"_id":"coQLKfrOMwORyzuf","flags":{},"type":0,"text":"67. Half-Ogre (Brakor), He Lives in a small hut and is Neutral. Around the house is a bunch of bird cages. The Ogre is not going to be hostile to the PC. He protects animals and lives out here because he was rejected by his village.","weight":1,"range":[79,79],"drawn":false},{"_id":"GhuSJ3vhaG7gm8Qc","flags":{},"type":0,"text":"68. The party finds in a forgotten cave a body of a great hero placed in the isolated mountains to be naturally mummified encased in ice. The mummy was bound by cairns (large pile of carefully placed stones) that have since collapsed, releasing them as an enraged undead.","weight":1,"range":[80,80],"drawn":false},{"_id":"7xa0TFCGgGfQalWB","flags":{},"type":0,"text":"69. The party comes across several druids who follow Silvanus (God of Nature) who are making a holy pilgrimage to an ancient grove high up the mountains. If the party decides to join them they can watch an ancient ritual to Silvanus which only occurs once every 50 years. All manners of beasts and awakened plants will join in the ritual.","weight":1,"range":[81,81],"drawn":false},{"_id":"BEcxw9yWFetzjU23","flags":{},"type":0,"text":"70. The party finds tracks of a large bear and several smaller tracks that are very recent. A mother Bear w/ [[1d4]] Cubs will appear from a nearby forested area, they will be nervous and will defend their territory from the intruders.","weight":1,"range":[82,82],"drawn":false},{"_id":"sRNVqR9FhRcuS4we","flags":{},"type":0,"text":"71. A bunch of friendly Mage College kids are on spring break and are heading into a cave to do some spelunking, maybe a monster lurks in the cave and the party has to save the kids. Give each kid 2-3 cantrips that they know from Mage College to help in the fight.","weight":1,"range":[83,83],"drawn":false},{"_id":"NjmXhdDcUWYFE9VT","flags":{},"type":0,"text":"\"72. Abandoned Mine with lantern, buckets, pickaxe, and shovel present roll a [[1d6]] to determine the type of mine","weight":1,"range":[84,84],"drawn":false},{"_id":"Eu9gubBsDqVqcwn6","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[85,85],"drawn":false},{"_id":"WD7KD3hrmtF2pNXM","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[86,86],"drawn":false},{"_id":"nXok6GOhvN9N30S8","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[87,87],"drawn":false},{"_id":"HgC5532lld8X6aYu","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[88,88],"drawn":false},{"_id":"KyrEN99OCgQJDGOb","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[89,89],"drawn":false},{"_id":"q4HOdqG659vlqRNO","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[90,90],"drawn":false},{"_id":"A5VECc0diqik8jzF","flags":{},"type":0,"text":"\"73. A slow strain of smoke gives hints of a campsite. Roll a [[1d4]] to determine who is at the campsite.","weight":1,"range":[91,91],"drawn":false},{"_id":"gDQfnWnxhgrIKPk0","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[92,92],"drawn":false},{"_id":"wr29rcCF2Dae4qp2","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[93,93],"drawn":false},{"_id":"V1DD1VgesbFZBnP8","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[94,94],"drawn":false},{"_id":"3BC7L3Zj8e77qHeZ","flags":{},"type":0,"text":"TEXT MISSING","weight":1,"range":[95,95],"drawn":false},{"_id":"oBDRnKsRN4DQjwPL","flags":{},"type":0,"text":"74. A mountain man, is pilfering through a couple of recent corpses scavenging for food and supplies, he is desperate and there is a wild look in his eye.","weight":1,"range":[96,96],"drawn":false},{"_id":"9PVHt3dJglQQsDcQ","flags":{},"type":0,"text":"75. The party finds on the mountain slopes the skeletons of a giant and a dragon, still locked in mortal combat","weight":1,"range":[97,97],"drawn":false},{"_id":"thfmisgnYidhEuwJ","flags":{},"type":0,"text":"76. The party find a hidden Dwarven watchtower carved into a mountain face. They are not initially friendly if the party goes to investigate, but can be persuaded to let the party in with the right negotiation tactics. (Dwarves love their mead, ale, and spirits)","weight":1,"range":[98,98],"drawn":false},{"_id":"FmO1yvfhagoHIPHT","flags":{},"type":0,"text":"77. (Prep needed if party chooses to explore the city) A metal shack has a faint shimmer in the light, inside you discover a hideaway for Deep Gnome Guards. They are playing cards and are willing to make bets with anybody. If friendly enough they may let the party pass through into a Svirfneblin city that is located below the shack. A long deep elevator shaft can take them to city.","weight":1,"range":[99,99],"drawn":false},{"_id":"2gwLXeYLO4R0RvXa","flags":{},"type":0,"text":"78. The party find a small waterfall that is always frozen. A group of Ice Mephits live here with their pet Polar Bear. If anyone goes to investigate the waterfall closely they will warn the party to stay away, if the party is persistent they will let loose their pet.","weight":1,"range":[100,100],"drawn":false},{"_id":"cWwWIhQB9km6T0PP","flags":{},"type":0,"text":"79. (Prep needed if party wishes to investigate the fort) Ruined, abandoned fort heavily fortified in the mountains","weight":1,"range":[101,101],"drawn":false},{"_id":"AeTXSRnQWTei5bOi","flags":{},"type":0,"text":"80. The party uncovers a wrecked and frozen hull of some great ship, how did it get up in the mountains?","weight":1,"range":[102,102],"drawn":false},{"_id":"XXlXOkhzJk0YoMTw","flags":{},"type":0,"text":"81. An elk stampede is coming towards the party. The elk are startled because of Orcs riding Worgs that are hunting the herd, they are hostile if they encounter the party","weight":1,"range":[103,103],"drawn":false},{"_id":"PXRzxYh1g0LQ7FWF","flags":{},"type":0,"text":"82. The party's path is covered in thin ice that could become treacherous to try and cross","weight":1,"range":[104,104],"drawn":false},{"_id":"XJIPF8zfNcHZTKd9","flags":{},"type":0,"text":"83. A sudden blizzard hits and the party has to make skill checks to attempt to find their way in this blizzard, if they fail they can become disoriented and may need to stop and find a nearby shelter","weight":1,"range":[105,105],"drawn":false},{"_id":"kDWRQ2M16sUPq2UM","flags":{},"type":0,"text":"84. Heavy snow hits which halves the speed of the party's march this day. It also becomes extremely cold and if the party isn't prepared may suffer levels of exhaustion","weight":1,"range":[106,106],"drawn":false},{"_id":"dCKQnP8tcRiwWJSu","flags":{},"type":0,"text":"85. A mountain with snow on the top, mid way is covered in cherry blossoms, and the bottom mostly mud and rock. The mountain will look like a god dropped their giant Neapolitan ice-cream.","weight":1,"range":[107,107],"drawn":false},{"_id":"E2xU4NPjELM72cMo","flags":{},"type":0,"text":"86. The players spot a man at the peak of a mountain, standing unmoved by the strong wing staring away at something on the horizon. If they approach him the man explains that he's a sorcerer and is about to spread his daughter's ashes in the wind, with an enchantment on them to grow a maple tree wherever they fall. If they let him, they find the path ahead of them later to be filled with these trees, and occasionally find creatures embedded in them.","weight":1,"range":[108,108],"drawn":false},{"_id":"wX77KPWxGGU6H6UG","flags":{},"type":0,"text":"87. Party comes across an Archeologist and his small band on a dig. They are uncovering a monstrous leviathan that may have come from the far realms. If the party helps out the Archeologist a PC may have visions from the far realms and suffer madness as they uncover an artifact. Or they get some boon from the artifact as the artifact can tap into a small amount of a Great Old One's power.","weight":1,"range":[109,109],"drawn":false},{"_id":"ZGZFqF1fmGFDXBXx","flags":{},"type":0,"text":"88. Fresh water mountain stream with small flakes of gold, a prospector is at the stream. He is friendly unless the party tries to steal his gold in the stream.","weight":1,"range":[110,110],"drawn":false},{"_id":"ySuFBgL3GmlIMtu6","flags":{},"type":0,"text":"89. A Fey Goatman is herding his sheep through the mountains. The fey has lost one his sheep and asks the party to help him look. The Goatman warns these sheep are more unique than what the party is use to. The party can search for the sheep. The sheep are hard to catch as they have the ability to dimension door across the mountainside. A dispel magic, counterspell, or a well timed grapple might be able to help corral the sheep. The Goatman will reward the players for helping him out.","weight":1,"range":[111,111],"drawn":false},{"_id":"OYvSzC8U4bbsBUHS","flags":{},"type":0,"text":"90. A broken bridge appears before the party with a rushing river beneath. The party needs to figure out how to cross the bridge without falling into the rapids and possibly get hypothermia. A troll or other monster might be living near the bridge.","weight":1,"range":[112,112],"drawn":false},{"_id":"hSVHH1Hb331RdWMg","flags":{},"type":0,"text":"91. They find a traveler almost frozen to death, will they give him rations? Lose time by trying to help him back to the village? Leave him to die?","weight":1,"range":[113,113],"drawn":false},{"_id":"gD6VNbxFXQPdgShd","flags":{},"type":0,"text":"92. Mountain pool with some beautiful flowers on a small island in the middle of crystal clear pond. There is a statue in the middle. The statue is protected by a Water Genasi and its friend Water Weird. The Genasi is sitting cross-legged meditating on the island. There are sapphires at the bottom of the pond that are easily visible through the clear waters. If a person tries to enter the water the Genasi will warn not to disturb the water, the statue does not like that. If they persist and enter the water to get the sapphires then the water will freeze solid trapping the person underneath the ice or the PC is stuck in place halfway in the water. The Water Weird appears and the Genasi begrudgingly pulls out its greatsword, Roll initiative.","weight":1,"range":[114,114],"drawn":false},{"_id":"IzzAqmNaJRjdk2bR","flags":{},"type":0,"text":"93. A black knight stands in the path of the party and does not let anyone pass. The black knight will demand a duel. Feel free to add in any Monty Python references you deem necessary.","weight":1,"range":[115,115],"drawn":false},{"_id":"1L6N2Izh72oMTQJE","flags":{},"type":0,"text":"94. A Dwarven patrol. Will warn of common dangers in the mountains.","weight":1,"range":[116,116],"drawn":false},{"_id":"Ci6JypGY1XrmTKsc","flags":{},"type":0,"text":"95. A Hill Giant patrol, which will attack.","weight":1,"range":[117,117],"drawn":false},{"_id":"McxXI72wjOCH1Z69","flags":{},"type":0,"text":"96. Rock slide which has collapsed part of the road. Party must either turn around and waste several hours with an alternate route, or make some climb checks to avoid some damage/being trapped for awhile in a small ravine.","weight":1,"range":[118,118],"drawn":false},{"_id":"qEwjxw2nuyT8W3d1","flags":{},"type":0,"text":"97. Owlbear wandering by itself. It is quite hungry. With a large amount of food offered, it will follow the party around for a bit and help out for a little while if the party befriended it, if not enough food is given it will see the party as food.","weight":1,"range":[119,119],"drawn":false},{"_id":"oYgq8zwmZOwYfS6T","flags":{},"type":0,"text":"98. Two mountains that started as one, but now have a giant circular gap in the middle, presumably from a meteor blast. The two mountains converge at a singular point, and that point has a chunk of meteor balancing perfectly on it. If the players decide to interact with the meteor and disturb the balance whatsoever, the two mountains start to collapse and the players must restore the meteor for them to stop","weight":1,"range":[120,120],"drawn":false},{"_id":"EP2rZyhpDhgKfXDR","flags":{},"type":0,"text":"99. Mountain goat. Will chew on any clothes of any character who comes nearby and will be generally friendly. Can readily climb up and down the mountain with no problem, but cannot carry a humanoid rider. Cannot act like a pack animal, either.","weight":1,"range":[121,121],"drawn":false},{"_id":"HSv2zrm4zjhfTqH6","flags":{},"type":0,"text":"100. Party comes upon a cave housing a family of Winter Wolves. The beasts will growl warningly if the party tries to enter, and will attack if the party tries to force their way in. The party can continue on past the entrance, but the beasts will follow the party (perception rolls or just general sense of being stalked) and will ultimately attack the party at night if not dealt with beforehand.","weight":1,"range":[122,122],"drawn":false}],"formula":"1d122","replacement":true,"displayRoll":true}