{"_id":"f5edqccZZ7Ak1xnW","name":"Road (Non-combat)","permission":{"default":0,"fKShf9sFzL9Lwpkr":3},"folder":"dYeIr3PoXcISCtHZ","sort":100000,"flags":{},"img":"icons/svg/d20-grey.svg","description":"","results":[{"_id":"ZcdEbUUFW6C6fvNT","flags":{},"type":0,"text":"You come across an older gentleman traveling down the path with a group of 6 small dogs walking behind him. He has them each on a small leash that is attached to his large backpack, filled with dog clothes and toys. Over the last few years, this man has trained these dogs to preform tricks. He is traveling from town to town to try and become a famous performer.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[1,1],"drawn":false},{"_id":"G26WMg6qw7bjAkjV","flags":{},"type":0,"text":"You pass a person draped in flowing red and gold cloth, eyes closed and performing what looks like an incredibly slow dance. Around them are several unconscious bandits.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[2,2],"drawn":false},{"_id":"mOB3UcmdrVYAe3ft","flags":{},"type":0,"text":"You see an old woman with a young girl that is slowly moving towards your group. When you come closer you notice that the woman is actually blind, and the girl is guiding her. That woman gets intense when you come closer and gives away a series of phrases, each of those can be treated as a prophesy.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[3,3],"drawn":false},{"_id":"4VhhiLtuWJzoUjez","flags":{},"type":0,"text":"A pair of newlyweds on their honeymoon headed to a secluded cabin in the woods. They’re both charming and friendly, but the longer you talk to them, the clearer it is that something’s amiss. Specifically, it’s very clear that the groom has quite a lot to gain in the event of the bride’s untimely demise.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[4,4],"drawn":false},{"_id":"TeVJSFE1bQVYuvLq","flags":{},"type":0,"text":"You kick a rock, and it appears to grow legs and claws. On close inspection, it is a fist-sized crab disguised as a stone. All rocks in the immediate area reveal themselves to be crabs as well, which begin scattering into the grass. If one is captured, it disappears during the next long rest.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[5,5],"drawn":false},{"_id":"HQV2pgg3NrrN3Hne","flags":{},"type":0,"text":"A dog leashed to a tree. There doesn’t seem to be anyone else around, but if the party takes the pup its owner will try to find it.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[6,6],"drawn":false},{"_id":"D8QhORqRurP6HaDn","flags":{},"type":0,"text":"A short woman peddling used magical talismans out of a cart. Her assistant, a large deaf giant who is pulling said cart, grins whenever someone comes near. Her name is Tabitha and she’s rather charming in a soft-spoken way. A bit of prodding into the pair reveals they are both friends who once adventured together.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[7,7],"drawn":false},{"_id":"RWVvT9bpk7FhwQuX","flags":{},"type":0,"text":"A man in tattered robes who claims to be nobility who was forced from his home by a wicked sibling. More likely he was kicked out for being a greedy twit, but the party can learn that on their own time as he makes more and more requests.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[8,8],"drawn":false},{"_id":"WFh0UzhOUrENrvId","flags":{},"type":0,"text":"Two kobolds standing on top of each other wearing an old cloak. They claim they are a famous dragonborn warrior, and they do not seem to know that they are actually two kobolds.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[9,9],"drawn":false},{"_id":"orIK1zkAsBwsYxQ4","flags":{},"type":0,"text":"A pair of horses, seemingly abandoned. A further inspection reveals they are still wearing riding tack and seemed to be abandoned in a hurry.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[10,10],"drawn":false},{"_id":"jzRRoLfnKc7HfICo","flags":{},"type":0,"text":"A person digging a grave, with a body of some sort in a shroud nearby.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[11,11],"drawn":false},{"_id":"hV9xexEbiwjlDwCO","flags":{},"type":0,"text":"A lizard folk wearing a paladin’s armor. He poorly impersonates the paladin whose armor he has and pretends to be lawful good. Or maybe he’s had a change of heart after getting the gear. Either way, he’s hungry.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[12,12],"drawn":false},{"_id":"fB3AIJKgMrsSpI5m","flags":{},"type":0,"text":"A shepherd with a dozen sheep. He keeps insisting that all the sheep are his and keeps looking over his shoulder.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[13,13],"drawn":false},{"_id":"nJPMc5bjBi0W13kJ","flags":{},"type":0,"text":"A 10-man road crew removing a stump from the middle of the road. Four of the crew are armed with bows and complain about a dryad interfering with their job. Two are doing the actual work of removing the stump. The rest are ‘supervising’.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[14,14],"drawn":false},{"_id":"KIgbKL5lSKtjpK74","flags":{},"type":0,"text":"A flash flood has blocked part of the road. A sorcerer is standing nearby offering to clear a dry path for a small fee. The sorcerer is true to their word and forms a dry channel to the other side. After crossing, the channel, the flood and the sorcerer disappear.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[15,15],"drawn":false},{"_id":"KuZdO6NtdkjuXA33","flags":{},"type":0,"text":"A pure black, unnaturally tall Tabaxi. She offers a magical item of the DMs choice in exchange for an interesting story. A player must offer a story that reveals a portion of their backstory and beat a DC 14 persuasion check to receive the item. Each player may attempt this once, but each time it is failed the Tabaxi’s interest wanes, increasing the DC by 2. If the Tabaxi’s DC reaches 20, she retracts, unimpressed, and leaves.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[16,16],"drawn":false},{"_id":"nVlQbQnqIT774AHU","flags":{},"type":0,"text":"A small and poor family, all their belongings in tow, moving to a new town.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[17,17],"drawn":false},{"_id":"Us8yKRdWpp2WxtXC","flags":{},"type":0,"text":"A Firenewt wizard who sells magic minerals, crystals and dusts. He lives in a hut with a large fire in the middle. He spends most of his days at home making powders and crafting near the fire. Although he is not the kindest, he is smart strong and helpful. He sells magical and non-magical jewelry, fireworks, components and ingredients for spells and recipes.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[18,18],"drawn":false},{"_id":"DcemonkT1v8pO6oq","flags":{},"type":0,"text":"A lonely Bullywug who got lost and lives in a cave. He considers himself the emperor of the cave. He has other frogs and toads as minions and guards.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[19,19],"drawn":false},{"_id":"KjpWq6PrnhF6t0AV","flags":{},"type":0,"text":"You see two figures riding on horseback: a halfling and a green dragonborn. They trot along for about a mile until they come across a heavily guarded ornate caravan on the side of the road. As it turns out, the dragonborn is a senator, on his way back from a trip to the outer villages. They stopped to feed and water the horses, and the dragonborn accidentally dropped his keys in the caravan. The halfling is the locksmith from the next town over.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[20,20],"drawn":false},{"_id":"NJqzBwgrybxRb6QZ","flags":{},"type":0,"text":"A stray dog, hungry and dirty, desperately needing help. It has a collar with a note attached to it which seems to be a cry for help!","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[21,21],"drawn":false},{"_id":"ZtSgAM4yk3zkIx5I","flags":{},"type":0,"text":"A Rival party of the exact same class but different archetypes. They are a little obnoxious to their counterparts and are out to do the same quest/mission/thing the party is up to.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[22,22],"drawn":false},{"_id":"Xa7a6RCD08BPLMCy","flags":{},"type":0,"text":"A black knight traveling on horseback. Could be revealed to be some sort of illusion, or a wandering boss-type monster.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[23,23],"drawn":false},{"_id":"1cxbrjEvzTNuJCOw","flags":{},"type":0,"text":"A hungry beggar, who if helped will come to their aid at a later date, if shunned will do the opposite.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[24,24],"drawn":false},{"_id":"SqXqMJBq3cD551hA","flags":{},"type":0,"text":"A crazy old man who claims to know where a secret forest full of magic is located. You follow him but he is actually just trying to take you back to his home because he has lonely ever since his wife died.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[25,25],"drawn":false},{"_id":"TaYtXY10YKRVumOK","flags":{},"type":0,"text":"Two older males each riding a giant snail. They sell common magic items, maps of nearby cave systems, and may teach the party how to enhance potions.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[26,26],"drawn":false},{"_id":"a6n1FZkEUNAtfIa8","flags":{},"type":0,"text":"A man with piercing blue eyes, all visible flesh but his eyes wrapped in cloth bandages. Adorned in worn and dirty cloths of a nobleman and carrying a religious text. He is polite and intense obviously religious and with a deep silky voice. Upon closer inspection, his flesh appears burned. Omens of doom and death follow in his wake.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[27,27],"drawn":false},{"_id":"XC06eG0RFxqdTSkf","flags":{},"type":0,"text":"A group of guardsmen transporting the corpse of their beloved countess back to her homeland. Upon conversation, the guardsmen believe foul play was involved and ask the adventurers to investigate.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[28,28],"drawn":false},{"_id":"NMGZij4GPCj24L3r","flags":{},"type":0,"text":"Harrin, the halfling Chef and his employees, all halflings. They travel in search of the Gloomy Mushroom, said to be the most delicious thing there is. A big and gentle half-orc is their bodyguard. His nickname is Joy.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[29,29],"drawn":false},{"_id":"WvLob4n0O02LcmyB","flags":{},"type":0,"text":"A blind man stumbling along the road with a stick. If the party stop to talk to him, he will talk about how he was the best bandit in the area in his youth. Problem is he never quit when he lost his sight. His buddies are hiding in the wilderness on the side of the road and have been lining up shots on the party with their slingshots and short bows.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[30,30],"drawn":false},{"_id":"ElgL6uxLMVhNVeBW","flags":{},"type":0,"text":"A band of travelling bards called Heart of a Dragon on a middle of their ‘biggest tour ever’ where they are playing in multiple cities of the world. They could be a recurring encounter on different roads.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[31,31],"drawn":false},{"_id":"gp6XnoqCHK5hyQcp","flags":{},"type":0,"text":"A group of monks on a pilgrimage to a shrine of their order to meditate and receive training.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[32,32],"drawn":false},{"_id":"MqDsH19xkr2gATBH","flags":{},"type":0,"text":"A travelling circus with a bunch of performers, one of whom is offering to perform their tricks (tarot readings or a future event cryptic reveal) at the side of the road for a couple of coin.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[33,33],"drawn":false},{"_id":"yFagqE4lgfLooUxy","flags":{},"type":0,"text":"A zealot on a religious pilgrimage to a far-off holy site. The pilgrim has only just started and is full of spunk and cheerful evangelism. This is the pilgrim’s first pilgrimage and up until now has led a very sheltered life.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[34,34],"drawn":false},{"_id":"uwTL8rPGvGsUoeGB","flags":{},"type":0,"text":"The wizard Leander from Leander’s Luminous Launderette and Lavender Lavatory. They have been assaulted on their travels, both the wizard and their apprentice were injured (the apprentices wounds poisoned and almost surely infected, gangrenous, and without the help of a cleric; probably fatal.) and their wagon and gear stolen.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[35,35],"drawn":false},{"_id":"uMSppM1QHUOfb3kT","flags":{},"type":0,"text":"A band of highwaymen posing as religious ascetics on a pilgrimage to a nearby temple. They plan to rob the holy site and kill everyone inside its walls.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[36,36],"drawn":false},{"_id":"pxilRPi72a5wgAaK","flags":{},"type":0,"text":"A farmer and family in tow, with three oxen, two sheep, five pigs, and seven geese following the heavily laden cart. A single rocking chair is perched precariously on top with a grandmother strapped into it.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[37,37],"drawn":false},{"_id":"XZFK8rbSxxi8XzbG","flags":{},"type":0,"text":"A travelling troupe of down on their luck performers with a small problem that the players can solve. In their troupe is a budding young master storyteller who is sure to be deeply interested in the players and their stories. Help or Impress them here, and tales of the team’s exploits precede them in the next big city.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[38,38],"drawn":false},{"_id":"9ieZ6FAvCi70bbzU","flags":{},"type":0,"text":"A dimwitted farmer who was sold a cat in a bag (and had been told it was a piglet). The farmer is despondent and has spent every penny they had in the hopes of changing their fortune.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[39,39],"drawn":false},{"_id":"zNJ8JsC4xiT1E60x","flags":{},"type":0,"text":"A peddler with an old horse and half broken cart who has gotten stuck in a muddy rut. The peddler is actually a spy travelling under cover and the wagon was deliberately stuck to provide an excuse to make contact. Alternatively, the goods the peddler is carrying are obviously stolen from a local power or religious group and the players may or may not know about it happening, and the peddler is willing to do a lot of things to not be caught.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[40,40],"drawn":false},{"_id":"kyttVUvUrHP06W1T","flags":{},"type":0,"text":"An incompetent adventurer that won’t take no for answer and plans to head wherever the players are going. The adventurer is friendly but seems to be trying too hard.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[41,41],"drawn":false},{"_id":"j6oZfJtiydVPzYe3","flags":{},"type":0,"text":"A knight travelling with a very small, or nonexistent retinue. The knight has been forced to sell his prized warhorse for some reason, or have it knackered due to severe injury. Alternatively, the knight is actually a Paladin doing religious penance and has vowed not to ride a horse or cart for the entirety of one month and one day.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[42,42],"drawn":false},{"_id":"jGV60qJQ4o3C4VPD","flags":{},"type":0,"text":"A pack of dirt-covered Dwarf miners’ approach from off the road, offering to trade very valuable gems for some ale and food (‘not trail rations, real food!’). They have just struck upon a massive gem deposit and wish to celebrate. Hope you have some with you.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[43,43],"drawn":false},{"_id":"BfylkrYY5OdOVHoc","flags":{},"type":0,"text":"A hunter approaches, asking for your aid. He is gaunt, obviously hungry. He says he has tracked an Owlbear to a nearby cave, and if you can help him kill it, it will feed his family for a month.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[44,44],"drawn":false},{"_id":"mU07GJhPcQ8DjrRF","flags":{},"type":0,"text":"You see a man’s corpse in the middle of the road. A young man, no more than eighteen or nineteen. His throat has been cut. If you stop to examine the body, you quickly see a search party coming toward you from the wood. They are looking for the man. And you should not be so close to him.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[45,45],"drawn":false},{"_id":"wxHJiKapJf4gd5YA","flags":{},"type":0,"text":"You notice an elf slumped against a tree, covered in blood and on the verge of death. He reveals that he is a courier and was ambushed by bandits. He tells you that they didn’t find the message he carries; it is hidden inside his boot. He asks you to deliver the message for him to a woman named Ella Corwyn in the village of Threader’s Hollow, a few days ride out of your way. If read, it is a simple message from her son, Dennis, who is training in wizardry with the elves. If delivered, Ella will feed your group (hearty lamb stew with delicious homemade biscuits) and offer shelter in her barn, alongside her prize pig Josephine.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[46,46],"drawn":false},{"_id":"cGDVhwTb5HJ9EmA5","flags":{},"type":0,"text":"A bear wearing a vest and derby hat is selling expertly crafted Masterwork musical instruments from an ox-drawn cart hitched to a tree by the side of the road. His name is Sir William Bearington III. He does not speak but can understand and scratch out misspelled replies on a chalkboard in Common. Should you attempt to steal from him, he will attack without hesitation, as a Dire Bear. A small collection of bards of various races have formed an impromptu jam session in a clearing nearby. They sound great, and if asked, they attribute the sound to the quality of the instruments. Anyone with a proficiency in a musical instrument and enough gold in their purse must succeed on a DC 10 Will save or feel compelled to buy one. Prices are high (2x), but the craftsmanship appears to be worth it. A flamboyantly painted sign on the side of the cart in bold calligraphy reads: “Musickyl Innstrumynts of Fynest Make, Experrtly Crafftyd by Sir Wm. Bearington III, Proprytor”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[47,47],"drawn":false},{"_id":"4yM96cYE2F92HBHc","flags":{},"type":0,"text":"A trio of dirty peasants is riding past on an impossibly fancy carriage. They nervously smile and wave at your group. A DC 18 spot check will notice a smear of blood on the side of the carriage.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[48,48],"drawn":false},{"_id":"lEinMBHh8TpkkWPp","flags":{},"type":0,"text":"You come upon a group of a dozen or so young human men. They carry spears and wear leather armor. They appear to be trying to get your attention. If attacked, they immediately flee. If spoken with, they claim to be soldiers and demand a tax. If refused, they brandish their spears and talk about the wrath of the King but will flee at the first sign of violence. In reality, they are cowards and deserters, trying to make their way South.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[49,49],"drawn":false},{"_id":"wOYa5nRmRlrT3SCH","flags":{},"type":0,"text":"A man begs for help. He has been “robbed by bandits. Please, kind strangers, a ride into the village that’s just a day’s travel away?” At the earliest opportunity, he will attempt to steal something of value and ride away on your horse. If it seems like a good idea, he will stab you first.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[50,50],"drawn":false},{"_id":"xUGYHI2QVoJbLL1N","flags":{},"type":0,"text":"A very elderly couple flags you down. They ask you to leave some silver as a remembrance for their son, who was killed on this very spot twenty years ago.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[51,51],"drawn":false},{"_id":"TZMAeToPkolPzAkX","flags":{},"type":0,"text":"A Giant sits in the clearing, he is weeping. The sounds of his tears echo across the open space. His wife was recently killed by adventurers, and he will fly into a rage upon seeing your weapons. If you manage to calm him down, he introduces himself as Urgirr and will beg you to find justice for his wife by killing the Orc Barbarian “Karnak the Bold”, the Human Wizard “Aldo Blackhand”, the Dwarf Cleric “Tordok of the Mountain”, and the Gnome Rogue “Swindlow Duffington Dingle”.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[52,52],"drawn":false},{"_id":"gfmoKA1o4SSPuKw9","flags":{},"type":0,"text":"You come upon an impossibly elderly dwarf, naked as the day he was born, standing in the middle of the road demanding a 10 gp toll be paid. He wields a quarterstaff and proclaims himself to be the King of the Road. Thankfully, his long white beard shields his wrinkled nethers from your view.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[53,53],"drawn":false},{"_id":"dBkZf5dmbtwnA5sz","flags":{},"type":0,"text":"A longbowman challenges all takers to a hunting contest. A 100 gold bet. Whosoever can kill the most birds in one hour wins the purse.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[54,54],"drawn":false},{"_id":"Ygitd6EODc9gcXoO","flags":{},"type":0,"text":"Morty Mennecaum, a traveling gnome alchemist has set up shop in this unlikely location. His prices are a bit above average, but he loves a joke and will negotiate if someone can make him laugh. His son, Manny, a burly fighter with a Longsword and steel shield, eyes you.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[55,55],"drawn":false},{"_id":"pIlcgZSk774vzaWT","flags":{},"type":0,"text":"A ghost hovers in your path. He is Gregor Jantos. He asks you to deliver a message to his wife Alya in a nearby town: “It was no accident. Kelvar cut me open to get to you. Don’t trust him.” When you find Alya, she has been married to Kelvar for nine years and they have a daughter together. They are quite the happy family. Gregor died twelve years ago, and he wasn’t well-liked in town. He had a reputation for getting drunk and beating on Alya.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[56,56],"drawn":false},{"_id":"MfrT6oXiHa7RFEXf","flags":{},"type":0,"text":"A twelve-year-old boy sits cross-legged atop a boulder that seems out of place near this stretch of road. He wears a circlet of rope around his head. If spoken to, he will open his eyes and acknowledge you and appear to pay attention, but he will not speak. He will answer yes or no questions with shakes of his head. He has taken a vow of silence and is on his way to becoming a Monk. If begged for assistance, he can show you to his monastery where you may sleep, eat, and train for up to a week.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[57,57],"drawn":false},{"_id":"INN0yai22xPkTLET","flags":{},"type":0,"text":"A townsman (Garg) is arguing with a traveling salesman (Phineas). He claims that he paid for 50 miracle cures, but the crate the salesman gave him only contained 46. The salesman claims that the customer must have drunk four of the doses of the cure because he “has a system”. The dispute is over 8 gold pieces.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[58,58],"drawn":false},{"_id":"8HHB65OzQLilsRD1","flags":{},"type":0,"text":"A traveling salesman blows past you on a cart. He is being chased by half a village who run after with axes and pitchforks. They claim he took advantage of them by selling them colored whiskey in a vial and saying it would cure Miner’s Fever. If you catch the salesman, he claims it’s honest work, selling people hope for an otherwise hopeless disease. He will give back 75% of the town’s money if you Intimidate him (DC 15). If you beat his Intimidate DC by 10 or more, he gives it all back.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[59,59],"drawn":false},{"_id":"y3N0FEyzwnWF7IhH","flags":{},"type":0,"text":"A patrol of royal guards is approaching. Six stout men, at least somewhat injured, guarding what seems to be an iron strongbox. They are traveling quickly. They say that they can tell right away that you are trustworthy folk, and they ask you to join them in transporting their incredibly valuable cargo to the King–which is several weeks travel out of your way–promising a small reward for the effort. Should you refuse, they again stress how incredibly valuable their cargo is, and explain that they are tired and weak from their journey, and vulnerable to bandits. If the strongbox is opened (by killing the guards and picking a difficult lock), it contains a letter from another kingdom–a peace treaty.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[60,60],"drawn":false},{"_id":"we2hsahJHUm9yKmj","flags":{},"type":0,"text":"A group of four small children, no more than eight or nine years old, proudly stops your group. They are adventuring heroes and want to join your party. To kill nasty trolls, and slay horrible dragons, and stay up as late as they want.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[61,61],"drawn":false},{"_id":"ExHg4nJBtfvVXj0P","flags":{},"type":0,"text":"A crowd of townsfolk equipped with makeshift weapons and torches is marching towards a nearby city. They proclaim that they are going to do battle with a minor local lord because his taxes are too high. If there is a fight, they will certainly be slaughtered.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[62,62],"drawn":false},{"_id":"1tDaagG9iU4oiWCl","flags":{},"type":0,"text":"A small group of three older women, dressed in homespun and dirty shawls. One woman has a swollen foot and walks with a limp. One has a swollen and infected lip and drools when she speaks. A third has a twisted and infected finger, rendering her unable to grasp anything. One wields a set of shears, one a sack of prepared flax fiber, and a third a distaff and spindle. They are fey in disguise with strange power, prophetic foresight, and strange ethics. Alternatively, they are witches/hags with questionable motives, but a moral code of ‘rewarding’ those who show them respect they feel they deserve.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[63,63],"drawn":false},{"_id":"VjWUAdX77iZwl8zH","flags":{},"type":0,"text":"An etymologist in absurd getup with a comedically large bug net, short shorts, pith helmet, socks and sandals. They ask for assistance catching something only they can see.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[64,64],"drawn":false},{"_id":"B7wNaJeHpq2kMQsT","flags":{},"type":0,"text":"You hear them before you see them. As you approach a bend in the road you hear two voices, each loudly complaining about the other. “You said you knew where we were going!” “I said that it was East, you’re the one who said a map was a waste of money!” A female Goliath sits on a fallen tree at the side of the road. A female Halfling is perched on her shoulders passing a wineskin to her companion.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[65,65],"drawn":false},{"_id":"PdEOhwkR1CVD48BC","flags":{},"type":0,"text":"A seemingly normal looking man who greets the party on the road. He will mostly address the party member with the most magic jewelry. After some awkward conversation he will quickly make an attempt to steal the jewelry and run. When the party persuses him he turns into an ancient copper dragon and flies off. They won’t be able to track him. Later if the party is investigating crimes in a nearby city, they might catch word of an illegal magic black market. The copper dragon is the kingpin of the operation and will give the items back when confronted.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[66,66],"drawn":false},{"_id":"ZILiTLfuutJXrJoT","flags":{},"type":0,"text":"The sky darkens and it begins to rain heavily. You see a man coming the other way, carrying a heavy umbrella and wearing a heavy coat. It rains for as long as the man is in sight, and then immediately clears.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[67,67],"drawn":false},{"_id":"Fi0CAoDLZ1IjUSPx","flags":{},"type":0,"text":"Seven dwarven miners bid you good day as they go to work in their mine.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[68,68],"drawn":false},{"_id":"F3yGgo1ltP02PHQ5","flags":{},"type":0,"text":"A cartographer passes who is willing to sell a copy of his map of the area for 40gp. With this map the party can travel at an additional 1d4 miles per day of travel within the area of the map.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[69,69],"drawn":false},{"_id":"yaueUP1WhXO2J6pq","flags":{},"type":0,"text":"You find a wandering disciple of Gond (or any other similar god of crafting) who offers to repair any broken or damaged equipment.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[70,70],"drawn":false},{"_id":"usYleF2EqUiBlHwd","flags":{},"type":0,"text":"A wounded young knight laying down on the side of the road. His quest to save the princess from the dragon had failed, again. He went with a few adventurers and mercenaries, but he was the only survivor left.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[71,71],"drawn":false},{"_id":"ESEOjDDW8dU8OXch","flags":{},"type":0,"text":"A fortune teller sits on the side of the road in a cart that she seems to operate her business out of. There’s a sign on it that explains that a simple fortune is 1 silver, but a more intricate fortune is 1 gold. (If asked to prove her talent, she performs a simple druidcraft cantrip showing tomorrow’s weather and tells them to come back tomorrow to see her if she’s correct. This may be a good place for an insight check). If any party member gets a fortune told, the DM can choose the fortune, or she can foretell imminent death in their path.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[72,72],"drawn":false},{"_id":"x1Kdk2C90tb8CQLa","flags":{},"type":0,"text":"A gnome is underneath a curious wagon, fiddling with a mechanical apparatus and swearing up a storm. He refuses help and insists you would just get in his way.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[73,73],"drawn":false},{"_id":"KD46gsj0X7JKs3sO","flags":{},"type":0,"text":"Three high-elven sages can be seen bickering among themselves, arguing over the interpretations of a certain book on Arcana. The party is completely invisible to them if the sages are not addressed/greeted.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[74,74],"drawn":false},{"_id":"S03JkfGrskUBuOFN","flags":{},"type":0,"text":"A man with bandages over his eyes, a boot slightly larger than its mate, and a sort of mechanical prosthetic hand being led a pseudo natural hound. When questioned about the clearly unnatural dog, he just says ‘I trust him. He led me back out of there’.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[75,75],"drawn":false},{"_id":"uFiOTfFCXtgruuZJ","flags":{},"type":0,"text":"A chef with a small restaurant/tavern sets up on a rarely traveled roadside wondering why he never gets any customers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[76,76],"drawn":false},{"_id":"Xum47TKor08v5Uw5","flags":{},"type":0,"text":"A tattered old man sitting by the roadside will ask for change to help feed his dog. If you spend enough time with them, the dog reveals itself to be a druid and the pair attempt to rob you.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[77,77],"drawn":false},{"_id":"GOihWqE6z5QzCh97","flags":{},"type":0,"text":"An elf and a dwarf on a cart pulled by a couple of oxen. Both wear expensive, gaudy clothes. The dwarf is puffing on a clay pipe and has an ornate repeating crossbow on his lap. They offer the party a chance to buy their wares and show them the collection of arms and armor in the cart; all used, some very obviously, with dented armor, nicked blades and blood stains. There are a few good pieces and at a good price. If there are any magical items, the vendors are unaware of this and sell them as standard. These characters make good money from looting battlefields, most of this haul from a recent clash between two nobles’ armies. At your discretion the elf may have a wand or two up his sleeve in event of trouble.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[78,78],"drawn":false},{"_id":"oBSeEwb6MVngkNi2","flags":{},"type":0,"text":"A woman and six small children approach in an ox-drawn wagon. They appear dirty, tired and apprehensive, but if the party is friendly the mother will share her story: the father has run out on his family, and they could no longer afford to live in their previous home. The mother offers the party a single gold coin if they would accompany them to the next village. Rumor has it there are wolves in the area, and they are scared they won’t make it to town before nightfall.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[79,79],"drawn":false},{"_id":"NKwFXFRqv3iUgY7p","flags":{},"type":0,"text":"A traveling minstrel and his lover approach on a donkey. He offers to play you a tune for a coin. He is the worst singer you have ever heard. He takes your coin and carries on down the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[80,80],"drawn":false},{"_id":"yLHC7qnHwaxdG0vh","flags":{},"type":0,"text":"A large magic stone hut. The hut is immune to all magic as well as edged weapons. Inside is the home of a helpful powerful Wizard with many magic items and potions. He has made a shop which he sells him magic for slightly lower prices that the Handbook’s. He will buy any rare magic for 110% of its actual cost. He buys magic at 90% of its actual cost. Lots of people seem to come by in the day and no one seems to be there at night. This is because he talks in his sleep. On any given day, there is a 1/3 chance that he will use d4 spells in his sleep.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[81,81],"drawn":false},{"_id":"qDPz4rBAlGEVHsJ0","flags":{},"type":0,"text":"Two famous swordsmen, having a duel. One may or may not have cheated in the past and may or may not be planning to cheat in the future. Their followers are attempting to either stop the fight and seeking help or are discussing terms and seeking a neutral arbitrator.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[82,82],"drawn":false},{"_id":"XSVJ7qngsOuzfVeI","flags":{},"type":0,"text":"A single, lonely shoe with a busted heel. The shoe is animated, and has a personality, always complaining that ‘My dogs are tired!’. It may or may not be a wizard pulling a trick on you via enchantment.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[83,83],"drawn":false},{"_id":"C4IMwj7TBymjr5M5","flags":{},"type":0,"text":"A traveling artist has set up a canvas in a nearby field and is painting some wildflowers. For 5 copper pieces, he will make a charcoal drawing on paper for you or any of your party members. For 5 gold pieces, he will stop his flower painting and spend time following the party painting a portrait of one of you until he is finished. If prompted about his work, he will get excited and show you his sketchbook. It’s full of various drawings and portraits of people he’s passed on the road. He says he never forgets a face and will even draw someone according to details given by you for 10 copper pieces. He’s surprisingly accurate even if you aren’t the best at describing things.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[84,84],"drawn":false},{"_id":"X9oGZxPTRaZzBIyX","flags":{},"type":0,"text":"A portly drunken satyr mostly preoccupied with finding out where the next party is.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[85,85],"drawn":false},{"_id":"P6Vtdvp8KSElnYbe","flags":{},"type":0,"text":"A pompous fool of an elf who has spent over 400 years mastering the call of a species of wolf which has since gone extinct in the area. Will demonstrate the howl with almost no provocation and expects you to be impressed.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[86,86],"drawn":false},{"_id":"X5NJz7PS1MEOjl7O","flags":{},"type":0,"text":"A portly old goliath in a red coat with white trim dragging a big bag full of presents","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[87,87],"drawn":false},{"_id":"AzN3XV6XicFXGcay","flags":{},"type":0,"text":"Horned devil with a box in his hands. Offers to allow you to take a look inside in exchange for your soul.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[88,88],"drawn":false},{"_id":"IbEeKbzas9xiOb2S","flags":{},"type":0,"text":"A grizzled paladin with a great sword and a floating shield in a desperate fight with two invisible stalkers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[89,89],"drawn":false},{"_id":"wNKRz8yYGbr7itng","flags":{},"type":0,"text":"Firbolg sleeping, held in the trunk of his pet elephant who dutifully trundles down the road, stepping politely aside to allow for traffic.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[90,90],"drawn":false},{"_id":"7oRQsvk3ODouPaeE","flags":{},"type":0,"text":"Three hill giants who have been assigned to sack a nearby civilization. They’re lost and want directions from the party.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[91,91],"drawn":false},{"_id":"tzZ1vYWg7025yWeU","flags":{},"type":0,"text":"A hermit, proudly extending his arms towards bypassers, holding a single old sock with a hole on the heel. Loudly exclaiming ‘Look at my sock! Isn’t it wonderful?! This sock has been in my family for generations and never once been wet! It’s not magical nor special, but it is, simply put, the best sock ever made!’","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[92,92],"drawn":false},{"_id":"PNl0JWDbt9UkDHpV","flags":{},"type":0,"text":"A glum-looking demon lord pulling a wheelbarrow in which is lying a very drunk, very happy dwarf loudly singing ’86 bottles of beer on the wall!’ If interrupted, the cleric burps loudly, frowns and then shrugs, starting again at ‘1 billion beetles of butt in the well’ before giggling and falling asleep. At this the demon lord sits down and begins weeping.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[93,93],"drawn":false},{"_id":"zOZCDQIV6C3ey8I8","flags":{},"type":0,"text":"An old man and his four mute sons, all dressed in rags, one carrying a large walking stick. In truth, the old man is the head of a giant mage, and his ‘sons’ are his limbs, polymorphed into a group of humans. The old man will ask for a share of the party’s rations, and his sons will eat and eat until no food is left.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[94,94],"drawn":false},{"_id":"Jy6aVk9bhDg6rUIV","flags":{},"type":0,"text":"An oddly smelling gnome with various magic items hidden under his cloak such as a small pocket watch that turns you invisible for six seconds, a hand with candles on its fingertips that when lit paralyze every creature with 14 or more charisma in a 100ft radius, and a blank booklet that does nothing but looks extremely important to all creatures who see it.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[95,95],"drawn":false},{"_id":"AY2mP8WFXvzqgG81","flags":{},"type":0,"text":"Angmar Bladewalker – human knight – Brown hair and blue eyes, she proudly wears a scar across one side of her face. She is always a bit late, a bit eccentric, and has an otuyagh in the stables that she raises as a pet. Deft with a blade though. She moved out of her house because it was haunted.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[96,96],"drawn":false},{"_id":"C4OLjyGZGB9X2XM7","flags":{},"type":0,"text":"Zane Drake – High Elf poet – He has very long, curled, brown hair shaved on the left side and brown eyes, with rough golden skin. He has a soft, typical face with a short moustache. He speaks loudly and dramatically at all times. In addition, he knows the true name of an angel.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[97,97],"drawn":false},{"_id":"N23qKG1kv132C3At","flags":{},"type":0,"text":"Ayleth Falavaul – Half-Elf merchant – She has long, curled, dyed black hair and green eyes. She speaks quietly at all times and is deeply religious. Her homeland was destroyed by a storm.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[98,98],"drawn":false},{"_id":"TIDuGvLC3ykoZyYc","flags":{},"type":0,"text":"Doran Thunderdelver – Dwarf noble – Endlessly impatient, Doran is always shouting about something or other. He has short blond hair and a long beard, which his wife braids every morning. An old friend wants revenge on him.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[99,99],"drawn":false},{"_id":"9bp9Tru3CkL1LVYl","flags":{},"type":0,"text":"Porath – Dragonborn wizard – Suspicious and prone to growling, he cares deeply about the local townsfolk. A man named Kavarr stole one of his spell books.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[100,100],"drawn":false},{"_id":"N7Q1OZag5xIwDFhr","flags":{},"type":0,"text":"A man with seven wives. With an alarming number of cats.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[101,101],"drawn":false},{"_id":"u3tYD9r919PvPiba","flags":{},"type":0,"text":"A traveling priest making their holy pilgrimage.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[102,102],"drawn":false},{"_id":"2AfFU9kjhz3me5NN","flags":{},"type":0,"text":"A completely naked bard who had taken an involuntary vow of poverty, trudging down the road. Recruiting him as a follower and he might give inspirational speeches before combat. /u/kandoras","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[103,103],"drawn":false},{"_id":"m4Oh9w9TrZooIsWA","flags":{},"type":0,"text":"A broken-down cart with a young farmer and his family.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[104,104],"drawn":false},{"_id":"VBiFOLOVMLSyKoi1","flags":{},"type":0,"text":"A prisoner cart transporting a man that claims he has been framed by the local lord.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[105,105],"drawn":false},{"_id":"wknRRDa2sRVFJpJq","flags":{},"type":0,"text":"An orc with a pack full of perfectly leather bound books. /u/snarkyjohnny","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[106,106],"drawn":false},{"_id":"1c9a5aoBVsrMgIFt","flags":{},"type":0,"text":"A halfling driving a cart full of oddly sized weaponry. /u/snarkyjohnny","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[107,107],"drawn":false},{"_id":"IrJ8cUMxZOkxCSMZ","flags":{},"type":0,"text":"A man riding a donkey carrying a lance, a tattered battle standard, and a map that is very faded. /u/snarkyjohnny","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[108,108],"drawn":false},{"_id":"5ldelmusT8UGi7eD","flags":{},"type":0,"text":"A dwarf monk that constantly chants all day long. /u/snarkyjohnny","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[109,109],"drawn":false},{"_id":"iQsteSKDo0xQVcv9","flags":{},"type":0,"text":"A human woman that is wearing very tight clothing but makes the sound of coins clinking together as she takes each step. /u/snarkyjohnny","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[110,110],"drawn":false},{"_id":"Y1KPYjimpyyPGI7X","flags":{},"type":0,"text":"A farm boy who found a rusty sword and is off to seek his fortune. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[111,111],"drawn":false},{"_id":"qTHZnE9PGqRlN65T","flags":{},"type":0,"text":"An old crone who reads palms. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[112,112],"drawn":false},{"_id":"kkl0qm2hKxAv3cne","flags":{},"type":0,"text":"A bald child dressed as a monk. He claims to be 100 years old. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[113,113],"drawn":false},{"_id":"Kqt60sVDscsP8xrq","flags":{},"type":0,"text":"A man dressed in mismatched armor. His weapons are in disrepair. He claims to be a soldier-for-hire. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[114,114],"drawn":false},{"_id":"GxS7Jvv4Px85aOM9","flags":{},"type":0,"text":"A gaudily dressed bard with an ornate flute. He says he specializes in pest removal. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[115,115],"drawn":false},{"_id":"QuhFgzdr4jNloIUX","flags":{},"type":0,"text":"A harlequin who was recently dismissed from royal service and is looking for new employment. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[116,116],"drawn":false},{"_id":"C1xypQWI0SDK4cIC","flags":{},"type":0,"text":"A simpleminded youth taking a cow into town to sell. He’s willing to sell it to you for the right price. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[117,117],"drawn":false},{"_id":"ynNS4e6tRYUaOmoR","flags":{},"type":0,"text":"A shepherdess headed to the local village followed by a lamb. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[118,118],"drawn":false},{"_id":"o91MdXqzc1ip3tkH","flags":{},"type":0,"text":"A war forged woodcutter looking for a heart. /u/eugeneharlot","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[119,119],"drawn":false},{"_id":"KAjEs0GCiDjStCUj","flags":{},"type":0,"text":"A shady tiefling merchant selling questionable exotic pets from their wagon. /u/Actual_Wasps","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[120,120],"drawn":false},{"_id":"voZUzNtbVSVeHNGk","flags":{},"type":0,"text":"An escaped prisoner offering a sizeable gemstone to anyone who can break the chains binding them. /u/Actual_Wasps","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[121,121],"drawn":false},{"_id":"QqIngKo1VitrPv3n","flags":{},"type":0,"text":"A non combatant Goblin Rogue/Assassin and Orc Barbarian/Fighter who talk about how cool it would be to experiment with different moves in battle. They pay no attention to your party, until you’re in battle and the last enemy left gets killed instantly by a flying Goblin that was tossed by an Orc who tossed him into battle. /u/pianokupo","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[122,122],"drawn":false},{"_id":"ZQHJc4GjFbleInvw","flags":{},"type":0,"text":"A man with a heavily overloaded wagon, since he makes his living going from town to town buying and selling antiques. /u/liminallyinsane","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[123,123],"drawn":false},{"_id":"jWSWHc3clBXuhN44","flags":{},"type":0,"text":"A young woman running away from home, escaping an arranged marriage. /u/liminallyinsane","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[124,124],"drawn":false},{"_id":"ai1Sj2MWAiyW9sjm","flags":{},"type":0,"text":"An entire caravan of people who lost their village, looking for a new place to settle. /u/liminallyinsane","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[125,125],"drawn":false},{"_id":"CDMQgN8Hi357CwR6","flags":{},"type":0,"text":"A vampire trapped in the shadow of a flagpole on a sunny day. He’s been there for hours moving slowly inches at a time to avoid the sunlight. /u/Begeara","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[126,126],"drawn":false},{"_id":"p0cIDtH9ea6U0qDG","flags":{},"type":0,"text":"A forest dweller in a heated verbal fight with his bearded dragon /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[127,127],"drawn":false},{"_id":"H4Coc4EfxsOnRsfw","flags":{},"type":0,"text":"A young, mute girl who holds eye contact for long periods of time in the most unflattering way /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[128,128],"drawn":false},{"_id":"SYWhL95u2R3kaIYC","flags":{},"type":0,"text":"A poor artist trying to scratch someone’s (anyone’s) face into the dirt path with a stick /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[129,129],"drawn":false},{"_id":"PGvk6mXTiXw7b8Yq","flags":{},"type":0,"text":"A shepherd with exactly two sheep /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[130,130],"drawn":false},{"_id":"hIctBguoJiQScTww","flags":{},"type":0,"text":"A (very) sunburnt barbarian who is hell-bent on beating his most worthy opponent: the sun /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[131,131],"drawn":false},{"_id":"iRLZQMMCgEVVZHfk","flags":{},"type":0,"text":"Two young kids armed wooden swords offering escort with their utmost sincerity /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[132,132],"drawn":false},{"_id":"Pyc4Ya61eu4lDeaF","flags":{},"type":0,"text":"A man who is sprinting for his life, passing the adventurers in the same direction each time (as if lapping) /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[133,133],"drawn":false},{"_id":"yH8mPgnQwEjvfYqX","flags":{},"type":0,"text":"A fisherman wearing only his days catch /u/Z1rbster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[134,134],"drawn":false},{"_id":"Y3nepTDtXUpQoWFz","flags":{},"type":0,"text":"A travelling mask salesman, whose favorite mask was stolen /u/sdrawkcabjono","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[135,135],"drawn":false},{"_id":"O2cXjm5QIXM9WyhO","flags":{},"type":0,"text":"Two to three kobolds in a robe trying to pass off as a regular traveler. /u/supersnes1","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[136,136],"drawn":false},{"_id":"mVUTgr3hNivGBkaR","flags":{},"type":0,"text":"A young man marching excitedly up the road with a large pig at his side. He claims the pig can talk and will make him a fortune in town. He attempts to demonstrate the pig's talents for the players but it just oinks and snorts. The young man reacts as if it were reciting Shakespeare /u/MindseyeMillionaire","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[137,137],"drawn":false},{"_id":"mqDmpz1f6sHyazte","flags":{},"type":0,"text":"A blind old legless, tongueless beggar on the side of the road. If the party stopped to give him alms that night they have a dream of the man in his prime performing heroic deeds. When they awaken a pile of gold sits on a velvet pillow next to them (1d4+1 x The Amount of Alms they donated) and they gain the affects of a bless spell or 1 inspiration die /u/MindseyeMillionaire","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[138,138],"drawn":false},{"_id":"tlRD9DjUXEG9ejQt","flags":{},"type":0,"text":"A disembodied head with eyes sewn shut floats down the road moaning, licking its lips. It completely ignores the party...unless they offer it food, in which case it follows them around for 1d4 hours per meal given /u/MindseyeMillionaire","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[139,139],"drawn":false},{"_id":"zTRcQ9q7IgMp5iDM","flags":{},"type":0,"text":"A man in armor, whose helmet is a barber’s wash basin, is trying to do battle with a windmill, because he’s convinced that it’s a giant. /u/MyEvilTwin47","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[140,140],"drawn":false},{"_id":"Tv8xhe42pMcMHXzt","flags":{},"type":0,"text":"A band of robbers, posing as traveling actors, including several teenage boys in drag, as it’s customary for female roles to be played by boys whose voice hasn’t changed yet. /u/MyEvilTwin47","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[141,141],"drawn":false},{"_id":"NBJ1ABrenU7BXNA3","flags":{},"type":0,"text":"42.A wizards apprentice wrangling an animated grandfather clock with a lasso. /u/Hatefulpastadish","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[142,142],"drawn":false},{"_id":"GxaYtCsgFqA9dShI","flags":{},"type":0,"text":"43. A telepathic pineapple being carried on a plinth by 4 eunuchs /u/RijkardVN","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[143,143],"drawn":false},{"_id":"lRTNH51GD9wM84QD","flags":{},"type":0,"text":"44. A pair of Lizardfolk rangers off to the annual Bullywug hunt /u/RijkardVN","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[144,144],"drawn":false},{"_id":"GKupvzGOcm9umsOn","flags":{},"type":0,"text":"45. Mad alcoholic male priest of fertility who sprinkled completely random stories and innuendos with prophecies about the parties future /u/RijkardVN","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[145,145],"drawn":false},{"_id":"g5lk6iOpPyOgMxZT","flags":{},"type":0,"text":"46. A local arm wrestling champion looking for opponents /u/RijkardVN","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[146,146],"drawn":false},{"_id":"C0tGzBtqjfGTkUzj","flags":{},"type":0,"text":"47.A halfling who has trained his rats to perform an act. While you are distracted by the act, the other rats will come and pickpocket you. /u/BeboTheMaster","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[147,147],"drawn":false},{"_id":"RN7wssgYrQMBTWOZ","flags":{},"type":0,"text":"48.An old guy in a trench coat, carrying a goose. \"She done hurt her leg.\" /u/felagund","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[148,148],"drawn":false},{"_id":"N9AqQDBk0fEgyswY","flags":{},"type":0,"text":"49. A merman bard carried in a palanquin of sea water. He/She is on a journey to discover the songs of the 'landfolk'. /u/MrLeopoldBl00m","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[149,149],"drawn":false},{"_id":"X6pzybvCFkcpv2xD","flags":{},"type":0,"text":"50. A reprimanded youth trying to trade some beans for a cow. He swears they're magic and his mum won't listen. /u/MrLeopoldBl00m","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[150,150],"drawn":false},{"_id":"7TbuLYM4lepei7bb","flags":{},"type":0,"text":"51. A flute player who specialises in leading vermin out of villages. He is looking for work. /u/MrLeopoldBl00m","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[151,151],"drawn":false},{"_id":"JUuLRQbcBHclqzr0","flags":{},"type":0,"text":"52. a tabaxi named Q’iam, who always refers to himself in the third person. He doesn’t do anything but always speaks in riddles \"Q’iam’s father was also called Q’iam. As was Q’iam’s father's father. At least, that's what his father said.\"","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[152,152],"drawn":false},{"_id":"OHMaMxGQ8WUX5fo6","flags":{},"type":0,"text":"What does this mean, to combine magic? Magic plus magic is still magic. /u/jappocon","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[153,153],"drawn":false},{"_id":"7SoFnvc3v2P8nGkK","flags":{},"type":0,"text":"53. a tall man with two heads that are arguing with one another... no wait he just has a legless friend strapped to his back. The arguments revolve entirely over who ate the other’s cheese wheel /u/jappocon","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[154,154],"drawn":false},{"_id":"PGrptR0koHeGv1s6","flags":{},"type":0,"text":"54. an aloof elf woman sitting on a treestump juggling various mismatched shoes /u/jappocon","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[155,155],"drawn":false},{"_id":"OqTwwkieGHwdksV0","flags":{},"type":0,"text":"55. a yellowtoothed dwarf riding backwards on a horse that walks backwards. He acts like it’s totally normal for this breed of thoroughbred Ayrshire pony. /u/jappocon","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[156,156],"drawn":false},{"_id":"zqpsSZRf7gLuk61k","flags":{},"type":0,"text":"56. just a lone barrel rolling alongside the road. Inside is a gnome who has rigged it to be a mobile home for him. It’s bigger on the inside by a small amount, enough for him to sit and have room to operate out of a tiny tiny home. /u/jappocon","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[157,157],"drawn":false},{"_id":"2oASOPgOyOYsTQtu","flags":{},"type":0,"text":"57. The abbot of a local monastery, accompanied by a friar and two guards. He is on the way to visit a local lord to discuss tithing disagreements. He presents himself as learned and benevolent but is secretly only interested in finding a new companion for his bed each night. /u/guilersk","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[158,158],"drawn":false},{"_id":"OX1tOt7crbIqOIz8","flags":{},"type":0,"text":"58. A young incubus boy, chasing after some young girls. /u/EnderFlame01","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[159,159],"drawn":false},{"_id":"sdOv9PX17IVxC0aP","flags":{},"type":0,"text":"59. An ettin having a protracted argument with itself. It isn't hostile, though the heads will rope other travelers into the argument, each head trying to sway them to its own side. /u/Flutterwander","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[160,160],"drawn":false},{"_id":"Suthv2po7TF76hM7","flags":{},"type":0,"text":"60. A troupe of performing goblins, playing instruments and practicing their routines as the cart clatters on up the road. /u/Flutterwander","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[161,161],"drawn":false},{"_id":"Qdbli9xEP5KjKFad","flags":{},"type":0,"text":"61.A 16-year old human girl walking around with a sword that turns into a crossbow. /u/PresentPossible","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[162,162],"drawn":false},{"_id":"CoUVTPwTIzvRrPPC","flags":{},"type":0,"text":"A bard or minstrel, half dressed and looking over his shoulder.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[163,163],"drawn":false},{"_id":"gpocOQTi23X6WPuW","flags":{},"type":0,"text":"Farmer going to/returning from market with his meager goods.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[164,164],"drawn":false},{"_id":"EpFDXgrweAPI9jat","flags":{},"type":0,"text":"Farmer going to/returning from town with his/her sons.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[165,165],"drawn":false},{"_id":"oUSxUhtPn1ik5lq9","flags":{},"type":0,"text":"Farmer going to/returning from town with his/her daughters.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[166,166],"drawn":false},{"_id":"vpvB5s0yylTM0YQy","flags":{},"type":0,"text":"Girl running away from home.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[167,167],"drawn":false},{"_id":"rQLrlIbpgoxhtszv","flags":{},"type":0,"text":"Boy running away to the city.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[168,168],"drawn":false},{"_id":"0V4dOSwT2dooYN7R","flags":{},"type":0,"text":"A lost child, in tears and holding a torn sack.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[169,169],"drawn":false},{"_id":"FOCdqW6FYQ1YZzlS","flags":{},"type":0,"text":"A troupe of entertainers, led by an overdressed and curious Elf.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[170,170],"drawn":false},{"_id":"CCDb7S4Y5pDkSh4h","flags":{},"type":0,"text":"Full company of mercenaries, led by a stout, dark bearded Captain.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[171,171],"drawn":false},{"_id":"jwrkddCmp2e9PgTv","flags":{},"type":0,"text":"A small group of mercenaries, dishevelled and sweating.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[172,172],"drawn":false},{"_id":"0XnoqHYbu8lRORiu","flags":{},"type":0,"text":"Minor noble travelling via horse, with servants.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[173,173],"drawn":false},{"_id":"NuO3TjsFhfwgQU3c","flags":{},"type":0,"text":"Minor noble going to/returning from hunt, with retinue.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[174,174],"drawn":false},{"_id":"gArEEvQyzG4vjFfD","flags":{},"type":0,"text":"Local bailiff, sheriff or warden, with a suspicious outlook of strangers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[175,175],"drawn":false},{"_id":"SckFkuJ1YfSsrCeY","flags":{},"type":0,"text":"A hunter or poacher, with a huge longbow strapped to their back.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[176,176],"drawn":false},{"_id":"9H7cUNUBenr71TV5","flags":{},"type":0,"text":"A pair of hunters or poachers, arguing about who is to blame for a missed shot.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[177,177],"drawn":false},{"_id":"MEL47CriOk5aJ6FC","flags":{},"type":0,"text":"Large trading caravan, with accompanying surly guards.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[178,178],"drawn":false},{"_id":"TOSTbBUf63VJc2iO","flags":{},"type":0,"text":"A lone trader/merchant on foot, leading a mule carrying their wares.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[179,179],"drawn":false},{"_id":"B45aDUv2NGkUwrrS","flags":{},"type":0,"text":"Lone trader/merchant riding on a horse drawn wagon.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[180,180],"drawn":false},{"_id":"03GuGoUt6auFkIYB","flags":{},"type":0,"text":"Limping bailiff and his badly beaten prisoner.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[181,181],"drawn":false},{"_id":"NHRQQVvYg1qOhuEI","flags":{},"type":0,"text":"Escaped prisoner, manacled and carrying a religious icon.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[182,182],"drawn":false},{"_id":"IoDkq1qJE4pUVagz","flags":{},"type":0,"text":"Sheriff and his dogs, out hunting an outlaw.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[183,183],"drawn":false},{"_id":"0bZ8vSRsUvarras6","flags":{},"type":0,"text":"A boundary warden with a broken bow and empty scabbard, fuming as he walks.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[184,184],"drawn":false},{"_id":"BvyxtmztEjsB8uIb","flags":{},"type":0,"text":"Lone travelling priest, carrying a lit censer with an acrid smell.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[185,185],"drawn":false},{"_id":"qZ4ZQegWXyANuU1C","flags":{},"type":0,"text":"Lone travelling cleric, with a faintly glowing mace.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[186,186],"drawn":false},{"_id":"IPdRdpg2aKjDmR1f","flags":{},"type":0,"text":"Charismatic priest and retinue of apostles, who are mumbling to each other and won’t make eye contact.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[187,187],"drawn":false},{"_id":"VFCAsXK2lnACQtzk","flags":{},"type":0,"text":"A cleric and a small retinue of acolytes, full of confidence.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[188,188],"drawn":false},{"_id":"HMt3nnje6RQXUexp","flags":{},"type":0,"text":"A ranger/boundary warder patrol, with a cheerful leader.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[189,189],"drawn":false},{"_id":"gOUPS5l2GX7ZaUjG","flags":{},"type":0,"text":"A patrol from the local city or town guard, nervous about being out of town.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[190,190],"drawn":false},{"_id":"c4aP8OaIgDdIb2u9","flags":{},"type":0,"text":"A foot messenger, with a ducal ring on his hand.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[191,191],"drawn":false},{"_id":"smE3uw0gOyQf6Zne","flags":{},"type":0,"text":"A horse messenger wearing a royal tabard and carrying a fine leather satchel.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[192,192],"drawn":false},{"_id":"7z2IvScYs14N6kDY","flags":{},"type":0,"text":"A travelling historian carrying a sack of old stone statues.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[193,193],"drawn":false},{"_id":"U4pkQrG22FlvDImb","flags":{},"type":0,"text":"A starving beggar, willing to trade information for food.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[194,194],"drawn":false},{"_id":"1Udj5BVJlHz2UZV5","flags":{},"type":0,"text":"A group of refugees, telling stories of war and oppression in their homeland.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[195,195],"drawn":true},{"_id":"8XovljjWX9VcbXYq","flags":{},"type":0,"text":"A wounded soldier, limping along on crutches.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[196,196],"drawn":false},{"_id":"dmvL5HPO6jRsPcnr","flags":{},"type":0,"text":"A deserting soldier carrying a memento of a fallen friend.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[197,197],"drawn":false},{"_id":"9ktOgnEo2lHaxidZ","flags":{},"type":0,"text":"A wandering dog, with a silver collar and name tag.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[198,198],"drawn":false},{"_id":"7PXWd4d7zfRsk7wD","flags":{},"type":0,"text":"A bear wearing a collar and trailing a frayed rope.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[199,199],"drawn":false},{"_id":"7hUDzEuMVqC7m5WJ","flags":{},"type":0,"text":"A riderless horse, with bulging saddlebags.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[200,200],"drawn":false},{"_id":"8Nt01usBW025QPNd","flags":{},"type":0,"text":"A thrown rider, trying to catch his horse.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[201,201],"drawn":false},{"_id":"XOmwYXZhE0ggw3zU","flags":{},"type":0,"text":"A wandering madman, ranting about an invisible creature.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[202,202],"drawn":false},{"_id":"HNNYmAjftHFn5ai5","flags":{},"type":0,"text":"A pair of dwarven prospectors, arguing loudly about where they took a wrong turn.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[203,203],"drawn":false},{"_id":"ANtfHC6XGnF8sYsp","flags":{},"type":0,"text":"Halfling cook/chef, out foraging for ingredients.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[204,204],"drawn":false},{"_id":"Q6p56QfPfuYkJr8y","flags":{},"type":0,"text":"Overturned wagon with injured merchant.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[205,205],"drawn":false},{"_id":"G3zakjidPxZJ6tMs","flags":{},"type":0,"text":"A bored elderly gnome, with a curious mechanical toy.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[206,206],"drawn":false},{"_id":"Z514FihRmk8dCPGn","flags":{},"type":0,"text":"Fisherman by a riverside, without any fish.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[207,207],"drawn":false},{"_id":"2mObOWtfGErbz0MO","flags":{},"type":0,"text":"Druid planting rows of trees across the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[208,208],"drawn":false},{"_id":"aFg8OZLUY1fSJiyJ","flags":{},"type":0,"text":"A drunk from a nearby tavern, unsteady on his feet.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[209,209],"drawn":false},{"_id":"5jnWJRERCav6BkjY","flags":{},"type":0,"text":"A partially smashed coffin, with a “corpse” inside which is slowly moving.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[210,210],"drawn":false},{"_id":"KS9K1bwZXl2ZATuW","flags":{},"type":0,"text":"A dealer of “used magical artefacts”.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[211,211],"drawn":false},{"_id":"JbYOm5qcTW6EzKua","flags":{},"type":0,"text":"An elf picking and eating wild berries.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[212,212],"drawn":false},{"_id":"jSFNY4KAgiHgEaaw","flags":{},"type":0,"text":"A manic Herbalist, with green smears around his mouth.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[213,213],"drawn":false},{"_id":"MKwBJDH6Ddl4jpEt","flags":{},"type":0,"text":"Group of robed monks, carrying a lit censer.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[214,214],"drawn":false},{"_id":"1kGknjlwp5gNm6fJ","flags":{},"type":0,"text":"A squire chasing his drunken master’s horse.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[215,215],"drawn":false},{"_id":"Ba08Et284Inr7Vuf","flags":{},"type":0,"text":"An armoured Dragonborn sitting on a stone, sharpening a sword and sighing.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[216,216],"drawn":false},{"_id":"Fe58WVt2gL6ROV4o","flags":{},"type":0,"text":"Farmer with an unmoving mule, laden with fruit.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[217,217],"drawn":false},{"_id":"P08HZNokYDtkCqIN","flags":{},"type":0,"text":"Guarded and chained prisoners digging a ditch.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[218,218],"drawn":false},{"_id":"dzhGRooYhYzOyLq5","flags":{},"type":0,"text":"A pair of wagon drivers preparing to race each other.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[219,219],"drawn":false},{"_id":"kqAdM6NTAtfuvXnw","flags":{},"type":0,"text":"A tiny Earth Elemental, shifting pebbles from one side of the road to the other.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[220,220],"drawn":false},{"_id":"7JMmEAkq6mu7Ja3K","flags":{},"type":0,"text":"A group of dancing lights, which keep just ahead of the party.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[221,221],"drawn":false},{"_id":"HGaQYcEyrCKrfCmL","flags":{},"type":0,"text":"A drug addict, coming down from their last score.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[222,222],"drawn":false},{"_id":"Y86vrywzpqcSkuoY","flags":{},"type":0,"text":"A harmless ghost, sadly humming an old song.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[223,223],"drawn":false},{"_id":"CZZp0JA84FMPui79","flags":{},"type":0,"text":"A gnome riding an armoured mastiff.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[224,224],"drawn":false},{"_id":"K4fnPFUMK0K5dXJ7","flags":{},"type":0,"text":"A hawker trying to find his bird.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[225,225],"drawn":false},{"_id":"Cf0RERSmRDg47081","flags":{},"type":0,"text":"A grave robber, with mud on his shoes and a dark, wet sack on his back.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[226,226],"drawn":false},{"_id":"ZodT21GqudwPrpmW","flags":{},"type":0,"text":"A friendly necromancer with several raised skeletons, who offers to share food.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[227,227],"drawn":false},{"_id":"vE24P6wlsW7VZQwn","flags":{},"type":0,"text":"A gang of youths from a nearby town.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[228,228],"drawn":false},{"_id":"Qzb6pkM1yWGPR3Ha","flags":{},"type":0,"text":"A gnomish tinker &amp; merchant, offering magical mending.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[229,229],"drawn":false},{"_id":"N7W1YatqKbotGYnJ","flags":{},"type":0,"text":"A Quickling, fleeing from the service of a warlock.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[230,230],"drawn":false},{"_id":"5JSZDdIUUG1bMp6B","flags":{},"type":0,"text":"A drunken Hill Giant, asleep and snoring loudly.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[231,231],"drawn":false},{"_id":"22VRs9zRgWSBDJ5V","flags":{},"type":0,"text":"A starving hermit, bearing a sword handle without a blade.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[232,232],"drawn":false},{"_id":"ZIGnG4ZByPkLUZzE","flags":{},"type":0,"text":"A migrating Treant, walking down the middle of the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[233,233],"drawn":false},{"_id":"Kj9rH0eU9px889Li","flags":{},"type":0,"text":"A dead knight’s retinue, returning the body home.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[234,234],"drawn":false},{"_id":"c2jqNGugoqECpTey","flags":{},"type":0,"text":"Traveling reeve or magistrate, summoned to a case.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[235,235],"drawn":false},{"_id":"yFI3gg7LKlltZqfS","flags":{},"type":0,"text":"A group of pilgrims, one of which is carrying a small, heavily bound chest.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[236,236],"drawn":false},{"_id":"bouGd8YxX25T5c3K","flags":{},"type":0,"text":"A backwoods moonshiner, offering free samples of his wares.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[237,237],"drawn":false},{"_id":"8T6ZQNWqWDrcbA8v","flags":{},"type":0,"text":"A surveyor excited about discovering a door into an artificial hillock.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[238,238],"drawn":false},{"_id":"FlJMRpSpxFAOJ1zB","flags":{},"type":0,"text":"A dripping wet fisherman, climbing up from a riverbank with an angry look.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[239,239],"drawn":false},{"_id":"P8xmjAR6g9ciAf3h","flags":{},"type":0,"text":"A girl picking wildflowers, acting as a lookout for local bandits.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[240,240],"drawn":false},{"_id":"4rXzjH2o6ORAChJ3","flags":{},"type":0,"text":"A boy swinging a stick like a sword, with a pet dog following.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[241,241],"drawn":false},{"_id":"8yXpQqmuQCJGRCYQ","flags":{},"type":0,"text":"Villagers cutting wood to make bows.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[242,242],"drawn":false},{"_id":"kTDoIZNY0Xz5OWZ7","flags":{},"type":0,"text":"A stone golem with one leg shorter than the other, never walking in a straight line.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[243,243],"drawn":false},{"_id":"CT4TK834tPU8AQrO","flags":{},"type":0,"text":"A pixie telling rude jokes and riddles.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[244,244],"drawn":false},{"_id":"ZZJLu0jxIasFhPMN","flags":{},"type":0,"text":"Four villagers burning a pile of corpses, which are emitting a thick purple smoke.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[245,245],"drawn":false},{"_id":"1MTRYpAmgXruN5Zb","flags":{},"type":0,"text":"A wagoner trying to fix his strangely burned cart.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[246,246],"drawn":false},{"_id":"qHaij1BG8T29Z1GQ","flags":{},"type":0,"text":"A contented Halfling, smoking an oddly scented pipe.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[247,247],"drawn":false},{"_id":"0H6of0bIcRv8LTaP","flags":{},"type":0,"text":"A wild-eyed and dishevelled Alchemist, ranting about a breakthrough.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[248,248],"drawn":false},{"_id":"8D08afDkEfYaM7mu","flags":{},"type":0,"text":"An imp caught in a rabbit trap, screeching loudly.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[249,249],"drawn":false},{"_id":"YC9eHpMxM9K3TQ3X","flags":{},"type":0,"text":"A lost wagon guard, with scratches on his face.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[250,250],"drawn":false},{"_id":"gU2ydhFMVH533PRL","flags":{},"type":0,"text":"A seller of genuine, if minor, religious relics.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[251,251],"drawn":false},{"_id":"45LxGzsOpGf4UXBx","flags":{},"type":0,"text":"An old gnome in hat and tattered clothes, rapidly shuffling a deck of cards.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[252,252],"drawn":false},{"_id":"VSL4qqHYrB9ocVl0","flags":{},"type":0,"text":"An ebullient Orc, dressed in bright fine silks.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[253,253],"drawn":false},{"_id":"5SEolO43oJSDNkhq","flags":{},"type":0,"text":"A Green Hag, offering a reward for revenge on those who tricked her.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[254,254],"drawn":false},{"_id":"iuas1Q9uIonVbRmK","flags":{},"type":0,"text":"A wine merchant, asking for directions to the nearby town festival.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[255,255],"drawn":false},{"_id":"3cvOYk2jfVF7Cr44","flags":{},"type":0,"text":"A fur trapper, with a live wolverine as a pet.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[256,256],"drawn":false},{"_id":"vXOmJxkY4wXJnfjA","flags":{},"type":0,"text":"A sour old grandmother, complaining bitterly about her eldest son.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[257,257],"drawn":false},{"_id":"Pdx8qzBB1VYmKqKe","flags":{},"type":0,"text":"A Hobgoblin out to see the world.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[258,258],"drawn":false},{"_id":"jbRFsymOaZ4LPxJc","flags":{},"type":0,"text":"A young man, with a hideous mask magically stuck to his face.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[259,259],"drawn":false},{"_id":"kyACvd5uiN4wGSrC","flags":{},"type":0,"text":"A band of giant hunters, paid to kill a troublesome old Hill Giant.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[260,260],"drawn":false},{"_id":"ewEFf5cNQihaJvOl","flags":{},"type":0,"text":"A charcoal burner, telling stories about haunted trees.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[261,261],"drawn":false},{"_id":"GEAs1sCHWw0amWaB","flags":{},"type":0,"text":"A potion merchant, with a backpack full of ‘alternative’ potions.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[262,262],"drawn":false},{"_id":"x5l3mERwUQsw5qAW","flags":{},"type":0,"text":"While traveling on the road, you come across a massive tree that has fallen in the middle of the road. It will take 1d10 hours to clear. Unbeknownst to the party, a massive ogre is hiding in a nearby cliff waiting for an unsuspecting caravan to wander into his tree trap.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[263,263],"drawn":false},{"_id":"xs6rZYiRuca8Sg2a","flags":{},"type":0,"text":"The main road has been washed out. Crossing the gap would be dangerous and time consuming. There is an alternate route through the woods which are known to harbour a multitude of threats, but it’s faster than dealing with the washout.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[264,264],"drawn":false},{"_id":"TRzqCOHl9jzIlUL3","flags":{},"type":0,"text":"The party comes across a caravan in distress. Bandits have been known to set ambushes like this to catch unsuspecting travelers, but there are also rumours of a merchant caravan that’s late returning from the capitol. What do you do?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[265,265],"drawn":false},{"_id":"DTVFwSywnifHwBzB","flags":{},"type":0,"text":"A lost child wanders the road, heading back the way you came. It’s too late in the day to get back to town before nightfall, and you need to be in the next city over by morning.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[266,266],"drawn":false},{"_id":"mJEOLQe1tVF5OSfU","flags":{},"type":0,"text":"You see a dying man at the side of the road. If you stop, he tells you that [Person]’s guards attacked and robbed him. You are en route to an audience with [Person] to negotiate a lucrative commission, and as far as you know, s/he is a pillar of the community.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[267,267],"drawn":false},{"_id":"b9hI4PTFwhshpoTh","flags":{},"type":0,"text":"A blizzard swirls up, impairing vision and forcing players to make con saves against cold damage.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[268,268],"drawn":false},{"_id":"YAvFa96qrNoKldLk","flags":{},"type":0,"text":"A white stag/any other big game animal crosses the road and bolts. Do the adventurers pass on this trophy that could be worth money for its pelt/antlers/alchemical ingredients or do they go hunting?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[269,269],"drawn":false},{"_id":"XPRAbCfPf2OvFMRg","flags":{},"type":0,"text":"The party happen upon a hoard of coins (usually gold) in the middle of the road. It’s more than they can carry and there’s no obvious way to transport it. A group of level appropriate humanoids are circling around, intent on taking the hoard for themselves.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[270,270],"drawn":false},{"_id":"MOpMnAvxkOIt2ZO3","flags":{},"type":0,"text":"You find the last survivor of a zombie/goblin/werewolf/etc. attack. He/she asks you to bring him back to his guild, which specializes in hunting this kind of monster.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[271,271],"drawn":false},{"_id":"2f0NOrFyQhNArJei","flags":{},"type":0,"text":"You come across the last survivor of a pack of peaceful werewolves who are being hunted by vicious werewolf hunters. He/she asks you to return him to the rest of the clan.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[272,272],"drawn":false},{"_id":"oa2ggtyIE3NeCi6c","flags":{},"type":0,"text":"You stumble into the middle of a fight between bandits and evil wizards fighting over a caravan of potentially valuable supplies. Neither party has seen you yet.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[273,273],"drawn":false},{"_id":"di9OMaCqifZFgP0v","flags":{},"type":0,"text":"A farmer or other commoner is transporting an offering to a fearsome enemy (giant, wizard, orc chieftain, etc.). He/she tells you that the village has managed to remain untouched by offering livestock/goods/gold in exchange for safety.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[274,274],"drawn":false},{"_id":"04lWZVldlycMxtjQ","flags":{},"type":0,"text":"You are approached by a zealous group of cultists. They begin preaching to you that the world is going to about to be destroyed by the god they worship, and ask you if you’d like to join their end-of-the-world party (attending reveals that the world is not, in fact, about to end).","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[275,275],"drawn":false},{"_id":"1WWVZTsAdDOiuf48","flags":{},"type":0,"text":"While passing through an abandoned farm, you come across a scarecrow that psychically whispers to you. It gives the party an “impossible” riddle and claims that if you cannot answer then it will not let you pass. Note: Scarecrow cannot move and players need not answer the riddle in order to simply walk past.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[276,276],"drawn":false},{"_id":"4cma2XmeFnKDIe0f","flags":{},"type":0,"text":"A group of goblins standing on each other’s shoulders in trenchcoats trick travelers into coming to help fix their broken down wagon, and rob them for every copper they’re worth.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[277,277],"drawn":false},{"_id":"N4K9jaUeoOWr5riK","flags":{},"type":0,"text":"The only way to progress is through the aftermath of a battlefield. Many of the traps put in place by mages haven’t been disabled yet, and the party must navigate safely through it.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[278,278],"drawn":false},{"_id":"y3cH4zGI07mENZxp","flags":{},"type":0,"text":"There is an illusory spell over the forest that they are traveling in that causes people to think that the road is taking them in circles. People who pass the save must convince the others that they are going the right way.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[279,279],"drawn":false},{"_id":"ggUsuYgixLKKYSGc","flags":{},"type":0,"text":"There is a caravan of magical meat traders that are going from city to city. However, they only trade meat for meat instead of trading with gold.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[280,280],"drawn":false},{"_id":"iDKTUOGZaUfCdSer","flags":{},"type":0,"text":"There is a tiny earth elemental trying to learn how to juggle. If the party tries to touch it, an angry mother will come out of the woods to attack them.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[281,281],"drawn":false},{"_id":"kxbSZSZJ4Ih7xiYr","flags":{},"type":0,"text":"A group of teenagers were smoking in the woods and accidentally started a forest fire. Unfortunately, the party is in that forest and needs to get out.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[282,282],"drawn":false},{"_id":"SdxJ5znSN4x7dY9h","flags":{},"type":0,"text":"The road comes to a large river. A new, high-quality bridge has been built over the river by a goblin clan who are seeking to overcome evil natures and to make an honest living. They are charging what is, in fact, a high if still fair fee.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[283,283],"drawn":false},{"_id":"CKB4KJwCWehZdwfP","flags":{},"type":0,"text":"The path and map somehow did not mention a mountain that sits right in the middle of the road. The party did not notice the mountain until it was directly upon them.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[284,284],"drawn":false},{"_id":"UJpGUBcDLujgCXh7","flags":{},"type":0,"text":"The village that you come to has just had adventurers a lot like your party come through, and have prepared an appropriate welcome. If your party are heroes, it might be fresh-baked bread. If your party is a bunch of jerk murder-hoboes, it might be tar and feathers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[285,285],"drawn":false},{"_id":"x2EOPAsrAZ8Rf3hH","flags":{},"type":0,"text":"A large group of pigs are running every which way. A young girl in a ragged dress is trying to herd them together, sniffling slightly. If approached, she explains her father and mother are sick, but the pigs are supposed to be sold at the market, and they need the money for medicine.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[286,286],"drawn":false},{"_id":"qsAl4V0dHEDKlKuM","flags":{},"type":0,"text":"A worried-looking half-orc desperately tries to convince your party they are going the wrong way, and that they should take a similar (if slightly longer) trail to their destination. A religion check reveals that he is a cleric of a knowledge deity. If the party ignore him, he tries to convince them for a while, then shakes his head sadly and begins trudging away.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[287,287],"drawn":false},{"_id":"cMJ4PcNQ4G5ZFJjb","flags":{},"type":0,"text":"A small stretch of woods are petrified in place and time, completely silent and perfectly still. Anyone touching anything but the path in the forest finds it hard as stone and completely immovable. There are birds and other animals in the forest, but they too are as still as statues.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[288,288],"drawn":false},{"_id":"NjI1deWq5zZHb9GD","flags":{},"type":0,"text":"A vicious squirrel begins throwing nuts and chattering at the party. It doesn’t do any real damage, but it is painful and annoying.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[289,289],"drawn":false},{"_id":"nvyhQax2ekOrOMtX","flags":{},"type":0,"text":"A nest of baby hydras! Kill ’em, avoid ’em, or (with a successful handle animal check) take one with you! Where’s the mother, anyway?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[290,290],"drawn":false},{"_id":"FywQ4YnW2Es38YAY","flags":{},"type":0,"text":"Someone has left a trail of copper pieces, leading off the road to a cave. The cave is heavily trapped and ends in an empty chest. You hear giggling when the chest opens, but no one is in sight.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[291,291],"drawn":false},{"_id":"KXbCcOKqMVQXtoUN","flags":{},"type":0,"text":"A large group of pilgrims and flagellants are making their way slowly up the road in front of you, slowing you down. They make no attempt to give ground to you and eye you with some vague hostility.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[292,292],"drawn":false},{"_id":"2i37lUWbxx0WBOSC","flags":{},"type":0,"text":"A deep moat has been dug across the path in front of you. Two gnomes on the other side are looking at a map and blueprints and arguing with each other. They make no attempt to help you cross.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[293,293],"drawn":false},{"_id":"1hqracfVzqJW0ljy","flags":{},"type":0,"text":"An 8-year old boy is peacefully leading a giant pit fiend/ Manticore/ Purple Worm on a chain behind him down the road. If asked about it, he laughs and says, “oh, that’s our cow. She just likes to play tricks on strangers.” He then ruffles the- whatever- and continues on his way whistling.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[294,294],"drawn":false},{"_id":"M5hw7sUwAFNR60SN","flags":{},"type":0,"text":"Your map failed to mention a road inn halfway to your destination. The inn is completely empty with the door torn off it’s hinges. With a local knowledge/geography check you know that this inn shouldn’t even be here, this was once the location of a grave site.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[295,295],"drawn":false},{"_id":"XVenZNNqxjfMCdCc","flags":{},"type":0,"text":"An armored retinue of Soldiers and Clerics bearing a King’s/Lord’s/God’s banner have set up an inspection point, requiring all passing through to declare their belongings, allegiances and purpose for passing. Zone of Truth, Detect Evil and Good, and Truesight are in use.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[296,296],"drawn":false},{"_id":"dA1LDt3QkgsPo1Yd","flags":{},"type":0,"text":"You come across 2 NPC’s arguing over which one is real, and which is a hallucination.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[297,297],"drawn":false},{"_id":"sJbYUA1X45kRmKjX","flags":{},"type":0,"text":"You discover a 50ft wide flowing river crossing perpendicular to your path. This same river can’t be found on any maps.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[298,298],"drawn":false},{"_id":"TrrIXdafMcx5Islq","flags":{},"type":0,"text":"A great human knight has just died of a heart attack as he travelled down the road. His squire and page have pulled him to the side, and one has gone to fetch help. The knight has powerful magical armor and weaponry which would fetch a pretty penny, and there are robbers about…","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[299,299],"drawn":false},{"_id":"ivBBOds91YYiewKp","flags":{},"type":0,"text":"The road is completely blocked off as if an avalanche or rock slide occurred. Problem is the area is pretty flat and you don’t understand how the rocks got here.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[300,300],"drawn":false},{"_id":"EinOH1FppzeSCeSM","flags":{},"type":0,"text":"A group of animals have been killed and aligned in a strange formation with weird symbols drawn in blood. Party could find out this was used for a ritual of sorts.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[301,301],"drawn":false},{"_id":"X7mnlGpLq4mTs1zo","flags":{},"type":0,"text":"You turn a corner and the road ahead is blocked by a pool of lava. Upon inspection, there is no heat. Futher inspection will reveal it is a illusion spell. Perhaps a silly prank by a wizard. You can walk through the lava.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[302,302],"drawn":false},{"_id":"GJjI0mIvEVXduS59","flags":{},"type":0,"text":"As you make your way along the road, you come across a rotting dead animal carcass. The smell is horrid, but it is nothing out of the ordinary. As you continue, a few more animal carcasses are strewn across the road. More and more bodies begin to appear along the road the further you go. You eventually come face to face with a 20ft wall stacked full of bodies ranging from livestock, predatory animals, and even people. The wall blocks the road, and the only ways to proceed include scaling a nearby muddied-with-blood slope, backtracking to find another route, or digging through.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[303,303],"drawn":false},{"_id":"POcs0M1E2uXazy1o","flags":{},"type":0,"text":"The travelers find themselves at a crossroads, then the same going forward, and again. The party is trapped in a magical loop, until they can dispel it or notice the difference in the pattern, such as flower locations or a bird’s flight path.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[304,304],"drawn":false},{"_id":"bv3lJK00vZufZmD5","flags":{},"type":0,"text":"You were sold bad travelling gear at your last stop – the rations are worthless, the water tainted, the leather goods falling apart.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[305,305],"drawn":false},{"_id":"oSANsfTBXSWxNRwq","flags":{},"type":0,"text":"Flash Flood: A downpour upstream has triggered a flash flood over a low part of the road. Although the water is 3 feet deep, the current is so swift that it will without fail sweep away anyone trying to ford it. Individuals swept away face the risks of bludgeoning, impalement on debris, and drowning. By stepping in it at the shallower edge, it is obvious to even survival novices that it will be extremely dangerous to cross, especially towards the middle. The party can choose to wait it out if they like although it will take a long while.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[306,306],"drawn":false},{"_id":"37CJ87AWayCXjnHT","flags":{},"type":0,"text":"Stampede: A large herd of bison/gnus has been spooked and is wildly stampeding down the road as it is the path of least resistance. Get out of the way or be trampled.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[307,307],"drawn":false},{"_id":"qOyzW57Ge4axz90X","flags":{},"type":0,"text":"Landslide: Heavy rain and a small earthquake triggers a series of small 30-foot-wide landslides. The party needs to book it before a larger one hits.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[308,308],"drawn":false},{"_id":"fWUhqFxAyv76jns0","flags":{},"type":0,"text":"Help with wheel repair: A traveling caravan of nomadic folk has a broken wagon wheel. The lady in charge is a seer and offers insight on your fortunes, but no gold, if you stop and help.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[309,309],"drawn":false},{"_id":"JSNTef73aHSdVNHe","flags":{},"type":0,"text":"Bad signs: A jerk has rearranged the roadsigns at an intersection so they point to the wrong places.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[310,310],"drawn":false},{"_id":"9k8ciI5rlcMrV5Tt","flags":{},"type":0,"text":"Pulled over by the highway patrol: A peacekeeping army-guard convoy is marching through. They are corrupt and will harass and attempt to search the party and may try to take money or goods they find suspicious or the party cannot explain the providence of. They will also apprehend known criminals. The party may get most of their stuff returned by “appealing” (aka paying a bribe) to a similarly corrupt local court.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[311,311],"drawn":false},{"_id":"OKHydNSOjtPDlGsl","flags":{},"type":0,"text":"The Wyld Hunt – The fey are out hunting. Beware. They have already chosen a quarry, but don’t stick around, lest one of them choose you as their next.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[312,312],"drawn":false},{"_id":"XEAKjPbI2tMfWOV8","flags":{},"type":0,"text":"After walking for a good few miles along the path down the clear road, you reach an invisible barrier. Then the illusion breaks – this Mirage Arcane made this deep cave look like a clear plains with a nice lovely stone path identical to the one you’ve been following. You are half a mile into this cave, and the fey who have lured you here do NOT want you to leave without doing something for them first.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[313,313],"drawn":false},{"_id":"8rR9VUEDHD4FPL8n","flags":{},"type":0,"text":"Modrons: Along the path you find a group of modrons (2 monodrones and a duodrone). These modrons were not given the return order during the last modron march (due to complications from becoming attacked) and are still trying to collect data. Upon noticing the party they harass them for data, doing things like surveying them and mesuring the size of their clothes while they are walking. They continue to do this until they either lose sight of the party or are destroyed.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[314,314],"drawn":false},{"_id":"oPySIAw8asfKWDB6","flags":{},"type":0,"text":"A fire can be seen just under a mile away in an obviously cultivated field, the wind now blows billows of smoke over the road the party is crossing. The field belongs to a local alchemist who has seeded it with various medicinal herbs. The smoke is highly intoxicating, impressing odd conditions and visions upon the party members.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[315,315],"drawn":false},{"_id":"0alC2URFaOwtcbwT","flags":{},"type":0,"text":"Improper care – the terrain has taken an unfortunate toll on your foot ware. Your soles are falling apart, movement reduced by 33%.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[316,316],"drawn":false},{"_id":"qkzKM2eTrDBags99","flags":{},"type":0,"text":"A mounted knight in full tournament jousting gear mistakes the party for his entourage/bodyguard and insists that they escort him to his next competition.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[317,317],"drawn":false},{"_id":"TvNZGa7yaFAtHuIC","flags":{},"type":0,"text":"The party come across a revenant who is nearing his target. The target isn’t any one in the party but the adventurers have a chance to intervene.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[318,318],"drawn":false},{"_id":"o7EwgBJ1AoGmlvNZ","flags":{},"type":0,"text":"Someone in your party has dysentery.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[319,319],"drawn":false},{"_id":"EoAFvmLDZUAXmSaQ","flags":{},"type":0,"text":"Everyone the party asked in the last town/village/waypoint has said the only safe way to get through the valley is to take the blue path, detailed and maintained by both of the communities it is flanked by. The villagers all said the upkeep was mutual, and that they were on very good terms with the other town/village/waypoint.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[320,320],"drawn":false},{"_id":"F6fv4W81YvBtxny3","flags":{},"type":0,"text":"Upon getting out of the first town’s territory, they find the rest of the path barricaded and blocked, the barricade older and written in an archaic version of the prime language. The trees and animals all look like they are from a different time. There is a ‘detour’ path but it’s filled with primeval dangers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[321,321],"drawn":false},{"_id":"HKdavbLT3ef7ElGg","flags":{},"type":0,"text":"While traveling the carriage you are riding on hits a rather large bump causing an already weak axel to snap rendering the carriage useless. The party must either find a way to fix the snapped wood so that they continue, or they can try and convince another traveler to help.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[322,322],"drawn":false},{"_id":"7jUrhrwtabTUYaph","flags":{},"type":0,"text":"You find the rats have gotten into your rations. You’ll either need to make constitution saving throws or find new food.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[323,323],"drawn":false},{"_id":"Sd7nH1FiTNeDGv9E","flags":{},"type":0,"text":"A massive and extremely powerful dragon ambushes you somewhere along your journey through a massively dense and vast forest. It is strong enough to slaughter you all without trying, and is upset that you are not aware of it. Gonna have to talk fast to appease it. It also desires a rare food item you possess, and will allow you to pass if you offer it the food and an appeal to its vanity.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[324,324],"drawn":false},{"_id":"QE5f1lW2Er2sHkmf","flags":{},"type":0,"text":"This actually happened to me in a campaign: An axle on the cart breaks and a druid, in an attempt to repair the cart, accidentally Druidcrafts the wooden wheel or another wooden piece of the cart into a bush.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[325,325],"drawn":false},{"_id":"ZXAOgMYRGaqT9b1K","flags":{},"type":0,"text":"There’s been an earthquake, and the pathway is blocked by something. It might be a fallen tree, a crack in the ground, or a piece of land that broke off a mountainside. Either way, it’s going to be difficult to get past it and nigh-impossible to get a cart across.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[326,326],"drawn":false},{"_id":"f38Uv4c5URJbwoDZ","flags":{},"type":0,"text":"Jack’s Lanterns – Strange lights can be seen far away, off the path. They hover over pits and quagmire, and will trap unwary travellers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[327,327],"drawn":false},{"_id":"oo8HX2WAFy29M3hT","flags":{},"type":0,"text":"Dimensional Instability – There’s been a small ripple in the planar fabric between worlds. For a few moments, another plane is open. It might be the Elemental Plane of Fire, the Feywild, the Shadowfell, the Astral Plane, or even one of the realms of the gods.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[328,328],"drawn":false},{"_id":"jJcuCKJYjtIhZ9tl","flags":{},"type":0,"text":"Mystic Orchard – A large area filled with various trees and bushes, each one covered with different fruits. Food is plentiful, but some of the assorted berries might be poisonous or have a side-effect.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[329,329],"drawn":false},{"_id":"kNzEkVyL5RyDoeGj","flags":{},"type":0,"text":"Overgrowth – The path is overgrown with vines, grasses, and tree roots. It is difficult terrain to move past, and will take twice as long to cross.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[330,330],"drawn":false},{"_id":"ai6F2UWUiAoVOtwj","flags":{},"type":0,"text":"Oh look, it’s a giant stag. Roll 2d4. 2-4 means the stag charges. 5-7 means it looks at your party and moves on. 8 means it bows before you, granting your party a 2-point Charisma Bonus for the next week.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[331,331],"drawn":false},{"_id":"BKkqH8CCdoR1UR8H","flags":{},"type":0,"text":"A felled tree blocks your path, and the way around is blocked by dense overgrowth.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[332,332],"drawn":false},{"_id":"rwRJXOYvO0v7bGeJ","flags":{},"type":0,"text":"You come across a large battlefield of some previous encounter with hundreds of bodies laying strewn across the ground and piles of corpses heaped into stinking mounds, crossing around will take a full day but if they cross through they need to make a Constitution save DC 15 or become sickened with rot from fly bites carrying disease which gives the poisoned status for 24 hours.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[333,333],"drawn":false},{"_id":"d03t5LLo3zo2fxVA","flags":{},"type":0,"text":"The next town is roughly 50 days away around the mountain and the only other way is through a tunnel with a REALLY steep fee. (Or a SECRET TUNNEL)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[334,334],"drawn":false},{"_id":"h4cOnw2zClFVi3db","flags":{},"type":0,"text":"A mating ball of poisonous snakes is in the way.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[335,335],"drawn":false},{"_id":"K2sOcwyekxhmyGue","flags":{},"type":0,"text":"A herd of wild goats appear. One takes a particular liking to any dwarves in the party.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[336,336],"drawn":false},{"_id":"mGhl7Q07go1r2mYG","flags":{},"type":0,"text":"The remains of a horse on the trail have attracted a bear. It’s too busy gorging to notice you.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[337,337],"drawn":false},{"_id":"ZqgIXQgLGwScvgIB","flags":{},"type":0,"text":"A forest fire blocks the path after a thunderstorm.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[338,338],"drawn":false},{"_id":"oiTPSTf5A2pc2UTH","flags":{},"type":0,"text":"Snow melt have turned a small creek into a massive raging river. The only bridge is destroyed.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[339,339],"drawn":false},{"_id":"mpftWxbjU3twGKYg","flags":{},"type":0,"text":"A recent landslide has resulted in several large boulders tumbling into a narrow section of the river, making it very difficult to navigate in the Dory boat the party is traveling in. The boat has an HP of 13, roll 1d4 x 4 to see if it safely makes it through, without the hull being opened up, which would cause it to sink.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[340,340],"drawn":false},{"_id":"cYoqX7ygqfdKvr47","flags":{},"type":0,"text":"A mess of vines blocks the party’s way. Seems like a sharp weapon will be needed.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[341,341],"drawn":false},{"_id":"bSFwbmo8KXWVg8cK","flags":{},"type":0,"text":"Two bugbears are sleeping off their hangover in the middle of the road. You can try to sneak past, take a detour, or attack.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[342,342],"drawn":false},{"_id":"wcF8WF9dSGsnyA4e","flags":{},"type":0,"text":"Part of the path has been washed away leaving a large, deep mud puddle that is difficult to traverse around with the wagon/cart because of the dense bush either side. If the party chooses to forge through it takes them 2d20 minutes, and they end up covered in the thick, sticky, foul smelling mud. If the party chooses to clear a path to the side it takes them 3d20 minutes.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[343,343],"drawn":false},{"_id":"hjmLIzhzEBPWHjt5","flags":{},"type":0,"text":"You notice an abundance of sink holes in the field. Players bust be careful with their footing as well as not grouping up to close together.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[344,344],"drawn":false},{"_id":"eg0FmqXcTiSvSSlF","flags":{},"type":0,"text":"You find two exact similar dwarfs fighting each other with crossbows and taking cover. Both say the other is a doppelgänger. None of them is, they’re just lost siblings. One is named Thruduanir and the other is just named Greg.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[345,345],"drawn":false},{"_id":"1xqxsG43ts4ANde5","flags":{},"type":0,"text":"A small red skinned creature sits ontop of a rock on the side of the road. It waves to you and implies that it wants to play a game with you, to pass his test to get his higher devil horns. If not, he vanishes. Roll a d6. 1-2 the devil vanishes and leaves a small purse filled with coin, around 10gp.(the coins turn to lead in one hour) 3-4 a group of (appropriate) undead appears and will fight for their souls to be released by the devil. 5-6 a (appropriate) demonic being is brought into existence, will attack the group immediately.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[346,346],"drawn":false},{"_id":"Il9q726OeqwxNvi7","flags":{},"type":0,"text":"An old sagelike man sits on the side of the road and begs the party for food, water or gold. -If given food, he disappears and gives a blessing to the goddess of wanderers, the party will not be disturbed on their next long rest. -If given water/wine/ale, the old man hands the party an everflowing mug, containing what they gave him in the first place. -If given gold, he asks the partymember what his favorite animal is and then hands over a golden egg. Soon, a familiar of choice (will grow up to one feet tall) will be born from the egg. -If given nothing, he curses you and will stripe your party of half their rations and water.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[347,347],"drawn":false},{"_id":"CO6VhgImhDTGCwFf","flags":{},"type":0,"text":"A hangman and magistrate with a constructed gallows are preparing to execute a man for poaching. The man sees the party and yells for help as the hangman struggles to get him in the noose.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[348,348],"drawn":false},{"_id":"Xc8F0ZYDP0fSssil","flags":{},"type":0,"text":"A “very human” child is drawing strange runes in the dirt with a bag of blue sand.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[349,349],"drawn":false},{"_id":"MOohwUcEc62PSzuL","flags":{},"type":0,"text":"A Traveling circus is coming the other way and they want to practice their act: A mind control/hypnosis performance. At some point the party realizes they have no intention of letting whoever they hypnotize leave the troupe.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[350,350],"drawn":false},{"_id":"vMqA2r2ZMEopSkrq","flags":{},"type":0,"text":"A dozen ogres are playing hide and seek. They don’t really feel like eating you, they just want to play.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[351,351],"drawn":false},{"_id":"UmTWvqOJM789NW3R","flags":{},"type":0,"text":"You find a merfolk in a barrel of water by the side of the road. You are at least a mile from the nearest water source.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[352,352],"drawn":false},{"_id":"rEWRiElGn9Aqm9Pv","flags":{},"type":0,"text":"Half a skeleton grabs onto the back of your horse/wagon.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[353,353],"drawn":false},{"_id":"QGa64W5wBeG33Ki0","flags":{},"type":0,"text":"All forms of vegetation along a lengthy stretch of the road have been transformed into glass, while the top inch of the terrain has transformed into obsidian. Along the sides of the road are statues of confused, frightened animals made from random rocks and minerals. All organic life in the area slowly begins transforming into various rocks and minerals over the course of one full day, at which point the organisms are petrified. A fully transformed organism may only be cured through use of Greater Restoration or a similarly powerful magical effect. Upon leaving the stretch of the road, any partially petrified creatures have the transformation process occur in reverse at the same rate.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[354,354],"drawn":false},{"_id":"uRcLCqqHrWTxHLG7","flags":{},"type":0,"text":"A friendly, sentient dust devil comes across the party and follows them around for 1d4 hours, behaving like an excited puppy for its duration. It communicates by swaying forward and back for affirmation, and left and right for negation.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[355,355],"drawn":false},{"_id":"WmdBcqENp25ymkyu","flags":{},"type":0,"text":"A speaking animal, like a frog or a bird, is passing your way, looking for direction and a way to be polymorphed back into it’s true form.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[356,356],"drawn":false},{"_id":"6n1AdmwtMxLtLiHu","flags":{},"type":0,"text":"A bare piece of plains, with a large stone set in the middle. The still legible inscription reminds of a great battle long ago. Ghosts are said to haunt here in the night.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[357,357],"drawn":false},{"_id":"B58V2Q7YMPDOsi6A","flags":{},"type":0,"text":"A flat corridor between mountain passes has many windmills dotting the landscape due to the constant and unvarying wind flow. One of the windmills lies in the middle of the path ahead.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[358,358],"drawn":false},{"_id":"2gzQdSbZq5uUwdJW","flags":{},"type":0,"text":"A large, deep depression in the ground that appears to be covered in smooth, gray-black glass. If one slips and falls in, it is very difficult to get out. At the edges, it fades into the soil, and there is grass growing in cracks in it. If broken, it is very sharp. There are several animal skeletons at the bottom.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[359,359],"drawn":false},{"_id":"h7DWmC4lc1EWnwzF","flags":{},"type":0,"text":"A recent landslide has exposed a large fossil in the middle of the path.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[360,360],"drawn":false},{"_id":"RQATeNzosU7oDWFS","flags":{},"type":0,"text":"Two wizards are dueling on the path ahead. They continually cast Ice Wall, making it nearly impossible to pass.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[361,361],"drawn":false},{"_id":"pmTbdFsJN62ByDhM","flags":{},"type":0,"text":"A two-headed giant is napping on the path ahead. Do you try and fight, or sneak past him?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[362,362],"drawn":false},{"_id":"U8XL9qCzKayj8qzE","flags":{},"type":0,"text":"A huge nest has fallen from a tree on the side of the road. The strange-looking eggs within seem on the verge of hatching.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[363,363],"drawn":false},{"_id":"qWA27bEkWj9cnHSU","flags":{},"type":0,"text":"A dwarf falls from the sky onto the road with a splat. (Did a creature drop it, was he launched into the air, did he fall from a floating fortress?)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[364,364],"drawn":false},{"_id":"p6EUZCq7Md9H5gq6","flags":{},"type":0,"text":"A row of severed heads on spikes and a warning sign claiming, “Dis Rode Belong Negan”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[365,365],"drawn":false},{"_id":"kYzEaoqsJeC54f8J","flags":{},"type":0,"text":"A very small goblin wearing an old carpet as a cape leaps into the path and demands tribute.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[366,366],"drawn":false},{"_id":"fNgchl5gICIRqgya","flags":{},"type":0,"text":"A crazed halfling, starved out of his mind, jumps to the backs of the PCs and rips their packs apart with his teeth in search of food.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[367,367],"drawn":false},{"_id":"NqxmUnE9UHF2nRIV","flags":{},"type":0,"text":"A bounty hunter tracks his target.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[368,368],"drawn":false},{"_id":"mJgdiD7KIIK9plJE","flags":{},"type":0,"text":"A lush garden is filled with ripe vegetables. It is protected by a magical ward, but what is triggered when entering the garden?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[369,369],"drawn":false},{"_id":"1uIwi8w92ylyi4Sc","flags":{},"type":0,"text":"A monstrous mount is ridden by a gnome. Friend or foe?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[370,370],"drawn":false},{"_id":"ppHmVlBzqRg9crVS","flags":{},"type":0,"text":"Two guards hold a wanted poster. They carefully studies the party as they pass by.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[371,371],"drawn":false},{"_id":"qvuv2M9v0KNGTUH2","flags":{},"type":0,"text":"A smiling roadside merchant roasts rats, frogs, and squirrels on sticks. He offers a bite to the PCs.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[372,372],"drawn":false},{"_id":"HQ7ZRNhauZc7zXjx","flags":{},"type":0,"text":"A chatty bard walks alongside the party. Time for an exposition dump!","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[373,373],"drawn":false},{"_id":"twAnWptjt7hyEUSW","flags":{},"type":0,"text":"A bridle ties a well-groomed speckled horse to a nearby tree. The horse is fitted with an elegant but empty saddle. Who does it belong to? Do the PCs take it?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[374,374],"drawn":false},{"_id":"MqDQf5BplWMHwFCt","flags":{},"type":0,"text":"A powerful storm forced you to take the only available refuge: an elderly couple’s home just off the side of the road. The two room home holds numerous open cups of the same pungent liquid.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[375,375],"drawn":false},{"_id":"kLdHkSC3UzpztEdX","flags":{},"type":0,"text":"A naked bard asks for a lift to the nearest inn where he left his clothes and money.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[376,376],"drawn":false},{"_id":"K4QqftzEqWSNDmY9","flags":{},"type":0,"text":"Alongside the road, a charlatan asks the party if they want to see a performance of his trained pets. The slightest affirmative answer causes Steve to give a whistle, and a huge swarm of ravenous locusts suddenly manifests.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[377,377],"drawn":false},{"_id":"AmTccLmXyi1pQZI8","flags":{},"type":0,"text":"A fat friar hurries past the PCs mumbling, “It isn’t fair.”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[378,378],"drawn":false},{"_id":"vT6xq6WUulpVMW6W","flags":{},"type":0,"text":"An evil wizard is tied to a stake, the body still smoking.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[379,379],"drawn":false},{"_id":"b7JXhtgIalM3m2Qb","flags":{},"type":0,"text":"Three young men work on tipping over an occupied outhouse.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[380,380],"drawn":false},{"_id":"hYRcjGoB9HRJHlun","flags":{},"type":0,"text":"A band of orcs runs toward the party. They look over their shoulders and try to run through the party. Something dreadful has terrified them, and the party is heading in its direction!","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[381,381],"drawn":false},{"_id":"PGoi7BdEyKkfrH1W","flags":{},"type":0,"text":"Traveling off the main road, the PCs feel like they are being followed. Who is hunting them?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[382,382],"drawn":false},{"_id":"1cRFs1spLrI0v9c2","flags":{},"type":0,"text":"Three types of meat hang on a spit over a campfire. It is clear that it is three types of humanoids that hang over the flames.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[383,383],"drawn":false},{"_id":"j5PXr60xGflgjyv3","flags":{},"type":0,"text":"A snowy road hides a sinkhole that chutes the party on a slalom slide down the mountainside.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[384,384],"drawn":false},{"_id":"y3nxvg5yQYMkjkpR","flags":{},"type":0,"text":"A well-spoken bugbear wearing fine studded leather armor is trapped under a fallen tree. He begs the party to come to his aid.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[385,385],"drawn":false},{"_id":"i53nM71t7CWTLBKg","flags":{},"type":0,"text":"A ranger stops by the group’s camp one night and gives them advice on the trail ahead, including places to camp and a tavern where they can get good rates if they mention his name. All his advice is impeccable, but when they mention his name at the tavern, they’re told he died years ago on that very road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[386,386],"drawn":false},{"_id":"C0ouDFk3n3tKuliF","flags":{},"type":0,"text":"A shopping list for potions lies on the ground.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[387,387],"drawn":false},{"_id":"vs3vrfwMEI691yvh","flags":{},"type":0,"text":"The local baron has enacted a toll bridge. Several peasants were unaware, and cannot afford the toll. They beg the PCs for change.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[388,388],"drawn":false},{"_id":"jGky6x0HxRs6BVox","flags":{},"type":0,"text":"You find the remains of a pouch that contains coins fro ma land you do not recognize.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[389,389],"drawn":false},{"_id":"HGlg499nzCsezNTD","flags":{},"type":0,"text":"The party hears a long stream of curses further up the road. Then they spot a head in the road. A person is still alive, buried up to his neck!","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[390,390],"drawn":false},{"_id":"vSkXkBvr1rrtoupb","flags":{},"type":0,"text":"An arrow hits a nearby trunk, a message wrapped around the shaft.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[391,391],"drawn":false},{"_id":"b2wIyAkqgBY5pBcZ","flags":{},"type":0,"text":"A bridge is missing. Where it used to be is now a ferry service, for a sizable fee. The ferry looks like it might consist of bridge parts, and only takes a few travelers at a time.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[392,392],"drawn":false},{"_id":"KMswGD2L81d8D9jH","flags":{},"type":0,"text":"A loaded wagon travels down the road toward the party, but it has no apparent means of propulsion.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[393,393],"drawn":false},{"_id":"MM34p0wehP4A8iZD","flags":{},"type":0,"text":"As bandits attack, the PCs realize a friend of theirs is among the robbers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[394,394],"drawn":false},{"_id":"kjkLHMlWKHZYlPc5","flags":{},"type":0,"text":"There is a mysterious flicker ahead, and one member of your party suddenly stops, paralyzed.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[395,395],"drawn":false},{"_id":"dUPmxfbEh6BQJz7W","flags":{},"type":0,"text":"Orcs gather twigs and berries along the road and it’s clear they have non-hostile purpose. Will the PCs attack just because they are orcs?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[396,396],"drawn":false},{"_id":"lArTEEt2OdMXND2b","flags":{},"type":0,"text":"A tree falls onto the road. Then a fireball blows up the tree. It appears the PCs are in the middle of a skirmish between druids and fire wizards.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[397,397],"drawn":false},{"_id":"Qx7XKDaT49ICBren","flags":{},"type":0,"text":"Flowers by the roadside turn their heads to follow the party, and they’re getting larger.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[398,398],"drawn":false},{"_id":"G4e7DeEpoXWIxh8h","flags":{},"type":0,"text":"An overturned beer cart lies in the road. Nearby, an enormous troll snores loudly, surrounded by empty kegs.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[399,399],"drawn":false},{"_id":"CL8EQEYZ2rZDN9Wd","flags":{},"type":0,"text":"A set of shackles lies at the side of the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[400,400],"drawn":false},{"_id":"ZM9vhC4d1tfrkZx6","flags":{},"type":0,"text":"A village can be seen to the west. It isn’t on any of the maps.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[401,401],"drawn":false},{"_id":"ZK95bDup5Cdg1z6e","flags":{},"type":0,"text":"Three pilgrims trudge along the dusty road, an old man and two young men. Simple travelers? Or are they more than they seem?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[402,402],"drawn":false},{"_id":"9kk7UA7ymf9JU950","flags":{},"type":0,"text":"You stumble upon an old scroll case wedged between a tangle of tree branches. Inside is a village’s charter of rights and freedoms.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[403,403],"drawn":false},{"_id":"Jzojz0CQ4zGU9EIi","flags":{},"type":0,"text":"A dead magic user clutches a scroll in his stiff hand. The scroll says something important.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[404,404],"drawn":false},{"_id":"O0wDi2dAJ4VbbKWE","flags":{},"type":0,"text":"A single giant footprint lies along the path. There are no other signs of such footprints in the area.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[405,405],"drawn":false},{"_id":"KISImMxjuz7xOHNi","flags":{},"type":0,"text":"You party awakens to find all your gear has been stolen during the night. A quick search reveals twelve sets of tracks and, lying in the middle of your campsite, a smoldering pouch of herbs that, when you sniff them, make you feel slightly drowsy.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[406,406],"drawn":false},{"_id":"OJPRb32iQssNRg6R","flags":{},"type":0,"text":"An enormous dragon lands on the road in front of the group. It asks for directions to a certain village, gives the party a generous tip, and then flies off saying he intends to raze it to the ground.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[407,407],"drawn":false},{"_id":"tXOU6v16uuQ9jVi1","flags":{},"type":0,"text":"An exotic, almost alien weapon or tool lies on the side of the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[408,408],"drawn":false},{"_id":"sBcDY7uNHydtyhAB","flags":{},"type":0,"text":"The PCs mysteriously repeat a piece of road they already passed, though the route has been perfectly straight to this point. The road even includes their footprints.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[409,409],"drawn":false},{"_id":"KlifLAnFpxuN1FPc","flags":{},"type":0,"text":"A dozen townsfolk are running after a fleeing woman and attempting to stone her to death for being a prostitute.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[410,410],"drawn":false},{"_id":"UBK6dRuf57rsmbP4","flags":{},"type":0,"text":"Two other adventuring groups are arguing in the middle of the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[411,411],"drawn":false},{"_id":"pxidMNLDpLmFmHgs","flags":{},"type":0,"text":"You see a man-sized shadow from the left side of the road waving its arms at you. “Over here, quickly, I’ve caught one!”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[412,412],"drawn":false},{"_id":"KBdG9QVIyMYFOnh2","flags":{},"type":0,"text":"A person fleeing arranged marriage seeks refuge with the PCs.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[413,413],"drawn":false},{"_id":"jk1gURasRktuluz5","flags":{},"type":0,"text":"Picked mushrooms lay on stump to dry.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[414,414],"drawn":false},{"_id":"6JOPDwhf6snd1UaZ","flags":{},"type":0,"text":"A strange old man offers the PCs a scroll in a language they cannot read.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[415,415],"drawn":false},{"_id":"U0m9wcbGse4VDIWM","flags":{},"type":0,"text":"Gnomes are holding a yard sale! They have any number of strange and fascinating contraptions.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[416,416],"drawn":false},{"_id":"E6KgRID4WRacoxN9","flags":{},"type":0,"text":"Someone has scattered caltrops across the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[417,417],"drawn":false},{"_id":"ITeYUf9rALEFCGPV","flags":{},"type":0,"text":"You encounter a monk, a monkey, a turtle and a pig, all heading west.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[418,418],"drawn":false},{"_id":"Jm34554Rhs3BAyMT","flags":{},"type":0,"text":"A weathered sign points off the road, yet with no apparent trail to follow.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[419,419],"drawn":false},{"_id":"zposKg4PELjdAiuk","flags":{},"type":0,"text":"The next 100 feet of road are covered with newly grown grass.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[420,420],"drawn":false},{"_id":"qeGn9rnvxpEn4KnR","flags":{},"type":0,"text":"Ladies clothing and under clothing are strewn in the bushes along the road. How did these get here?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[421,421],"drawn":false},{"_id":"HK28n3gXfoSGsbhA","flags":{},"type":0,"text":"A formerly brilliant wizard, now pesters the party with the incoherent rants of a man driven mad by a botched invisibility spell.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[422,422],"drawn":false},{"_id":"WUl2RNjwmxmOpC3M","flags":{},"type":0,"text":"A drunken dwarf staggers along, challenging everyone to a wrestling match.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[423,423],"drawn":false},{"_id":"Y2fnMrGbvFQS7GBV","flags":{},"type":0,"text":"A goblin, on fire, runs shrieking past the party.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[424,424],"drawn":false},{"_id":"bWQwer9NzbgMFfow","flags":{},"type":0,"text":"A rock with an odd, glowing rune sits by the road ahead.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[425,425],"drawn":false},{"_id":"Uf8wlUlFhTMz2BOe","flags":{},"type":0,"text":"A noble, disguised as a filthy beggar, tests the party’s compassion and generosity. If they pass whatever standard he sets, then he becomes a source of various quests that require personal sacrifice to accomplish.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[426,426],"drawn":false},{"_id":"LUbYldkz9OZezQ3u","flags":{},"type":0,"text":"A circus is set up alongside the road. A barker on the roadside cajoles you to “come inside and see what wonders it holds.”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[427,427],"drawn":false},{"_id":"VAwSzXfHfRYfjNrv","flags":{},"type":0,"text":"The road crests a hill, and spread out before the group is a stunning, sweeping vista of the land beyond. A painter sits nearby, capturing the scene, and asks the group to pose for his foreground.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[428,428],"drawn":false},{"_id":"MYbjyCJ85dZYn4Xw","flags":{},"type":0,"text":"An overturned rowboat sits on the side of the road. There is no river or stream nearby. Under the rowboat is an entrance to a lair.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[429,429],"drawn":false},{"_id":"8QYwM9sZ3dT0Acbb","flags":{},"type":0,"text":"A wandering cleric begs the heroes to recover a relic for them.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[430,430],"drawn":false},{"_id":"GpkJ4etp6LRVQSIH","flags":{},"type":0,"text":"A road sign saying where you came from is ahead of you.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[431,431],"drawn":false},{"_id":"D2i7pJMeOTw2USwM","flags":{},"type":0,"text":"A group of guardsmen hang wanted posters on trees. One face looks familiar to a PC.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[432,432],"drawn":false},{"_id":"G6mGMwZSHGEED4z4","flags":{},"type":0,"text":"A carriage is stuck high up in a tree.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[433,433],"drawn":false},{"_id":"V4Ph9tNipXH8yoW4","flags":{},"type":0,"text":"In the morning while breaking camp, the PCs spot a bush that wasn’t there before.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[434,434],"drawn":false},{"_id":"cYkDD1uppH1cgs4j","flags":{},"type":0,"text":"A beautiful woman, adorned in the robes of an enchantress, emerges from hiding near the road and implores you to lend her aid.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[435,435],"drawn":false},{"_id":"Joe0CLoB3lb9e6eG","flags":{},"type":0,"text":"The road is lined with snakes sleeping in the sun.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[436,436],"drawn":false},{"_id":"aVKN8Lu11k5ShaXT","flags":{},"type":0,"text":"A necromancer uses his talents to animate animal and human corpses and forces them to perform in a roadside circus. The townsfolk from a nearby village seem to enjoy the show a bit too much.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[437,437],"drawn":false},{"_id":"PU6KAIDzJ3ug6lX1","flags":{},"type":0,"text":"A chain gang digs ditches beside the road.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[438,438],"drawn":false},{"_id":"AR4d5Cxbt77wsLLx","flags":{},"type":0,"text":"A traveling minstrel challenges the wisest looking member of the party to a storytelling contest.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[439,439],"drawn":false},{"_id":"xX4crGi1t2QXztEz","flags":{},"type":0,"text":"A wizened tinker sells charms from his cart: dried frogs, finger bones, cat skulls, and the like. Leaving him, you turn to find he is eerily out of sight altogether.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[440,440],"drawn":false},{"_id":"Fa2XrtIVZQH0yYXy","flags":{},"type":0,"text":"A paladin of a holy church and his retinue have ridden out on a holy crusade against evil and demand others who serve the cause of good to join their cause on the spot.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[441,441],"drawn":false},{"_id":"jl7WV7Bf3HWoA6T0","flags":{},"type":0,"text":"The road starts to get muddy. Soon the mud is two feet deep. Water in the ditches alongside starts to bubble.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[442,442],"drawn":false},{"_id":"zRIoZSFA7SmLPh5I","flags":{},"type":0,"text":"A majestic elk sprints past with something golden caught in its antlers.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[443,443],"drawn":false},{"_id":"n515FgFnc4JxsmL3","flags":{},"type":0,"text":"A stranger on the road tells each PC to repent of their sins. He knows details.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[444,444],"drawn":false},{"_id":"f02ucWv1DyZTZuqa","flags":{},"type":0,"text":"A door stands beside the road, but there is no sign of the rest of the house.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[445,445],"drawn":false},{"_id":"8t0bknbN2qL8CvXP","flags":{},"type":0,"text":"A wine merchant’s wagon has shattered a wheel and he offers passers-by cut rate prices on his wares as it is getting repaired.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[446,446],"drawn":false},{"_id":"7xj9PKTULMQwVWo4","flags":{},"type":0,"text":"An ugly old woman struggles to bring her wash basket of wet clothes up from the creek to the road. She stumbles and drops the laundry back down the slope.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[447,447],"drawn":false},{"_id":"u6lxuJI2wm5XyUDd","flags":{},"type":0,"text":"A monk, collapsed and bleeding on the roadside, pushes an unremarkable ring into a PC’s hands and desperately whispers, “You must…” before exhaling his last breath.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[448,448],"drawn":false},{"_id":"rFCJeqDcNvS4McHi","flags":{},"type":0,"text":"A lost gnome asks for directions.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[449,449],"drawn":false},{"_id":"hEjJM7A9opWUpU77","flags":{},"type":0,"text":"A dead raven lies on the road, pierced by a bright blue fletched arrow.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[450,450],"drawn":false},{"_id":"Q09zt2aKUpu6pDjs","flags":{},"type":0,"text":"A table on the roadside holds a large basket of fresh vegetables. A sign reads “1 copper a bunch: honesty is a virtue!”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[451,451],"drawn":false},{"_id":"e8XhUeIezH19nXk6","flags":{},"type":0,"text":"You find a small leather bag. It smells of moisture, and contains a set of keys and a vellum map to the location of a small keep.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[452,452],"drawn":false},{"_id":"9zVG0nMqKA0ZIasZ","flags":{},"type":0,"text":"The road is littered with bear traps.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[453,453],"drawn":false},{"_id":"BT5u8BopMVchZlip","flags":{},"type":0,"text":"A thick fog has settled on the bridge ahead.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[454,454],"drawn":false},{"_id":"g5CZ6ewisZDY7Fov","flags":{},"type":0,"text":"The group arrives late at night at a tiny village straddling the road. They secure accommodation and food from the friendly locals and fall asleep. In the morning the village is empty and ruined, as if abandoned years ago.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[455,455],"drawn":false},{"_id":"5ujjWZQtN7ih3xiL","flags":{},"type":0,"text":"As the road passes through a hilly region, you spy a cave, from which can be heard the voice of a singing female.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[456,456],"drawn":false},{"_id":"sIeGMxaJKu4ZUhKD","flags":{},"type":0,"text":"As you turn the corner, a dwarf and elf are standing over a stack of goblin corpses. They argue over the kill count.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[457,457],"drawn":false},{"_id":"5rP30DD3iBAFgrhx","flags":{},"type":0,"text":"The party notices a sudden and drastic change in temperature, then just like that, things are back to normal.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[458,458],"drawn":false},{"_id":"btI1RCMmakpOWKda","flags":{},"type":0,"text":"A little girl is watching you from just off the road. The next time you glance over, you see a wolf run away.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[459,459],"drawn":false},{"_id":"6Agy8PhYDckhLBHh","flags":{},"type":0,"text":"An ecstatic farmer presses a cigar into your hands and proclaims, “It’s a girl!”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[460,460],"drawn":false},{"_id":"czsQfUEzkBJJl17Y","flags":{},"type":0,"text":"Scratched into the dust of the road are the words, “Good luck tomorrow. You’re going to need it.”","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[461,461],"drawn":false},{"_id":"sy2JuVM9SyJGEn1b","flags":{},"type":0,"text":"The entire party suddenly loses their bearings and realize that they’ve walked the same mile three times. Are they road weary or are they caught in something manipulating them.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[462,462],"drawn":false}],"formula":"1d462","replacement":false,"displayRoll":true}