{"_id":"zqkhHPZX71RT4qgx","name":"Road (Combat)","permission":{"default":0,"fKShf9sFzL9Lwpkr":3},"folder":"dYeIr3PoXcISCtHZ","sort":0,"flags":{},"img":"icons/svg/d20-grey.svg","description":"1d86 non-bandit combat road encounters\nhttps://www.reddit.com/r/d100/comments/kbqebx/d100_road_combat_encounters_that_are_not_bandit/","results":[{"_id":"oApyC73uB4hdMyj8","flags":{},"type":0,"text":"Prankster Goblins defacing a shrine. (bonus for making it a shrine respected by one of the PCs)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[1,1],"drawn":false},{"_id":"qV7C4jwpzmiMfraM","flags":{},"type":0,"text":"Traveling merchant and his bodyguards transporting goods. (a front for smuggling kidnapped people to be sold as slaves, perception check or passive to hear muffled moans)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[2,2],"drawn":false},{"_id":"Sak6z6yRkmXWuaEl","flags":{},"type":0,"text":"Crazed men and women about to burn a \"witch\" (Only burning her to appease a dark God).","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[3,3],"drawn":false},{"_id":"EfoUvhv9pDf56UdF","flags":{},"type":0,"text":"A lost child (possessed by a powerful mage spirit that was awakened accidentally by the child) attacks the party and attempts to steal their souls.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[4,4],"drawn":false},{"_id":"Lsnf4a8GlwPGualn","flags":{},"type":0,"text":"Traveling noble and his band of thugs riding to the nearest farmstead to raze it for sport. (if stopped or questioned, they attack the party. The noble sits in his coach and watches for fun)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[5,5],"drawn":false},{"_id":"fcEeOsesbUfXlz4p","flags":{},"type":0,"text":"A group of centaurs chasing and hunting down farmers in a \"coming of age ceremony\".","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[6,6],"drawn":false},{"_id":"slWL3S4yy86LTYk0","flags":{},"type":0,"text":"A traveling wizard and his wagon transporting dangerous creatures (black pudding, gelatinous cube). His wagon topples and the creature is now loose.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[7,7],"drawn":false},{"_id":"999bIJHA4TFWwv9L","flags":{},"type":0,"text":"A group of dangerous criminals are being transported by a group of guards when one of the guards (disguised criminal) starts killing the other guards and let's the criminals loose.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[8,8],"drawn":false},{"_id":"Tk962vkRgujV8YNC","flags":{},"type":0,"text":"A large group of traveling pilgrims surround the party as they chant and form a circle around them. Some of them draw weapons and attack the party and fight to the death. The pilgrims are in fact a death cult releasing the party from burden and suffering of life.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[9,9],"drawn":false},{"_id":"MjaLHDadNPvn6uKl","flags":{},"type":0,"text":"The party notices quick changes in the weather. They spot a group of robed figures chanting on top of a hill nearby. If investigated, they find and recognize the symbol of a God of destruction. If left be, a massive hurricane destroys a nearby village.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[10,10],"drawn":false},{"_id":"U6dBlRfUL54SusX3","flags":{},"type":0,"text":"A group of easily offended berserkers offer the party a spot at their campfire. They immediately take offense to the most innocuous things and start a fight. u/errboi","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[11,11],"drawn":false},{"_id":"7IzVy67Kv9fTRocH","flags":{},"type":0,"text":"A bard offers to write a song about the adventurers if they can solve his riddle. u/grogcore","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[12,12],"drawn":false},{"_id":"kwX86MBc81XopFor","flags":{},"type":0,"text":"Blood-Tusk Ogre(s) covered in blue face paint that originated from Icewind Dale or another icy cold climate. Uses a dual ranged javelin attack and two great club swings per turn. u/HWGA_Exandria","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[13,13],"drawn":false},{"_id":"3EWAKcSlXovNlDOq","flags":{},"type":0,"text":"A parasitic Dryad has hijacked the body of an Earth Elemental. The creature vomits up phosphorescent green blood that causes plants to explosively grow wherever it lands. Has a 30' ranged tendril strike equal to the Elemental's melee attack along with knowing the Vine Whip cantrip. Can cast Spike Growth &amp; Plant Growth at the same time during combat since there are technically two of them.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[14,14],"drawn":false},{"_id":"EbK2m91ecn1aS3VX","flags":{},"type":0,"text":"A wolf with two heads is seen heading towards you. Snarling it grows a third head and attacks. Has a single Cone of Flame attack along with a triple bite attack that it can use on up to three targets in melee range.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[15,15],"drawn":false},{"_id":"EzuVYvwVfWQCVxLK","flags":{},"type":0,"text":"A groom is running away from his arranged marriage to a terrible person and their equally terrible family. u/grogcore","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[16,16],"drawn":false},{"_id":"QUQoeADLSwemV2ba","flags":{},"type":0,"text":"A thief that has stolen a wagon of treasure from the town the players are headed to. The town guards catch up with the thief and assume the party is part of the theft. u/LocardIII","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[17,17],"drawn":false},{"_id":"LO7UTevq80FGbWWL","flags":{},"type":0,"text":"A group of traveling actors who are actually doppelgängers, but they truly enjoy theater and won’t attack the party as long as they are watching the show. At some point during the performance, the party may notice the costume changes are happening far too quickly, and there are far more characters in the play than there are actors... u/sonofabutch","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[18,18],"drawn":false},{"_id":"pyiCgSqvpe8LIahg","flags":{},"type":0,"text":"A group of Orcs surrounds the party (and can optionally imprison them/lead them to a camp). They will kill them for sport unless they can sufficiently entertain them musically. u/dynawesome","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[19,19],"drawn":false},{"_id":"KR5oS2uEwgRJX5DK","flags":{},"type":0,"text":"A merchant in a wagon sells items to travelers, but all of them are mimics and he knows, he just loves fooling people. Little does he know the wagon itself is a giant mimic (on a successful perception check the players can notice its features, and can then decide whether or not to tell him. If they reveal it, it attacks the merchant).","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[20,20],"drawn":false},{"_id":"KGKOZhPKqGn34FfQ","flags":{},"type":0,"text":"Krung, the orcish Iron-War-Chef offers to make the players a meal of their life time if they can provide the proper ingredients. If the players are cool to Krung he prepares them the most amazing meal on their return, if they’re rude to him he may try to make them his latest dish. u/Matasmic","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[21,21],"drawn":false},{"_id":"5VSmPYRhNronxP2H","flags":{},"type":0,"text":"A broken caravan is found with dead horses and a crying woman in rags, saying her party got capture by monsters/slimes and she need help. She leads them into the swamp/forest and is luring them in a trap, since she is a hag disguise u/Corruptionfever45","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[22,22],"drawn":false},{"_id":"KJn2kTq6oVhrl5mF","flags":{},"type":0,"text":"A shepherd and his herd of sheep/goats/cattle that are being chased by a beast (e.g. wolf pack, owlbear). u/eriocactus","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[23,23],"drawn":false},{"_id":"Yp2LEaID4As0NETh","flags":{},"type":0,"text":"You spot a lot of smoke and upon investigation you find a fortress on fire. There are people trapped on the top floor. A party of humanoids have noticed as well. u/cdjcon","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[24,24],"drawn":false},{"_id":"uuRGjLxnoASo52wa","flags":{},"type":0,"text":"A groupe of peasant sitting on top of a chariot full of wheat, redistributing it to the people at a fair price. While the merchant is attached to a wheel. (Historically accurate) u/NoelReach","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[25,25],"drawn":false},{"_id":"x1MFa3NGYAylP1Qv","flags":{},"type":0,"text":"As you approach a bend in the road, a half elf in brightly colored clothing who is riding hard pulls himself to a stop and hails the party in a familiar manner. Perhaps he tries to hand them a purse or satchel. This interaction is witnessed by the large party of riders that round the bend a few rounds later. The half-elf acts surprised to see them, yells a warning to the party, then resumes fleeing. The party hears shouts of “He has helpers!” from the oncoming riders. u/kkngs","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[26,26],"drawn":false},{"_id":"n1sACimxbQJRS0kP","flags":{},"type":0,"text":"A rider moving at full gallop emerges from the brush at the side of the road in front of you. It’s a young maiden with red curly hair and a bow strapped to her back. She completely ignores you as she and her horse leaps over a fallen log and continues on a smaller side trail, disappearing into the brush. Moments later a very large, and very angry dire bear emerges from the direction she came from.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[27,27],"drawn":false},{"_id":"2ujO5phlvrppM4mw","flags":{},"type":0,"text":"2 black bears are rummaging a caravan when they adventurers hear an old men yell “My cabbages!” u/devonkidwell","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[28,28],"drawn":false},{"_id":"ZmeS5qxtXy9N7X8W","flags":{},"type":0,"text":"You stumble across a pile of dead bodies in the middle of the road. Bandits have struck. Then, you see their eyes begin to glow and a fledgling necromancer appears from behind the bushes. He calls himself \"the collector\" u/Milkslinger","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[29,29],"drawn":false},{"_id":"YYer2JqTOJp6742O","flags":{},"type":0,"text":"Four small dirt piles are found scattered in the road ahead of you, along with a young child digging and carefully burying a potion. When asked what they are doing, the young child replies, “A man will give me coin to bury these potions. Don’t step on them, they’ll go ‘boom’!” u/McBeardedson","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[30,30],"drawn":false},{"_id":"bVkP5D4RLgTObuB1","flags":{},"type":0,"text":"A group of heavily armed goblins marching with purpose. It turns out they're part of a tribe of converted monsters being run in by high level druids/clerics/rangers in the mountains. Killing them means you become an enemy of the rapidly expanding tribe. Befriending them gets you directions to an outpost where you can get quests from the tribe. u/Radan155","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[31,31],"drawn":false},{"_id":"o7n1oSegYut5r0v2","flags":{},"type":0,"text":"A troll rises from underneath the decrepit bridge demanding a toll. Anyone who attempts the pass over the bridge without paying gets attacked. The troll is actually attempting to raise enough funds to fix/rebuilt the bridge. u/supersnes1","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[32,32],"drawn":false},{"_id":"AFd7xR66J0YuGLtM","flags":{},"type":0,"text":"The party comes upon a small but lively inn. The host welcomes you to sit by the fire with the other patrons while the musician plays a haunting melody. Close inspection shows that things are off: the smell of charred flesh, burning wood, faint sounds of roaring flame, ect. The inn is an illusion of the past with the other people present being ghosts of those killed in a terrible fire decades back. Attempts to escape or direct confrontation will lead to hostilities. The inn returns to being a charred husk after then encounter.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[33,33],"drawn":false},{"_id":"YSQz8Ri6oN3YdkAX","flags":{},"type":0,"text":"You stumble across a battle between two other evenly matched factions. Its your choice to intervene to help one side or wipe both out.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[34,34],"drawn":false},{"_id":"2I0p82Bzb9i9gnAF","flags":{},"type":0,"text":"Elven ecoterrorists ambush you in an effort to destroy your wagon(s) and supplies. Attempts to disrupt or destroy local wildlife will make you direct targets.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[35,35],"drawn":false},{"_id":"E4pMU6M7yBWbdIvz","flags":{},"type":0,"text":"Goblins have created a \"fortress\" along the side of the road. They demand fealty and tribute for their leader. The \"fortress\" is an abandoned and overturned cart that they dug some tunnels under and added a new door.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[36,36],"drawn":false},{"_id":"cZstlBiLmP6No60V","flags":{},"type":0,"text":"Awakened crops and other plants from a nearby farm have gone berserk. They have ransacked the farm and now capture travellers in order to deliver them to a house sized pumpkin in the garden.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[37,37],"drawn":false},{"_id":"Nt3gMaAYVaKLa4fs","flags":{},"type":0,"text":"The winds of magics whip into a frenzy. A front of wild magic permeates the area forcing all casters to fight to control their spells. Spell that get \"free\" become semi-sentient (with their demeanor depending on the spell) and may attack the party.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[38,38],"drawn":false},{"_id":"9hnwTEna8e8tfoFP","flags":{},"type":0,"text":"Two very large ogres lie face to face blocking the path, locked in an intense arm wrestle, oblivious to all else going on around them. u/idek_mannnn","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[39,39],"drawn":false},{"_id":"DGiq0vZHW9pr0niK","flags":{},"type":0,"text":"A lone knight sits leaning on the trunk of a heavy tree, nursing a severe wound in their side. They desperately need medical attention or they will soon perish. Should they be saved, they will owe a debt to their saviour.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[40,40],"drawn":false},{"_id":"kiQg0cSngHuyojPG","flags":{},"type":0,"text":"Two identical men are fighting over a backpack. Each claims the other is a doppleganger trying to steal their identity. (Plot twist, both are dopplegangers and the man they depict is long dead)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[41,41],"drawn":false},{"_id":"nvYtqBfJ2jOdDeg0","flags":{},"type":0,"text":"Royal guards on horseback request that everyone temporarily steps off the road while a noble entourage passes by. What follows (after some short time) is an incredibly fat goblin riding an incredibly fat pony, accompanied by more guards and a trumpeter playing fanfares.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[42,42],"drawn":false},{"_id":"B9l9A5Or25m7iTBD","flags":{},"type":0,"text":"What is obviously three kobolds atop each other’s shoulders disguised by a large coat and hooded cloak. The top ones asks (in very broken common) where the “human city” is.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[43,43],"drawn":false},{"_id":"R7bl2xhxQJGYQu5D","flags":{},"type":0,"text":"A very large tree has fallen across the road. A wagon is on the other side, and the helpless traveling merchant asks you to clear the way in exchange for some goodies. Turns out the tree is a very drunk (and very annoyed) treant. u/Galdrian","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[44,44],"drawn":false},{"_id":"5SPMQ3sT42xAB1Pc","flags":{},"type":0,"text":"A voice echoes out from a under a bridge (in rhyme!) claiming to be the Triple Troll of the Gruff Pass. It's oddly high pitched and turns out to be a single scrawny goblin with a formerly high quality cloak made for someone three times his height. u/hickorysbane","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[45,45],"drawn":false},{"_id":"8w0ylSTT9QOfz8NA","flags":{},"type":0,"text":"Rambuncious youth from a nearby vilage are pushing over an outhouse. The indignant cries of the local mage can be heard from inside.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[46,46],"drawn":false},{"_id":"Kqc8oel2Q8TzF0Os","flags":{},"type":0,"text":"Picked mushrooms lay on a stump out under the moonlight (or drying in the sun). They've been collected by a group of pixies who are willing to trade them for the right price before returning to the feywild with the rest. Myself and another DM have each ran this once, and we both convinced a player to trade their name setting up a whole fae based adventure","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[47,47],"drawn":false},{"_id":"23eLXQSY7WvYG34x","flags":{},"type":0,"text":"A ranger helps guide the party through the forest, and reccomends a place for them to stay. Upon reaching there and name-dropping him they learn he's been dead for 3 years.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[48,48],"drawn":false},{"_id":"J4JGHger3iHHarSs","flags":{},"type":0,"text":"A nearly naked man lines beaten and bruised in the ditch on the side of the rode. If they assist him he offers his services that turn out to be particularly valuable. I just love the scene from A Knight's Tale when Chaucer is introduced","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[49,49],"drawn":false},{"_id":"gp1mbMzurOm5b6pB","flags":{},"type":0,"text":"A group of no-gooders are out looking for (a certain race or creature) to capture for (whatever purpose). Say there is a Tiefling/Elf/Gnome in your group. The no-gooders round a bend in the road and excitedly shout \"There's one! Let's get it!\" u/Arcane-Aaron","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[50,50],"drawn":false},{"_id":"pM9V9Wd3nZIYgRkl","flags":{},"type":0,"text":"Someone selling items on the road to adventurers. Though the items are enchanted! If you wear them, (something... happens.)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[51,51],"drawn":false},{"_id":"OIePEMnjFqOZlXUn","flags":{},"type":0,"text":"Four animated suits of armor are running amok in a nearby village.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[52,52],"drawn":false},{"_id":"iefIoHcpZT8KsMOT","flags":{},"type":0,"text":"A tempting tunnel opening seems innocent, (maybe there is an illusion of something there, an item, or injured person) until the dirt floor opens up, sending the group sliding down into a cage in an underground cavern. Cheers of goblins erupt. A goblin king sitting on an ugly little thrown laughs, \"dance! dance!\" (The goblins are trying to entertain their cruel king with trapped travelers)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[53,53],"drawn":false},{"_id":"WAmDWXyyNH9HtiyK","flags":{},"type":0,"text":"The characters hear word of a village, a day-or-so that way down the road, that hasn't traded, or attended the area market, or any such usual activity for the past month. Some fear to go there, \"what if they're all sick?\" others are angry, \"They no longer want to trade with us?\" A whole village just... shut off from the outside world. Why?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[54,54],"drawn":false},{"_id":"xtA1xtLydrqApI9R","flags":{},"type":0,"text":"The party walks along the road, to a stone bridge. As they approach, they see another party at the other end of the bridge. (Or just, a road out among open fields. Whatever ya like.) The other party doesn't respond if hailed. If approached, the characters notice the other party is identical to the players' party, (in looks, weapons, everything.) The 'other' party stands still. If the characters come within attack range of the identical 'other' party, the others attack. (The DM can use this to show the party what they are capable of, and the players can find ways to defeat 'themselves.')","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[55,55],"drawn":false},{"_id":"bcfRwW5X9eZXR5xu","flags":{},"type":0,"text":"A dragon, or other creature, (just large enough that the party isn't sure if they could defeat it) asks the party to kill a goblin horde (or other type of creatures, depending on party level) and return to him his magic items that were stolen. (Maybe as a reward they can keep one of the items \"having some is better than having none.\"","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[56,56],"drawn":false},{"_id":"x7LrVtaOVB7rja9Z","flags":{},"type":0,"text":"A drow elite warrior calls to the group from the shadows in the trees off the side of the road. \"adventurers?\" he asks. ... He asks the party to either kill or imprison someone for him. This person has killed many others, even boasting about it at times, and surely deserves this. The drow can't do this himself, stating \"personal reasons,\" his eyes glistening with the ghosts of his past. He offers them a key in return, once proof is given that the deed is done. The key opens a chest, of course. Where is the chest? The person he wants killed/imprisoned knows. What's in the chest? Mysterious...","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[57,57],"drawn":false},{"_id":"M0cecwcqnfTmhEDc","flags":{},"type":0,"text":"Someone sells goods in a town. From a large wagon, not a store. He travels, as he collects and sells. \"I've an adventurers heart, I can't settle in one place.\" He sells a +1 weapon to a character or two. Turns out, they are NOT +1 weapons, maybe even breaking the first time they are used/hit very hard. He alters the appearance/value of items he sells, fooling as many as he can before getting out of town.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[58,58],"drawn":false},{"_id":"loKXESwA43gbJoiF","flags":{},"type":0,"text":"A small stocky fellow with snow boots and a fur coat looks distraught. Turns out there is an Abominable Yeti near his little settlement up in the mountains. (Or different clothes/creature if near a different terrain) He offers a reward, a small bag of several bits of food, for defeating the monster. (the food appears mundane, but the stocky man swears it's special. Detect magic etc.. each small piece of food is enough to keep one satiated for a day.)","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[59,59],"drawn":false},{"_id":"iVxuxnXHau2FRAhy","flags":{},"type":0,"text":"A horse drawn cart plodding slowly towards town, but no driver. Closer inspection reveals claw marks on the wood and a splatter of blood. The horse is in a daze. The cart is filled with turnips. u/PhilistineAu","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[60,60],"drawn":false},{"_id":"ADFiCRJrC1Cdd7WW","flags":{},"type":0,"text":"Three goblins arguing over who is taller. They will run into the nearby forest as soon as they spot the PCs.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[61,61],"drawn":false},{"_id":"COrQXFJDdrpJBczj","flags":{},"type":0,"text":"friendly merchant has lost some textbooks that he was planning on donating to an orphanage. He rewards the party for returning them. u/Moostcho","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[62,62],"drawn":false},{"_id":"BNrUmDhe3DlZUIfn","flags":{},"type":0,"text":"A diseased man staggers towards the party, coughing and spluttering. He unintentionally infects some of the party members and begs to be cured. If cured, he presents the party with a large reward.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[63,63],"drawn":false},{"_id":"3wVmLfajrCK2ek7C","flags":{},"type":0,"text":"A lightning bolt comes out of nowhere to strike the ground directly in front of the party.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[64,64],"drawn":false},{"_id":"3XX9uSCOrQPDusyT","flags":{},"type":0,"text":"The party comes across a fast running stream. Wooden debris and a fallen tree can be seen in the bank. A DC 12 wisdom (insight) check reveals that a recent heavy rainstorm caused the river to swell up and wash away the bridge. A character can swim across it with a successful dc 17 athletics check. If they fail, they must succeed on a dc 16 strength saving throw or be called get on the current. u/anb130","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[65,65],"drawn":false},{"_id":"IkrTaVVGVUX0JBqq","flags":{},"type":0,"text":"A person playing bagpipes. Nothing more nothing less but surely your players will be mega suspicious and maybe even hostile, see where it goes u/MuttonChopViking","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[66,66],"drawn":false},{"_id":"SVdE2ex58FSxcOhK","flags":{},"type":0,"text":"The party notices several statues in the path around a traveling wagon. As they approach closer they notice some of the statues are in poses with expressions of fear. A basilisk, cockatrice or any other appropriate monster to the parties level is feasting on one of the victims in the bushes just off the path. Since it is preoccupied and full, the party can easily pass it unmolested unless they decide to attack it. u/GreenWammingo","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[67,67],"drawn":false},{"_id":"7oV2yuKJq97uqT2R","flags":{},"type":0,"text":"A heavily armed adventurer is laying in a pool of their own blood and will bleed to death if they are not aided, they are so far gone they will only mumble that \"I can't... die like this...\". If the party manages to heal them. they will thank the party will tell the party that they were climbing a nearby tree when they fell and were impaled straight through on its branches, the wound was so bad their healing potion couldn't even stop the bleeding. Them managed to drag themselves to the road and are incredible thankful to the party, and will gift a magical item as a reward and will gladly be looking to return the favour. If they die they have several magical items on their person.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[68,68],"drawn":false},{"_id":"eXraPUn5KoA8v1T7","flags":{},"type":0,"text":"A frantic traveler runs to the party after he pauses and catches his breath he explains his friend was picked up and carried off by several harpies and points the party in the right direction. the party doesn't have to travel far as the harpies didn't make it back to their roost before they began to argue leaving their captive stranded on the roof of an abandoned barn as they argue atop some nearby trees. The party can rescue the captive from the roof if they are sneaky if they don't think they can win a fight against all the harpies.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[69,69],"drawn":false},{"_id":"c4y34u4bZ07EPnlQ","flags":{},"type":0,"text":"A siren calls out to the party as she has questions on \"Civil folk\". She loves a man in a fishing village just up the road on the parties route. She wants to \"be with him forever\" and is asking on what a man from civilization can't be without for when she whisks him away. Its very clear the fisherman does not even know of her existence as she has never approached him before. If the party meets the man when they pass through the village he is already married. If the party confronts the siren she states that \"My love is true and eternal, I definitely deserve to be with him more.\" and makes it clear she is going to go with her plan to kidnap the man to be with her.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[70,70],"drawn":false},{"_id":"MXFvYC2PrIxY0G62","flags":{},"type":0,"text":"Fey creatures are having a party with drinks and food and welcome any travelers to join in the revelry! After the party joins the fey welcome them to drinking contests and games of skill and promise that every win earns them some gold. However if they loose they have to give the fey something or suffer a curse, (up to the GM on what that is and how sinister the fey are, they might not mention the punishment on a loose until one of the party members looses).","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[71,71],"drawn":false},{"_id":"3m1vA9g9cMlbIl8T","flags":{},"type":0,"text":"A lone barbarian armed with a greatbow stands atop an abandoned watchtower near a narrow pass that the party will have to go through if they don't want to waste time. He shouts down at them they must pay his toll or die. Why does he think he can enforce a toll against a party of armed and powerful adventurers? Cause he has two tamed Wyverns.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[72,72],"drawn":false},{"_id":"OEDMkB01DLPxoQCD","flags":{},"type":0,"text":"As the sun is beginning to set a ghost appears on the road, and points off into the forest. If the party follow the ghost it leads them deep into the forest to its long dead body wishing to have its remains put to rest. If the party takes anything from the body the ghost will attack.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[73,73],"drawn":false},{"_id":"RFSEERhHWAxGNqUS","flags":{},"type":0,"text":"The party hears a lot of hounds barking before they round the next turn in the road. On making the turn they see an isolated farm with an elderly couple sitting on a bench on the side of the road surrounded by several large dogs. On a word from the woman the dogs go silent and sit patiently. She is selling her hounds for 200gp each. They are very well trained beasts with stats far above those of other dogs with an amazing perception unaffected by sleep or being unconscious. If the dog is rendered unconscious from a magical sleeping spell it cant wake up from it will still bark and growl when it senses danger.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[74,74],"drawn":false},{"_id":"aIEYCQLoqAV3InbE","flags":{},"type":0,"text":"As the party sets up camp a ghost riding a phantom horse and armed with a whip approaches the camp its voice on the wind says \"GO!... we can not stop... it is not safe.\" If the party is knowledgeable enough they will recognise that the ghost is an ancient military officer. As long as the party continues on the road even if they are going slow the ghost will follow behind appeased, if someone stops it will whip them to get them moving. The ghost will march them all night till morning where it will say \"We made it... we are safe... they are far enough behind.\" and vanish. The ghost was part of a military troop that was ambushed and killed in the night by orcs following them which is why the ghost drives travellers through the night instead of letting them rest, even if there is no danger anymore.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[75,75],"drawn":false},{"_id":"6GDr7GHps3oqE5iO","flags":{},"type":0,"text":"The party spots a baby moose (elephant, bear, hippo whatever suits the environment) on the road only for a split second later Angry Moma comes blitzing into them from the flank.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[76,76],"drawn":false},{"_id":"lE2x9Gz5xjPekYs8","flags":{},"type":0,"text":"8 battered and bleeding kobolds, 6 are carrying a long pole with a dead boar tied to it. 2 are carrying an unconscious kobold who is gravely wounded. u/SteelCutter","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[77,77],"drawn":false},{"_id":"e4amk5O2X1nQLqC6","flags":{},"type":0,"text":"The party stumbles onto a group of weak humanoid creatures (goblins, kobolds) that have ransacked a covered wagon. Empty bottles are strewn about the road, and the creatures are double in size (essentially they chugged a bunch of potions that cast Enlarge on them -- adjust the power of the creatures as needed). u/fudsaf","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[78,78],"drawn":false},{"_id":"uOLT1OP3xLrZfrqn","flags":{},"type":0,"text":"A fish falls from the sky. (In reality a predatory bird caught it and dropped it while overhead.) u/Greezlestack","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[79,79],"drawn":false},{"_id":"IwGnwS8XIIRVDVei","flags":{},"type":0,"text":"In a similar fashion, there is a side quest in The Witcher 3 in which you find a stone quarry where the miners believe they have been victims of a curse. The foreman pays you to investigate the cause of the commotion- a cow fell out of the sky and landed on a miner. u/MrMountainFace","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[80,80],"drawn":false},{"_id":"ss8RCGt54kTzIdDk","flags":{},"type":0,"text":"On a well-travelled road between two important town or cities, there is a large crater, seemingly caused by an explosion, and still smouldering. If the party are first to the scene, are they blamed for it? Otherwise, a crowd has already started to gather, and merchants are complaining this will delay them. What formed the crater, and will it strike again? u/Samlefomas","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[81,81],"drawn":false},{"_id":"1Epoljq51ghjs5jh","flags":{},"type":0,"text":"Large signs have been set up along a stretch of road that warn of impending danger, telling people to turn back. There have been no reports of danger, and if the party choose to turn back, they may find it was the work of teenage pranksters in the last town they passed.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[82,82],"drawn":false},{"_id":"JRIcHgdwxA8jAXXs","flags":{},"type":0,"text":"Two nearly-identical people are dueling in the road (choose how they fight). As the party approach, one delivers the coup de grace on their opponent, killing them. They tell the party that the opponent was their twin, who betrayed them. If the party try to arrest or kill them, they fight to the death, having been already injured, and die with a cry about the injustice of the world on their lips.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[83,83],"drawn":false},{"_id":"CmSHtOpe9N0SUf0l","flags":{},"type":0,"text":"The signs of a recent dragon attack mark a nearby village, with charred buildings, and citizens in a pitiful state. If the party stops to help, they are simply asked for money so the village can rebuild, and villagers will try to gently insist that they don't need any help, just cash. The 'villagers' are actually charlatans, and this is their latest, most elaborate ruse designed to fleece do-gooders.","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[84,84],"drawn":false},{"_id":"58YfsX8PFt4zofpt","flags":{},"type":0,"text":"One or several bulletes, depending on party level, attack, emerging from the ground. After the battle, or during, the party notice that these bulletes are constructs, not real. The source of these is a villainous artificer living in seclusion, who has begun to construct mechanical monstrosities to terrorise the surrounding land. Who knows what else they have in their workshop?","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[85,85],"drawn":false},{"_id":"69flLasleEERnaB4","flags":{},"type":0,"text":"A bunch of halfling children (no older than 10) are playing tag. They bump one of the PCs. Where’d your coin pouch go? One of them yells back to the PCs. “Hide and go seek and you’re it!” Then blows a raspberry u/sayer24","img":"icons/svg/d20-black.svg","resultId":"","weight":1,"range":[86,86],"drawn":false}],"formula":"1d86","replacement":false,"displayRoll":true}