{"_id":"QSe0hM6N9ktvkccz","name":"Swamp (Non-combat)","permission":{"default":0,"fKShf9sFzL9Lwpkr":3},"folder":"wDtmCVMK5xaNT2Wj","sort":400000,"flags":{},"img":"icons/svg/d20-grey.svg","description":"","results":[{"_id":"MsoR13BOnaOtzRVi","flags":{},"type":0,"text":"An obelisk rises from the muck and slime. It's white and beautiful. If and offering is laid here, a Black Dog will guide you through the swamp at night.","weight":1,"range":[1,1],"drawn":false},{"_id":"266d74Ip1v7mhCdh","flags":{},"type":0,"text":"A smoke demon is imprisoned in a cigarette, which is put in a random pack, which is found on whatever corpse the party searches next.","weight":1,"range":[2,2],"drawn":false},{"_id":"Aje5uuJ61KZOMc4T","flags":{},"type":0,"text":"A pack of cigarettes floats up to you. Followed by various other bits of wreckage. If followed it leads to a burning town filled with corpses.","weight":1,"range":[3,3],"drawn":false},{"_id":"XI78CjCiw1XKBL55","flags":{},"type":0,"text":"Cloaked creature made of bees mans a rowboat and will offer passage to anywhere, as long as you're undead. He offers to make you undead if you're not already.","weight":1,"range":[4,4],"drawn":false},{"_id":"nIsDmlTQwq8g8G4O","flags":{},"type":0,"text":"Pack of Hyenas led by a black imp. The hyenas are all polymorphed children and think it's fun to cause havoc.","weight":1,"range":[5,5],"drawn":false},{"_id":"Y4awNUnGDg8c624X","flags":{},"type":0,"text":"Swamp Dryads fight over the most attractive player. They will drown them if they can't reach a consensus.","weight":1,"range":[6,6],"drawn":false},{"_id":"u9JMaHFDgqok9ip6","flags":{},"type":0,"text":"The party encounters a very confused remorhaz trying to burrow into the ground desperately. It will rush to attack.","weight":1,"range":[7,7],"drawn":false},{"_id":"oBpHgU35At2Ae4lc","flags":{},"type":0,"text":"Hundreds of downed hot air balloons with no people around.","weight":1,"range":[8,8],"drawn":false},{"_id":"iRmZ4Ff8ZYYLYAFa","flags":{},"type":0,"text":"A sink hole. It looks like a drain plug has been pulled in the swamp and it will suck you in unless you do something about it.","weight":1,"range":[9,9],"drawn":false},{"_id":"5trQxYtu9ylA4suq","flags":{},"type":0,"text":"Burning caravan. A band of troops in black watch it burn with smiles on their faces.","weight":1,"range":[10,10],"drawn":false},{"_id":"s860lAH52ZcqdqbZ","flags":{},"type":0,"text":"Leafless trees hold evil spirits and cast oddly shaped shadows that sink into your shadow to control you.","weight":1,"range":[11,11],"drawn":false},{"_id":"xAmRU6NreKqChi3B","flags":{},"type":0,"text":"A sprung trap. No one has been caught in it and the footprints are fresh.","weight":1,"range":[12,12],"drawn":false},{"_id":"84Yl8dawlSfuEJx6","flags":{},"type":0,"text":"[[1d5+1]] women sinking in the mud, calling for help.","weight":1,"range":[13,13],"drawn":false},{"_id":"RD7Vnjt652fO0AL8","flags":{},"type":0,"text":"Explosive runes inscribed on crocodiles (or alligators, I don't know the difference). They rush you and clamp down on your leg and try to tear it off before they explode.","weight":1,"range":[14,14],"drawn":false},{"_id":"BCZ3qDD5hk8IBlre","flags":{},"type":0,"text":"A wand of wonder is found clutched in the hand of a dead paladin. It has [[1d4]] charge(s) left. Its a doozy.","weight":1,"range":[15,15],"drawn":false},{"_id":"dLCioI4D5BGRqkQP","flags":{},"type":0,"text":"The moon laughs at night here. A real gutbuster. If the party laughs too, it will draw Moon Spiders.","weight":1,"range":[16,16],"drawn":false},{"_id":"bMpP9lyjU3xG0t3s","flags":{},"type":0,"text":"Any fire that is lit in the swamp will bring an angry fat man dressed in a red bathroom and a funny looking hat. He screams at the party and hoses them down with swampwater, only to run off afterwards. If caught, he explains that its his job and to take it up with his Boss - A cranky Water Weird.","weight":1,"range":[17,17],"drawn":false},{"_id":"d0SpOx3SLNM2CXf4","flags":{},"type":0,"text":"A tent and bedroll are set up on a dry hillock. Food is cooking over a fire in a pot. There is firewood for the night, and a tapped keg of stout. This is the home of a ranger who got himself eaten by an alligator, and the campsite is mourning. Bad dreams will be had here.","weight":1,"range":[18,18],"drawn":false},{"_id":"mA5RtmY6VHyagmHO","flags":{},"type":0,"text":"A tobacco farmer offers the party free smokes and a chance to come with him to his place to meet his daughters and have some food. He plans to murder them and use the blood on his crops.","weight":1,"range":[19,19],"drawn":false},{"_id":"1rE0CeNyLiTcOv2W","flags":{},"type":0,"text":"Two hags are arguing over a human infant in a cage. The infant has bright blue eyes and looks quite plump.","weight":1,"range":[20,20],"drawn":false},{"_id":"BqWGofEyADpFhsjx","flags":{},"type":0,"text":"A pack of skeletons have had enough. They are on strike and will gladly point out the necromancer's lair for a smoke.","weight":1,"range":[21,21],"drawn":false},{"_id":"E4deGLzdGGIFzQnd","flags":{},"type":0,"text":"A thousand messages-in-bottles float past the party. They all contain the same message. 'To whoever finds this note - I have been imprisoned by my father who wishes me to marry against my will. Please please please please come and rescue me. I am in the tall tower of Swamp Castle.'","weight":1,"range":[22,22],"drawn":false},{"_id":"meW5q4UPEIhBfQlf","flags":{},"type":0,"text":"A fisherman is cursing and kicking an old rusted car stuck in the muck. It does not even have an engine, but the fisherman swears he can get it running, if the party agrees to help. If they don't, he curses them and later the party will nearly be run over by the man hanging out the door, laughing and shaking his fist.","weight":1,"range":[23,23],"drawn":false},{"_id":"0qsTkybkc8YgTB7K","flags":{},"type":0,"text":"A large church organ hangs from a tree, deflated like a balloon. It is the home of a Sussurus.","weight":1,"range":[24,24],"drawn":false},{"_id":"GI1MHndQSm7kwJJ7","flags":{},"type":0,"text":"Swamp Stirge boil from an old cauldron at sunset and hunt in their uncounted hundreds. Its mating season.","weight":1,"range":[25,25],"drawn":false},{"_id":"LASKBVyfP1nJ6DH1","flags":{},"type":0,"text":"A Froghemoth fishes for frogs in the mist. It will flee if confronted, but will return in ambush. If it is approached with food, it could serve as an ally for a short time.","weight":1,"range":[26,26],"drawn":false},{"_id":"F6IK5hI0BVwckiJa","flags":{},"type":0,"text":"A baby doll calls for its mama. It can never be found.","weight":1,"range":[27,27],"drawn":false},{"_id":"9Ou35Cx6T1BtyO1O","flags":{},"type":0,"text":"A swarm of rusted spoons darts among the trees. It is very hungry and can smell utensils up to [[1d10*10]] feet away.","weight":1,"range":[28,28],"drawn":false},{"_id":"GOjrNWDWxSeeBYzy","flags":{},"type":0,"text":"A broken spelljammer ship is found.","weight":1,"range":[29,29],"drawn":false},{"_id":"bV4ki8ZaM5LbWUe8","flags":{},"type":0,"text":"A house sits underwater, smoke rising from its chimney, fresh flowers in its window pots. If the door is knocked on, the house startles, and swims away. If broken into, the house will allow up to 12 people to live there indefinitely.","weight":1,"range":[30,30],"drawn":false},{"_id":"mc6HMFqlKIUjns8K","flags":{},"type":0,"text":"A donkey that can never be caught, and brays with laughter as it leads the party into trap after trap.","weight":1,"range":[31,31],"drawn":false},{"_id":"Rs2TD3LS2S2iviZD","flags":{},"type":0,"text":"A black dragon lands and demands to be told a joke.","weight":1,"range":[32,32],"drawn":false},{"_id":"pJAcXcb6XPJczgSu","flags":{},"type":0,"text":"A hangman's tree, filled with corpses, knows a secret. It will trade it for a fresh corpse added to the tree's branches.","weight":1,"range":[33,33],"drawn":false},{"_id":"DVQZuvWeFst3jLgn","flags":{},"type":0,"text":"A cage of bones offers protection if the party brings it the head of the local Fog Giant","weight":1,"range":[34,34],"drawn":false},{"_id":"QAwypzWGAwPZNgKQ","flags":{},"type":0,"text":"a woman is crying and shrieking for her child. she begs the party for help. The woman has no child.","weight":1,"range":[35,35],"drawn":false},{"_id":"icLCMI67R1Pnj50W","flags":{},"type":0,"text":"A finger of quartz sticks out of the muck at an angle. Inscribed upon are runes of a dead language. If transcribed correctly, they tell a dirty joke, if not, the reader is cursed","weight":1,"range":[36,36],"drawn":false},{"_id":"s5j2ziVliQ2Btfxm","flags":{},"type":0,"text":"The fresh carcasses of 100 crows. A half-sized halfling is scrabbling among them, eating their eyes. If surprised, it will flee. If not, it will first negotiate and then demand the party give up an eye each (so hungry)","weight":1,"range":[37,37],"drawn":false},{"_id":"i6X1waNEXjghVy8h","flags":{},"type":0,"text":"Baba Yaga's Hut (or a reasonable facsimile) is being chased by a murderous hunter's cabin. The Witch (or hag) is trapped inside somewhere, and will bargain for her freedom - [[1d20]] on an even number, she keeps her word to reward the party.","weight":1,"range":[38,38],"drawn":false},{"_id":"G4JdsQDCZSM6gYd9","flags":{},"type":0,"text":"Trees that forget they are trees and go walkabout until they remember, and are rooted again","weight":1,"range":[39,39],"drawn":false},{"_id":"s5kJNkg1QUEpdfBM","flags":{},"type":0,"text":"Awakened mud that babbles nonsense and sometimes prophecy","weight":1,"range":[40,40],"drawn":false},{"_id":"BqCw8Qk6hWPNxPFh","flags":{},"type":0,"text":"Clouds of black flies that spell out the next day's weather","weight":1,"range":[41,41],"drawn":false},{"_id":"8rJzSS5qvuqQqN8e","flags":{},"type":0,"text":"A catoblepas stalks the party with a [[1d20+6]] Dexterity (Stealth) check. It will attack someone if they stray more than 10 feet from the group. Otherwise, it will get bored and leave after 10-60 minutes.","weight":1,"range":[42,42],"drawn":false},{"_id":"NfSMYhHIHdnAdSSN","flags":{},"type":0,"text":"A bulette is attempting to knock down a hangman's tree which holds several corpses. Dinner!","weight":1,"range":[43,43],"drawn":false},{"_id":"3vWW2vB4pFAr0ch9","flags":{},"type":0,"text":"A cave entrance looms. A sign in infernal warns that Juiblex resides within. If the party is foolish enough to venture into the cave, they are 5% likely to encounter him and 95% likely to encounter [[1d3]] ochre jellies.","weight":1,"range":[44,44],"drawn":false},{"_id":"lavhNxc8Z03ZyxGb","flags":{},"type":0,"text":"A monthly event. On this night algae will bloom, and entire clouds will go up into the sky bathing in the moonlight. They release potent chemicals and together they form a thick pasty greenish fog. Anything not at least 15 ft. of the ground or locked in a closed environment is poisoned severely by it, causing WIS damage.","weight":1,"range":[45,45],"drawn":false},{"_id":"CHUu46sgryKZAeG1","flags":{},"type":0,"text":"A stone giant with his back to you strikes a beholder, revealing it to be a gas spore. The subsequent explosion kills him.","weight":1,"range":[46,46],"drawn":false},{"_id":"JXig6E1VZgASUo0I","flags":{},"type":0,"text":"A pool of water is covered with a variety of an aquatic green slime. If it is burned away, the glint of a necklace can be seen at the bottom. The water is drinkable.","weight":1,"range":[47,47],"drawn":false},{"_id":"FLu24smyfDN9v9uG","flags":{},"type":0,"text":"A dark dirty a blackened heart can be found still beating thrown in a bush on the path side. It is definitely humanoid. When you hold onto it for a day it will switch with your heart, and your clean pristine heart will be in your hands. You now have the heart of X, which will mess you up in 3 ways emotionally, mentally, and physically.","weight":1,"range":[48,48],"drawn":false},{"_id":"HzJMLB1HzdsJUctR","flags":{},"type":0,"text":"A gorgon charges the party. Suddenly, the ground opens beneath it and it is snapped up. There is no evidence of the monster's demise if the party approaches and examines the ground.","weight":1,"range":[49,49],"drawn":false},{"_id":"SRL5TwwwKrx0I4Ig","flags":{},"type":0,"text":"Entire clouds of gnats that swirl and wave about the swamp. Being in one doesn't deal damage, instead it deals levels of exhaustion.","weight":1,"range":[50,50],"drawn":false},{"_id":"I6s1W39wwwvzRL1Y","flags":{},"type":0,"text":"The party comes across a staff stuck into the ground. It is surrounded by a gelatinous cube with an invisibility spell cast on it. It is a magical staff of a random variety.","weight":1,"range":[51,51],"drawn":false},{"_id":"0fSdbASVyWw9cgFC","flags":{},"type":0,"text":"A bolt of screaming purple energy strikes a party member at random, dealing [[2d12]] damage if a DC 12 Dexterity save is failed.","weight":1,"range":[52,52],"drawn":false},{"_id":"kS9NoAIBlmvUD2P2","flags":{},"type":0,"text":"A headless hag is shambling about throwing curses and spells at anything that it stumbles into or is touched by. It has a black aura that is tangible and will deal CON damage when within 5 ft. It seems angry and looking for something.","weight":1,"range":[53,53],"drawn":false},{"_id":"KilcUJlDtrY7Tflp","flags":{},"type":0,"text":"Another encounter related to it can be the elder peasants in a smaller village that are keep her head in a locked box full of dirt.","weight":1,"range":[54,54],"drawn":false},{"_id":"lyr50eV5qW93hHGO","flags":{},"type":0,"text":"A night hag leaps from a pool of black water, lashing out at a random party member. If it hits, it will attempt to drag that character into the water. If it succeeds, the character will contract one disease at random. It will then vanish.","weight":1,"range":[55,55],"drawn":false},{"_id":"eqqhUvdC6owsAFaX","flags":{},"type":0,"text":"There is a body, or more like a carcass, of a giant beast. It is still rotting in places, but most of it is just dried skin and bones. Inside of it lives a Godling (halfling with gigantic eyes), which behaves childish. You have to offer three items to it for it to bless you, if you harm it, it will curse your still-living-bones.","weight":1,"range":[56,56],"drawn":false},{"_id":"Vmajj9c9YXadtnUD","flags":{},"type":0,"text":"[[1d6]] perytons are locked in combat with [[1d6]] pegasi. The aerial battle ends after five turns. The winners swoop down and engage the party in conversation.","weight":1,"range":[57,57],"drawn":false},{"_id":"FG8oPDLbtplX6C5a","flags":{},"type":0,"text":"A roc can be seen overhead, carrying a whole purple worm which flails desperately, trying to escape. The worm breaks free on a 20 ([[1d20]]) and will fall within [[1d10*10]] feet of the party and attack.","weight":1,"range":[58,58],"drawn":false},{"_id":"5UhtWPNk5cqVDDWL","flags":{},"type":0,"text":"A character relieves himself away from the party, only to find that the mound he is peeing on is actually of the shambling variety. It is 70% likely to attack.","weight":1,"range":[59,59],"drawn":false},{"_id":"FfsnJWBlQFZqjmMm","flags":{},"type":0,"text":"The scream of a banshee can be heard. It is relatively close. If the party runs to the source, they find the bodies of six trolls.","weight":1,"range":[60,60],"drawn":false},{"_id":"mYiq0f67hNBzyHOP","flags":{},"type":0,"text":"Nearly a dozen dolmens are scattered throughout the swamp. People rumour them to be connected, or access points to the City of the Drowned.","weight":1,"range":[61,61],"drawn":false},{"_id":"f1GogiNoV3pkBCCP","flags":{},"type":0,"text":"A small dilapidated cabin with the roof caved in contains a false sphere of annihilation. It is actually the corpse of a will o'wisp who died of natural causes.","weight":1,"range":[62,62],"drawn":false},{"_id":"iEBXHG6ZyVnOSkrO","flags":{},"type":0,"text":"Dire Lampreys hide in the murky water, wells, ponds, and rivers. If they bite and latch on to you roll against [[1d3]] diseases. They are about two meters long and strong as an ox.","weight":1,"range":[63,63],"drawn":false},{"_id":"Z1Xm3AdXwKDFtmsC","flags":{},"type":0,"text":"The party encounters a thick bank of fog that persists for 40 minutes. Should they choose to enter, they will encounter a mist dragon. If the yare friendly, the mist dragon will offer help, if they are not, it will demand tribute.","weight":1,"range":[64,64],"drawn":false},{"_id":"P4SSkbBMmGKw2rY4","flags":{},"type":0,"text":"Large wingless dark swans. They are very aggressive, hunt one and the flock will rush you.","weight":1,"range":[65,65],"drawn":false},{"_id":"89w0I1BlpEoEeTZx","flags":{},"type":0,"text":"Three Sons of Kyuss charge the party. They will turn and flee if they see a gnome. Otherwise, they will fight to the death.","weight":1,"range":[66,66],"drawn":false},{"_id":"2s3xkqLNPegj0mNR","flags":{},"type":0,"text":"A stunjelly lies against a broken section of cobblestone wall that was once a cabin. Caught in it are two drow. They will perish in four turns.","weight":1,"range":[67,67],"drawn":false},{"_id":"5RPKAyUSkVJGClog","flags":{},"type":0,"text":"A flask with a potion lies in the grass, spotted by one random party member. Living inside it is a throat leech.","weight":1,"range":[68,68],"drawn":false},{"_id":"p2pDrE4tYsG11wEW","flags":{},"type":0,"text":"A yellow musk creeper grows in front of the party. In the center, the glint of a skull with gems for eyes and teeth can be seen. The demi-lich is being suppressed by intelligence sucking nature of the plant, and will not activate so long as the plant is alive.","weight":1,"range":[69,69],"drawn":false},{"_id":"LNCIHr7EwItJUyOX","flags":{},"type":0,"text":"An achaierai lashes out desperately against thin air. If it sees the party it will insanely attack for two turns and then flee, defecating on the run. If its droppings are examined, the glint of a ring can be seen.","weight":1,"range":[70,70],"drawn":false},{"_id":"xRpmGzMl5X4LwTtG","flags":{},"type":0,"text":"A swarm of blood hawks can be seen flying overhead. They will swoop if they see the glint of an exposed gem.","weight":1,"range":[71,71],"drawn":false},{"_id":"2RR5Mc4uQZMIZqpt","flags":{},"type":0,"text":"A carbuncle is caught in a patch of grab grass. It will surrender its gem to anyone who frees it without injuring it and feeds it.","weight":1,"range":[72,72],"drawn":false},{"_id":"RB5AUDkjJRsOAJ2d","flags":{},"type":0,"text":"A cifal stalks the party, waiting for the perfect opportunity to strike. It will charge an elf if the party has one, otherwise it will leave.","weight":1,"range":[73,73],"drawn":false},{"_id":"b8iRHPERrZLM05kT","flags":{},"type":0,"text":"A disenchanter has two of its front hooves against a tree, trying to reach a shield caught in the upper branches.","weight":1,"range":[74,74],"drawn":false},{"_id":"s9c5HkhxIeqTxIyc","flags":{},"type":0,"text":"The Eyeless Crows - A murder of crows who pecked their eyes out for some nut reason or another","weight":1,"range":[75,75],"drawn":false},{"_id":"aGxB0WJupKHlmHGA","flags":{},"type":0,"text":"The Rot - Something living deep within the murk and mud, it does nothing but slowly corrupt an already dead region.","weight":1,"range":[76,76],"drawn":false},{"_id":"7GJL0W46Red5UdFl","flags":{},"type":0,"text":"The Drowned - No one survives being completely submerged in the mud here. You know those shapes that sometimes blub up to the surface and seem to move on their own, floating nowhere. Those are the Drowned. Not many know, but these souls are still alive.. the swamp keeps them that way.. ever drowning, lungs full of muddy water. A faith with no purpose, and wished on noone.","weight":1,"range":[77,77],"drawn":false},{"_id":"RprejdgfNm7kxwXs","flags":{},"type":0,"text":"Reeds of the Damned - Entire patches of the swamps grow full of these lush green plants with their white wavy plumes. But every child knows to stay away, as these things grow not alone. Those who pay attention will see the movements within, as if creatures wade a way through it, some say ghost, others tricksters. Some people hear child's laughter, others the calls of loved ones, and some see nothing but the slow mesmerising waving of the white plumes. Waiting.","weight":1,"range":[78,78],"drawn":false},{"_id":"cFnpAUOzm5sY2VQw","flags":{},"type":0,"text":"Death's End - A pond can be found, lurking between reeds and lost patches of land. They say the place is the End, if you have ever seen it you would understand. A place so depressing, the air thick with dread. People always return there... On the last, only ripples remain.","weight":1,"range":[79,79],"drawn":false},{"_id":"wmgd9kAFfiOXphPt","flags":{},"type":0,"text":"A party of six adventurers fight a 20ft-tall goblin (same stats as a hill giant). As you watch, it strikes down one of them.","weight":1,"range":[80,80],"drawn":false},{"_id":"L0HgNjcEvdSlQL5r","flags":{},"type":0,"text":"A party of six adventurers fight a troll. As you watch, it strikes down one of them.","weight":1,"range":[81,81],"drawn":false},{"_id":"KoCCh5SxTKDJYkJd","flags":{},"type":0,"text":"You hear a scream that sounds so alien it gives you chills. It is very close.","weight":1,"range":[82,82],"drawn":false},{"_id":"L18gCoPPaxhMWiyY","flags":{},"type":0,"text":"You come across a wide and very deep ravine. About halfway down on the other side, you see the glint of a mineral deposit with the unmistakable luster of gold.","weight":1,"range":[83,83],"drawn":false},{"_id":"XmZYXlVXnvxDpRvq","flags":{},"type":0,"text":"Two friendly cloud giants laugh and play catch with a large chunk of platinum. They will surrender it if the party tells them an excellent story. If attacked, they will turn gaseous and flee.","weight":1,"range":[84,84],"drawn":false},{"_id":"K9dAecKPF5ri1qmX","flags":{},"type":0,"text":"A temple made of obsidian rises from a tar pit. If the party ventures within, they find an altar and a deactivated portal. It is guarded by a stone golem.","weight":1,"range":[85,85],"drawn":false},{"_id":"t9WQgZYz5QNooZ19","flags":{},"type":0,"text":"A small hole can be seen shortly in front of the party. It is bottomless. Anyone who falls or jumps in will fall for [[1d7]] days and nights to Tartarus.","weight":1,"range":[86,86],"drawn":false},{"_id":"MiqywwSfCpsqqrwx","flags":{},"type":0,"text":"The party comes across [[1d4]] crystals. They are crystal oozes lying dormant.","weight":1,"range":[87,87],"drawn":false},{"_id":"Svn0tRWLW2SBKbpu","flags":{},"type":0,"text":"The sun turns purple and black, showering the party with ugly light. It is a localized effect. It will empower the monsters next encountered by the party significantly.","weight":1,"range":[88,88],"drawn":false},{"_id":"GhiMBFafdOj6yhsu","flags":{},"type":0,"text":"The party encounters a massive oak, twisted and gnarled. Strange black growths cover it, creating thornlike appendages which seem to move. The body of a paladin, complete with a sword, shield, and shining armor can be seen caught far up in the branches. If the party actually touches any of the black growths, they will begin to be consumed by an alien parasite that will eventually turn them into quasi zombies if a DC 10 Constitution saving throw is failed and nothing further is done. After 6 seconds, they must make another DC 10 Constution saving throw, less they become a zombie.","weight":1,"range":[89,89],"drawn":false},{"_id":"EiHMLs15zoU5sPmW","flags":{},"type":0,"text":"An arrow hits a nearby tree with a loud crunch. It has a scroll tied to the shaft. It is a cursed scroll that causes anyone who reads it to turn into water if a DC 10 Wisdom saving throw is failed.","weight":1,"range":[90,90],"drawn":false},{"_id":"HnCVFQEvZgDKPHh9","flags":{},"type":0,"text":"The lead party member finds himself/herself sinking in tar. As soon as they sink to their waist, they will stop, feeling something solid beneath their boots. It is the skull of a tarrasque.","weight":1,"range":[91,91],"drawn":false},{"_id":"2yhyVofJFc1xVTLq","flags":{},"type":0,"text":"The party discovers a patch of raised dry land. The bodies of [[1d4]] adventurers can be seen. A pile of 3 magical items, gold, and gems, seemingly discarded, can be seen at the front of the tree. (Each must be able to survive acid) It is a hangman’s tree, and inside it lives a banshee. The hangman’s tree is active during the day, the banshee at night.","weight":1,"range":[92,92],"drawn":false},{"_id":"WIyun6ess9yPNTXj","flags":{},"type":0,"text":"One of the party is lassoed by a flying goliath. DC 20 Dexterity saving throw. He will carry them and drop them [[1d100*10]] feet away where they will land in a random encounter, taking [[3d6]] falling damage as well.","weight":1,"range":[93,93],"drawn":false},{"_id":"qivMjVGkv1VMZUV4","flags":{},"type":0,"text":"Magical swamp gas surrounds the party, clinging to them. It is invisible and intangible in every way unless a detect magic spell is used. If anyone in the party uses magic of any kind, it will explode, causing a [[1d100]] and [[1d100]] random magical effects from the wild surge table and [[1d10]] damage to everyone in the party. The gas will dissipate after two hours.","weight":1,"range":[94,94],"drawn":false},{"_id":"8IDhdK3aBBlHd7tB","flags":{},"type":0,"text":"A herbalist within the party notices a type of highly valuable magical herb that can be used to regrow lost limbs and regenerate hit points on a raised hill. Every 10 mins the party spends gathering it, it will be 10% more likely to waken the magically dormant dragon turtle. There is enough for [[3d6]] uses, but it will take [[1d10*10]] minutes to gather. Ignore this encounter if the party does not have anyone proficient in herbalism.","weight":1,"range":[95,95],"drawn":false},{"_id":"2wudmAFWxTLvqDry","flags":{},"type":0,"text":"A geyser erupts [[1d90+10]] feet away, spraying the party with swamp muck. The closer it is, the dirtier they get.","weight":1,"range":[96,96],"drawn":false},{"_id":"yUDb4FjRQGLRbc4R","flags":{},"type":0,"text":"The party enters a section of swamp which has a quarter of Earth’s normal gravity.","weight":1,"range":[97,97],"drawn":false},{"_id":"mmKwtny4vjZTibPB","flags":{},"type":0,"text":"Party finds [[1d4+2]] blueberry plants with fist-sized blueberries. If they are eaten, they taste delicious and heal [[1d8]]+2 hit points. There are [[1d6]] blueberries per plant, but they expire if they are not eaten within a day. A character may only benefit from one blueberry per day.","weight":1,"range":[98,98],"drawn":false},{"_id":"UYcJpkmrKBp99wcX","flags":{},"type":0,"text":"Party encounters a locked chest with [[2d6]] padlocks clamping it tightly shut. Inside is a single gilded tome made of obsidian and concentrated negative energy. If it is tightly grasped, the holder can hear tantalizing whispers of knowledge and power but also great danger. If even a single word within is read, the caster’s INT and WIS rise to 19, or two points each if they are at or above this value. In addition, he or she must succeed a con or wis save at - 3 or become totally insane, as the book’s contents are not meant for mortal eyes. It disappears after one person reads it along with the chest. Either way, a Dark Inquisitor will come to claim the bearer of forbidden knowledge at some point in the future.","weight":1,"range":[99,99],"drawn":false},{"_id":"jDx6Ikj9fivi3rGk","flags":{},"type":0,"text":"Two encounters are rolled at once, handle accordingly.","weight":1,"range":[100,100],"drawn":false}],"formula":"1d100","replacement":true,"displayRoll":true}