{"_id":"IcGbkcdifBBHmgNK","name":"Underdark (Non-combat)","permission":{"default":0,"fKShf9sFzL9Lwpkr":3},"folder":"AUEW51vaDmeAP7jI","sort":500000,"flags":{},"img":"icons/svg/d20-grey.svg","description":"","results":[{"_id":"2P8unzrIt0wCTgm1","flags":{},"type":0,"text":"As the party makes their way through a tight, winding tunnel, they are ambushed by a Bulette (If above level 10, add an extra Bulette). By /u/ElFontana94","weight":1,"range":[1,1],"drawn":false},{"_id":"t6QCOlC9fAGGUMb8","flags":{},"type":0,"text":"The party emerges into a spacious cavern, its walls glistening with gems. Inside a lone, wounded Svirfnebli prospector huddles tight to a sack of precious stones, refusing to part with them under any circumstance. By /u/ElFontana94","weight":1,"range":[2,2],"drawn":false},{"_id":"Y5l0v11dEGOfzxQf","flags":{},"type":0,"text":"As the party ventures through a particularly damp passage, the ground underfoot collapses into a 30-foot deep sinkhole, have the party roll a DC13 Dexterity saving throw or take 3d6 Bludgeon Damage, with a critical failure leading to the character breaking a leg. By /u/ElFontana94","weight":1,"range":[3,3],"drawn":false},{"_id":"9elbNsUrn7CRF6g8","flags":{},"type":0,"text":"The party enter into a wide-spanning cavern filled with stalagmites and stalactites, water drips in the distance. A patrol of Drow moves stealthily in the darkness, if they detect the party they engage at range, with the intent to incapacitate and enslave the party. By /u/ElFontana94","weight":1,"range":[4,4],"drawn":false},{"_id":"34snRaIppTGkXiiE","flags":{},"type":0,"text":"The cavern passage ahead opens up into a chamber, in front of the party lies a tower of jet black stone, rising into the ceiling. It's interior has been completely ransacked with signs of combat (magical in nature) occurring some weeks before. All the party can find is a few materials in what might have been an alchemy chamber(enough to scramble together a components pouch) and 1d6-1 trinkets scattered around (roll on the trinkets table or one the awesome ones you can find on this Reddit ;) ) By /u/ElFontana94","weight":1,"range":[5,5],"drawn":false},{"_id":"5dRFRpstZDEAUC5y","flags":{},"type":0,"text":"A set of rails into a mine is discovered with a minecart on them. The cart is full of ore with some silver veins running through it. Sorting through the ore would take one pc an hour to do so, less time the more who help. This cart is actually a crafty mimic. It waits till at least two people are touching it before grappling. As soon as it has at least one held the mimic launches down the tracks pulling its prey after. Fortunately for any left behind, there is a real minecart they can put on the tracks to chase them. By /u/NeoBlue42","weight":1,"range":[6,6],"drawn":false},{"_id":"l9pOObinm47Xd9K0","flags":{},"type":0,"text":"You run into a group of children who got lost playing 'explorer'. By /u/FlannelViolin","weight":1,"range":[7,7],"drawn":false},{"_id":"qNnpc9m3KTbIu1lF","flags":{},"type":0,"text":"The party is making their way down a long and winding cavern passage when a stampede of small Underdark creatures as well as a few hook horrors rush past the players in the same direction that they're going. The reason for their terror becomes clear when a literal flood of Black Pudding crashes around the previous bend and begins rapidly making its way down the tunnel. At this point, the party enters a skill challenge, in which the goal is to outrun and somehow survive the oncoming deluge of ooze. Strength and Dexterity saving throws will be required to deal with the rocky obstacles filling the passageway and avoid the reaching pseudopods of the Black Pudding. Wisdom saving throws will also be needed when the passageway eventually splits off into separate paths of differing difficulties, which will happen at least once. After the party has successfully made a number of skill checks and saving throws appropriate to the size of the party, they will come across a large alcove in the cave wall that will hold the party safely out of reach until the Black Pudding passes by. Soon afterwards, it will flow down a passage leading even deeper into the earthy depths, leaving the surrounding passageways almost entirely devoid of life. By /u/ThePragmaticPimp","weight":1,"range":[8,8],"drawn":false},{"_id":"9jRrxYccY0IhVNhj","flags":{},"type":0,"text":"The party encounters a deep pixie, an uncommon race of pixie that makes their home in the bowels of the Underdark. The pixie looks similar to a regular pixie, though the bright blue colouring and large, completely black eyes are still quite distinctive. The stat block for a deep pixie is identical to that of a regular pixie with the addition of darkvision out to 60 feet and the ability to speak undercommon. The deep pixie will vanish immediately upon being seen and will spend the next few hours pulling pranks and gently harassing the party. If they put up with it good-naturedly, the pixie will eventually feel guilty and stop. The pixie will then reveal themselves once more and investigate the good intentions of the party before inviting the party back to a mushroom town of other deep pixies. There the pixies will ensure proper recompense for whatever trouble the original pixie caused. After a time of rest spent there, the deep pixies send the party on its way with a full stock of supplies and knowledge of some of the local cavern shortcuts. By /u/ThePragmaticPimp","weight":1,"range":[9,9],"drawn":false},{"_id":"MCmlkDJXHUKUbOLq","flags":{},"type":0,"text":"Cloakers in equal number to the party ambush the party. Any cloaker that misses its first attack leaves the battle and hides out of reach. Any cloaker below half HP or forcibly detached will disengage and fly away to hide. By /u/robot_wrangler","weight":1,"range":[10,10],"drawn":false},{"_id":"IJJvAnUJwP2qOI3e","flags":{},"type":0,"text":"The PCs stumble upon a small village that stretches along a ravine. If they inquire with the locals, they will find that the unfathomably dark chasm leads to a place they call \"The Underdepths\". The locals have to fight back horrible abyssal beasts every night, and each time it only gets worse. By /u/MysticMeow","weight":1,"range":[11,11],"drawn":false},{"_id":"orfzXU3oCc4pkk0B","flags":{},"type":0,"text":"The tunnel fills with an unexpected gust of wind smelling of warm earth and sulphur. The air grows warm while the player's feet grow chilled. Any character who stays standing must save make a DC 12 CON save each round or become poisoned by the gasses for as long as they are standing and one minute afterwards. Fail by 5 or more and the player begins to asphyxiate per the drowning rules. Meanwhile, several swarms of displaced insects crawl just beneath the gasses and attack all. The event last two minutes. By /u/NeoBlue42","weight":1,"range":[12,12],"drawn":false},{"_id":"3aL9RNiy5HPFodXZ","flags":{},"type":0,"text":"The party hears the clinking of hammers and pickaxes. Down a narrow corridor sits (d6-20, depends on level) duergar or dwarves. These poor souls have been cursed to mine the same section of rock for eternity. They look exhausted and will not interact with the party. If any of them are forcibly stopped from mining, they will attack the party. Any dwarves or duergar killed in this encounter will return in 24 hours and start mining. These creatures will appear to have made progress in the cavern over time but they have actually mined nothing. By /u/worriedblowfish","weight":1,"range":[13,13],"drawn":false},{"_id":"ZCZtsEXhyKqjtUp8","flags":{},"type":0,"text":"As the party travels down a tunnel the ground begins to violently shake, seconds later a giant purple worm crashes through the tunnel in front of the party. It seems to be in a hurry and takes no notice of the party, leaving a new 10ft tunnel behind it. (Roll again to see what is on either side of the new tunnel). By /u/TreeFeler","weight":1,"range":[14,14],"drawn":false},{"_id":"TXn5KPh2B6w3K1nj","flags":{},"type":0,"text":"The party enters a room and each of the four walls is painted with a mural representing a different season. In the middle of the room is a small patch of dirt. Buried in the dirt is a seed (don't tell them this part unless they dig it up). The players need to replicate each season in order. How they do so is pretty open ended, so there's no \"You didn't do the exact thing, so it doesn't work.\" nonsense. As they correctly match each season, the paintings on the wall will light up and the room will physically change to match. The order for the correct solution is this: Spring: Rain. Party needs to pour some kind of liquid in the dirt. Water from canteens, prestidigitation, even taking a leak in the dirt would work. When completed, a small sprout will grow up from the dirt. Summer: Sun. Part needs to make any kind of light or heat. A daylight spell, firebolt (not cast directly at the plant), or lighting a torch would work. When completed, the sprout will grow into a miniature tree. Autumn: Wind. Party has to make some sort of air flow, even blowing at the tree would be acceptable. When completed, the leaves blow off the tree and it is bare. Winter: Snow. Any kind of cold magic will work, or any way to reduce the temperature around the tree. When completed a small cloud will form over the tree and snow and ice will cover it. After that, the doors to the room open, allowing the party to progress. By /u/SkrewtapeSecretary","weight":1,"range":[15,15],"drawn":false},{"_id":"4gRsMk09B9UIknKU","flags":{},"type":0,"text":"The cavern the party is traversing into opens up into a 15-foot wide ledge overlooking a Lava tube 5 feet below and 30 feet wide with another ledge of similar dimensions lying in parallel, the lava tube continues in either direction for some distance both ways. Roll a d6. On a roll of 1-2, 1 Salamander and 1d4+1 Fire Snakes lurk in the molten depths, waiting for the perfect opportunity to ambush the party. On a roll of 3-4, 1d8 Magma Mephits who fly along clumsily only attacking the party if shown hostility and quickly running away if attacked. On a roll of 5-6 lies a corpse on the edge of the other ledge half burnt to ashes clutching or wearing an uncommon magic item (of the DM's choice). By /u/ElFontana94","weight":1,"range":[16,16],"drawn":false},{"_id":"2B5dBqR3PfGN18CG","flags":{},"type":0,"text":"The party enters what appears to be an underground forest, where the canopy was so thick that it supported layers of sediment and eventually sunk beneath the surface of the world. Sickly dryads and militaristic pixie soldiers flit through the forest, defending their sunken forest against all comers. By /u/Silverdragon701","weight":1,"range":[17,17],"drawn":false},{"_id":"f4DbYBNNioibGFMK","flags":{},"type":0,"text":"The party chances upon a town built around an underground geyser that must erupt hundreds of miles overhead on the surface. Copper pipes run hot water and machinery is powered by the regular jets of water of the geyser-column. The town is populated by a variety of neutral Underdark denizens, from escaped Drow slaves and Svirfneblin tradesmen to a community of blind Merfolk who live in the town's hot springs. By /u/Silverdragon701","weight":1,"range":[18,18],"drawn":false},{"_id":"AU41kC0StNhKlScT","flags":{},"type":0,"text":"The tunnel the party is travelling down is lined with veins of gold, but no apparent mining operations have taken place. The bodies of many dwarves and kobolds are scattered about. Eventually, the party comes across the remains of an Ancient Red Dragon, half-sunken into a pool of gold ore. Without mining equipment, very little of the dragon's metallurgical horde can be taken. By /u/Silverdragon701","weight":1,"range":[19,19],"drawn":false},{"_id":"1pSJj52VFomIsjMl","flags":{},"type":0,"text":"The party happens upon a huge cavern that hosts the butchered remains of a battle between Duergar and Drow, a goldmine of non-magic weapons and armor are to be found but the party would need to contend with 1d6+2 Ghouls + 1d4-1 Ghasts (Add an extra dice to each per adventure tier) that are currently occupied with engorging the cadavers but will turn their attention to the party if they attempt to loot the corpses. By /u/ElFontana94","weight":1,"range":[20,20],"drawn":false},{"_id":"9ueBuHA282G6iFuS","flags":{},"type":0,"text":"A skinny man with very little clothes on runs past the party, murmuring words about some sort of quest or unfinished duties, even if the party kills him he will run past the group again the next day. He does not appear the day after. By /u/DragonBolt101","weight":1,"range":[21,21],"drawn":false},{"_id":"Jh3M51g4KEBt4Oha","flags":{},"type":0,"text":"The cavern the party is traversing collapses into one of the deepest parts of the Underdark, filled with creatures that have never seen actual daylight in their lives. They encounter an adorable little creature that makes cute noises. Predators hunted down these helpless creatures until only the one remained. After the party rescues the cute little guy, it takes a liking to them. It sings, it bites, it steals things...hey wait, this little guy is kind of mean. It complains when the party wants to sleep and eventually they feed it after midnight just to shut it up. The morning, the cute furry creature has turned into a sadistic Gremlin. By /u/Wolvenfire86","weight":1,"range":[22,22],"drawn":false},{"_id":"o8xty7JOlgOSxeYd","flags":{},"type":0,"text":"Parts of the floor beneath the party gives way, roll a DC 14 Dexterity saving throw. Those who fail fall 40 feet (taking 4d6 Bludgeon damage) into a cavern punctuated by fissures filled with a green fluorescent liquid. This liquid gives off a poisonous gas, roll initiative, every round the characters who fell into the cavern must make a DC 12 Constitution saving throw, taking 1d6 Poison damage on failure. Climbing up requires 2 DC 13 Acrobatics or Athletics checks (the players choice). By /u/Elfontana94","weight":1,"range":[23,23],"drawn":false},{"_id":"JKG2KGnId7POFQGm","flags":{},"type":0,"text":"The tunnel opens into a wide chamber filled with giant mushroom stalks planted in neat rows. The mushroom crops are tended by half a dozen elves who have been blinded and had their tongues cut out. They walk along the rows, feeling the stalks and plucking off insects. By /u/ParameciaAntic","weight":1,"range":[24,24],"drawn":false},{"_id":"KEYxXjeSy3I18LXW","flags":{},"type":0,"text":"The party enters a brightly-lit chamber. The walls and ceiling pulse with a cold, yellow light created by the tendrils of a fungus that grows throughout the room. By /u/ParameciaAntic","weight":1,"range":[25,25],"drawn":false},{"_id":"bkqtFMkspCaDxVXA","flags":{},"type":0,"text":"While exploring one of the caves you come across a group of women in rags and rusty manacles. They explain that they were followers of Selene and were thrown into an Underdark tunnel for accepting the teachings that Selene/Shar were aspects of the same goddess. By /u/KatanaKamikaze","weight":1,"range":[26,26],"drawn":false},{"_id":"ISXQPay4OWtekUNl","flags":{},"type":0,"text":"The party is lost. After a while, they come across a wizard with glowing sockets where his eyes should be. He tells you he has been in the Underdark for years and can tell you where to go as long as you take him with you. If you accept, he leads you into a group of Fomorians, who spare his life if he can bring them substitute victims for their torture/meals. Players will have to escape the Fomorians. If the players do not accept they have to fight the wizard. By /u/KatanaKamikaze By /u/KatanaKamikaze","weight":1,"range":[27,27],"drawn":false},{"_id":"RTNVLyQIHKqwfoiu","flags":{},"type":0,"text":"Flowing water has formed perfect slip-and-slide channels in a steep cavern. Not only are they fun and fast, riding them is actually safer than trying to climb down the regular way. One channel, due to a tight turn, will split the group in two based on weight/speed. By /u/CountofAccount","weight":1,"range":[28,28],"drawn":false},{"_id":"CD9WgSUV8SXplNz8","flags":{},"type":0,"text":"A giant spider captured a roving group of bandits and wrapped them up for later. One of the bound bandits killed the spider with a lucky dagger hit, but they are still all bound up and need rescue. If rescued, the bandits are grateful... but they intend to steal their rescuers' supplies and leg it at the first opportunity. By /u/CountofAccount","weight":1,"range":[29,29],"drawn":false},{"_id":"NBfQnRZC19hwcgx9","flags":{},"type":0,"text":"The tunnel opens up into an oasis of Underdark funghi, the area is dimly lit by bioluminescent funghi and filled to the brim with insects of various shapes and sizes. After a few minutes of travel the party finds a massive funghi seemingly grown into the shape of a house, inside they find an elderly drow druid who is the guardian of this fungal grove. He is very friendly, welcoming the party inside and offering them food and water in exchange for stories. He tells them about his past as a Drow soldier when one day his patrol was slaughtered by hook horrors leaving him as the only survivor. He barely escaped, stumbling into this grove after a day or so travel while bleeding profusely. The grove's previous guardian, a Shield/Mountain Dwarf, found him in a pool of his own blood and nursed him back to health, all the while teaching him the secrets of nature and the ways of druid. The drow renounced his ways, and aided the Dwarf in maintaining the grove for many years until the dwarf passed away due to old age. Now he provides rest and comfort to travellers in the Underdark. By /u/ElFontana94","weight":1,"range":[30,30],"drawn":false},{"_id":"XzBsl4OFQlG9PB6A","flags":{},"type":0,"text":"The party stumbles across the desiccated corpse of a Beholder atop a pedestal shaped stone, it's central eye and eyestalks have been removed. Nearby they find the entrance to a small beholder lair that has been nearly stripped bare (the party finds 2d6*20 gp, and 1d6 trinkets after 4 hours searching), the lair is filled with the corpses of kobolds and trolls. DC 13 Investigation or Insight reveals that an adventuring party must have snuffed out the beholder and looted the place bare. By /u/ElFontana94","weight":1,"range":[31,31],"drawn":false},{"_id":"I6LYkLGxCSXLKot0","flags":{},"type":0,"text":"The floor seems to move with thousands of miniature cave crabs that are swarming in an open tunnel. The tiny scavengers are picking over the bodies of several humanoids lying dead from wounds suffered in combat. Three duergar males appear to have numerous crossbow wounds and lightning bolt damage. Two drow, one male and one female, have been stabbed and cleaved with axes. The bodies have been stripped of valuables except for the drow female, who wears a silver locket in the shape of a spider. Otherwise, they only have their clothing. By /u/ParameciaAntic","weight":1,"range":[32,32],"drawn":false},{"_id":"6a4HqXr18B794Ssj","flags":{},"type":0,"text":"The bones of an enormous creature are embedded in the walls of the tunnel. Ribs and a massive skull of an animal that resembled a gigantic deer poke partially out of the stone. Each one of its teeth are the size of a man's fist. By /u/ParameciaAntic","weight":1,"range":[33,33],"drawn":false},{"_id":"tbFECwld8Lf8xME1","flags":{},"type":0,"text":"Someone has painted signs and arrows at a crossroads in the natural tunnel. Next to an arrow pointing to the left, it says in Dwarvish, \"DANGER TROLL STINK!\" Below that it reads in Gnomish, \"so do you!\" An arrow to the right says in Elvish, \"Bats of unusual size\". An arrow pointing down into a fissure says in Common, \"Final resting place of Sir Whelfrey\" with a holy symbol. An arrow pointing back in the direction the party came from reads in Common, \"To the surface\". By /u/ParameciaAntic","weight":1,"range":[34,34],"drawn":false},{"_id":"XpcfgGwtpap72hmc","flags":{},"type":0,"text":"The top part of the skull of a humanoid is resting in the middle of the tunnel. The tiny remains of a wick and blobs of wax from a melted candle flow over the bone. By /u/ParameciaAntic","weight":1,"range":[35,35],"drawn":false},{"_id":"2ngwPC8H8lbHWyfa","flags":{},"type":0,"text":"The party encounters a caravan of Svirfnebli gemstone traders trekking the gauntlet between two Underdark settlements, they are willing to sell their wares to the party but are unwilling to buy anything except for gemstones at under-market value. The caravan is heavily guarded in order to discourage bandits from attacking this most juicy target. By /u/ElFontana94","weight":1,"range":[36,36],"drawn":false},{"_id":"HXmGM8XJqTnRd6Lg","flags":{},"type":0,"text":"The party finds themselves in a wide tunnel, filled with stalagmites, stalactites and fissures. In the darkness a solitary Grell stalks the party, waiting for the opportunity to grapple a member of the party (ideally the squishiest) and disappearing into one of the fissures. By /u/ElFontana94","weight":1,"range":[37,37],"drawn":false},{"_id":"S92Ulpxes3X15Nrq","flags":{},"type":0,"text":"The tunnel ahead contains a trio of heavily intoxicated Shield Dwarves who've stumbled deep into the Underdark during their merriment. They have no clue how to get back to their dwarf hold. They still have a keg of ale but as soon as their alcohol finishes they will realize their predicament and panic.. By /u/ElFontana94","weight":1,"range":[38,38],"drawn":false},{"_id":"mSX5wE0yjFrhFklW","flags":{},"type":0,"text":"The party enters into an oval-shaped chamber bisected by a 10 foot wide, 100-foot deep ravine, hiding in the cavern are a pair of Umberhulks. The bottom of the ravine contains the desiccated remains of numerous victims, including 1d6 trinkets (roll on trinkets table), 3d6GP, 3d610SP and 3d6*2 CP By /u/ElFontana94","weight":1,"range":[39,39],"drawn":false},{"_id":"WTELAFfYFGGdsakn","flags":{},"type":0,"text":"The cavern opens up into the long-demolished remains of Svirfneblin town. The screams of long-dead Svirfnebli can be seen by the party as they traverse through the ruins, with the occasional player witnessing visions of Drow atrocities as they slaughtered the inhabitants. The place has long been stripped bare of anything valuable, though a trinket can be found in the rubble (roll on trinkets table) with the character who picks it up experiencing a vision. By /u/ElFontana94","weight":1,"range":[40,40],"drawn":false},{"_id":"KVMPcuss7ettW0oV","flags":{},"type":0,"text":"The party enters into an abandoned salt mine filled with dozens of petrified Svirfnebli, a pair of Basilisks have made the cavern their home. The overseer's office is locked with a DC18 Lock, inside can be found the corpse of the Svirfnebli who starved to death whilst trying to wait out the basilisks in vain. You can find 6d10*10+5 GP as well as 1d6 trinkets (roll on trinkets table) stashed away in the Overseers office. By /u/Elfontana94","weight":1,"range":[41,41],"drawn":false},{"_id":"O3NEY0qXdZ1RHhkG","flags":{},"type":0,"text":"A trio of Duergar ranchers lead their herd of rothe (Underdark cattle) between a pair of fungal groves, they don't take kindly to being followed. By /u/Elfontana94","weight":1,"range":[42,42],"drawn":false},{"_id":"cZQEAfrZBtodWNQt","flags":{},"type":0,"text":"The party encounter a group of Githyanki consisting of 1d6+1 Githyanki warriors lead by a Githyanki knight. They are currently in the process of hunting Illithid's, although they will act hostile towards the party, they can be parlayed if information related to a Mindflayer colony is given to them. By /u/Elfontana94","weight":1,"range":[43,43],"drawn":false},{"_id":"epoYWgrH7zwlDVA3","flags":{},"type":0,"text":"The party stumbles upon an abandoned shrine to a forgotten deity, stripped bare of any valuables its walls are filled with reliefs of some entity of unknown proportions to anything the party knows or has encountered. The structure does seem easily defensible and an ideal place to rest. However, if the party spends more than an hour in the shrine, every player must make a DC 15 Wisdom saving throws or fall unconscious for 1d10 minutes, experiencing visions of beings so twisted and alien to them that they are indescribable, leaving that player with a form of indefinite madness (roll on madness table) By /u/Elfontana94","weight":1,"range":[44,44],"drawn":false},{"_id":"AddMW6ky5K72Qdo9","flags":{},"type":0,"text":"The ground underfoot gives way to a slurry of mud, DC 13 Dexterity saving throw to dodge, and a DC 13 acrobatics or athletics throw to escape, every round the character spends in the mud the escape DC increases by 1. To make matters worse, a black pudding emerges from the ichor and attempts to devour the characters who have fallen in. By /u/Elfontana94","weight":1,"range":[45,45],"drawn":false},{"_id":"UKCdWv4wEApP8Us6","flags":{},"type":0,"text":"A small group of flumphs have set up a small shop. They offer information on the general area around them. They also sell really smooth rocks for 1-3gp as well as small, inedible mushrooms for 2-4gp. By /u/BuddyChrist627","weight":1,"range":[46,46],"drawn":false},{"_id":"Jup0O9enU3xw8fVL","flags":{},"type":0,"text":"The group enter what appears to be a gigantic crystalline geode, and while travelling through it, come across a small band of duergar. Spell casters quickly learn that the geode crystals actually refract magical spells causing chaos on the battlefield. (Roll a percentile to see who gets hit by refracting spells.) By /u/Skele11","weight":1,"range":[47,47],"drawn":false},{"_id":"mrlBGFg67fSsSKGQ","flags":{},"type":0,"text":"The group encounters a makeshift “church” where a group of kuo toa are praising a purple worm, offering both themselves and and a presumably dead mind flayer as a sacrifice . Their ritual slowly grows louder and louder. After a few minutes of raising volume, a purple worm mouth breaks through the wall to the left, demolishing the room and eating everything in it. After it’s gigantic body passes through, all that is left is a staff, a mind flayer tentacle, and a pool of blood around a kuo toa arm. By /u/buddychrist627","weight":1,"range":[48,48],"drawn":false},{"_id":"oLsfm3tyub3Ri3J5","flags":{},"type":0,"text":"The party encounters a hut, with a still burning campfire outside. Approaching or attempting to peer inside is met with a raspy mind-flayer voice beckoning them to come inside. If they do, they are greeted with a mind-flayer wearing an old tattered wig and knitting a sweater, peacefully welcoming the players and offering them food to eat, and, if prodded, allowing the players to trade for magical items, boons, or knowledge. Trading for any of these items isn't done with coin, but with favours.. or for parts of the player's hair, skin, teeth, limbs, senses, etc etc. \"Eye for an eye\" sort of thing. Unbeknownst to the players, the mind-flayer has eaten 3 separate hags - whos combined mental forces of will have overcome the mind-flayer, and create a Hag Coven of 1. Plane Shifting to avoid confrontation is her speciality, the Hag Coven / Mind Flayer is more than a little genre savvy of the visage she now takes. By /u/pbsbqtf","weight":1,"range":[49,49],"drawn":false},{"_id":"a4eKiLJsHKYCmxM2","flags":{},"type":0,"text":"1 - Hundreds of flumphs all floating around and bumping into each other, one of them has some mysterious key on a tentacle.","weight":1,"range":[50,50],"drawn":false},{"_id":"OFCWAAB7488IiMYI","flags":{},"type":0,"text":"2 - A group of emaciated runaway slaves of multiple races. They will beg for help, but really just want to rob you and eat you","weight":1,"range":[51,51],"drawn":false},{"_id":"Db4y2R44OGOteCs9","flags":{},"type":0,"text":"3 - Fire in the Myconid village! The slow moving humanoids are attempting to flee, but it's not the fire they are really afraid of.","weight":1,"range":[52,52],"drawn":false},{"_id":"ME4RALBmu9G9Qj9L","flags":{},"type":0,"text":"4 - A Cloaker Lord is entering the final stages of its death-birth cycle. Several regular Cloakers cluster around it, protecting their lord while it splits open and minature Cloaker babies begin to spill out.","weight":1,"range":[53,53],"drawn":false},{"_id":"C03J7BK2Tjd497Nb","flags":{},"type":0,"text":"5 - A dragon has been infested by a colony of parasitic mushrooms. It begs the PCs to kill it even as it moves to attack them. Instead of fire, its breath weapon now sprays more spores over its targets.","weight":1,"range":[54,54],"drawn":false},{"_id":"hLIAnMh8czMxxp0C","flags":{},"type":0,"text":"6 - All the light (magical or non-magical) suddenly goes out. One of you - at the back of the party - feels something brush up against your back.","weight":1,"range":[55,55],"drawn":false},{"_id":"urnDfmFIKX4rd8FW","flags":{},"type":0,"text":"7 - While in a narrow space or mazelike area, you com across an old man sitting against the wall who will ask for food and act slightly strangely. Something feels wrong. If someone gets close enough, sets of insectoid appendages will emerge from behind the head and the face will retract into a centipede-like form, trying to eat the face of the person who got too close, revealing that the body is just an old headless corpse. If the players ward off the centipede-like creature, it will continue to crawl in a tight network of tunnels around the area that even the smaller races struggle in, its voice mimicking the last words of its previous victim.","weight":1,"range":[56,56],"drawn":false},{"_id":"2jDz7SgRHawxzUjh","flags":{},"type":0,"text":"8 - A large herd of transparent massive flea-like insectoids with a row of photosphores along each side comes stampeding in your direction. Get under cover or risk being trampled. Once you’re in the clear, it becomes apparent; they are being chased by a … (roll 1d4)","weight":1,"range":[57,57],"drawn":false},{"_id":"j3IzUQl7sg4UWCVr","flags":{},"type":0,"text":"[1] - Massive sluglike insectoid with many legs and many eyes","weight":1,"range":[58,58],"drawn":false},{"_id":"C8tLoStFDIOsLOXY","flags":{},"type":0,"text":"[2] - A black fluid mass that races across the ground - get on top of something to avoid the black slime","weight":1,"range":[59,59],"drawn":false},{"_id":"dMoVpsLCmPHqVYHI","flags":{},"type":0,"text":"[3] - A group of whatever race is appropriate hunting these for their shell and flesh","weight":1,"range":[60,60],"drawn":false},{"_id":"ROswvgq6UEsspN32","flags":{},"type":0,"text":"[4] - Nothing? Still, you can’t help shake the feeling that something is very off","weight":1,"range":[61,61],"drawn":false},{"_id":"J4Bfs3bFFYuZCtb3","flags":{},"type":0,"text":"9 - You feel a warm wind and notice a shifting dark mass with points of glowing orange light in it. A cinder storm (from the nearest source of lava/fire) is billowing in your direction at incredible pace. Constitution will help save you from the sulfurous gases, but only cover will help prevent burns. Not especially dangerous, though your clothing may catch on fire.","weight":1,"range":[62,62],"drawn":false},{"_id":"2bU8NezPvhHizvrT","flags":{},"type":0,"text":"10 - You meet with a group of explorers mapping out the area (or, if already mapped out, mapping it out in greater detail). They can give you a map of the surrounding area (dangers and neat sights). The longer you spend with them, the more apparent it is that one of them is sick with something strange and bad, and that it might spread to the others. Do the players choose to heal them? Kill them? Leave them be? If the group refuses to act, then they may encounter the mappers later, dead.","weight":1,"range":[63,63],"drawn":false},{"_id":"qXGotgWFdsOEetk9","flags":{},"type":0,"text":"10 - A single person behaving . . . wrong? They don’t blink, their eyes wide open and clouded, and there’s an unplaceable flaw with their walking, as if they’re slightly off balance. In the dark, the players may not even notice. They will behave unnaturally friendly towards the players, but once they’re past the players backs, they will let out an inhuman, furious, gleeful, scared scream, charging at the players with a knife raised. You can’t help shake the feeling that their demeanor betrays a horrified expression in their eyes. If this turns out too easy, perhaps there are more that were hiding and waiting for the signal?","weight":1,"range":[64,64],"drawn":false},{"_id":"Fb4psMWCrWLI6jpH","flags":{},"type":0,"text":"11 - A hardy band of dwarves seeking to end a threat, led by one wearing an amulet. Things started going wrong in their settlement, which is when the amulet started to “call” the bearer somewhere very deep.","weight":1,"range":[65,65],"drawn":false},{"_id":"c3dE9VUNdeusKXvH","flags":{},"type":0,"text":"12 - A blind hag who is remarkably friendly, a glowing third eye covered by a blindfold. She can give you some interesting items if you trade loot, meat, or hides. When the players leave, she warns them of her “awful” sister. Later on, the players will encounter another blind hag who’s also pretty friendly and willing to trade. She’ll warn you of her “terrible” sister and might rant about how bad her sister is. It quickly becomes clear that they’ve had something of a falling-out.","weight":1,"range":[66,66],"drawn":false},{"_id":"lbgJotxx2gQRyfQp","flags":{},"type":0,"text":"13 - You encounter a dwarf who quietly signals for you to tread carefully. You feel a rumbling as a massive worm (purple worm stat block) digs through the sand in the area. You’ll have to jump from rock to rock if you want to avoid the attention of the worm.","weight":1,"range":[67,67],"drawn":false},{"_id":"xhGcEthvilD2OKMb","flags":{},"type":0,"text":"14 - A stoic and grim but ultimately friendly outcast Duergar valuables trader travels between dwarven towns with an old Warforged protecting them. They hate other Duergar more than anything.","weight":1,"range":[68,68],"drawn":false},{"_id":"cTKxmAw70X02pYjd","flags":{},"type":0,"text":"15 - While passing through a massive cave system, you hear the bang of a drum. As a horn is set off, a bunch of Dark Skinned Dwarf Barbarians will rapel from passageways above. You suddenly see yourself sorrounded by this apparently primitive tribe. What do they want? Well, you'll know very soon.","weight":1,"range":[69,69],"drawn":false},{"_id":"fP9BOrKsr92BZJYA","flags":{},"type":0,"text":"16 - A black cat with glowing eyes watches the group form a distance, you can’t help but get a feeling off judgment emanating from the cat","weight":1,"range":[70,70],"drawn":false},{"_id":"MXPFDFPljsoEUlFN","flags":{},"type":0,"text":"17 - A clan of illiterate kobolds think they worship and serve a Great Ancient Wyrm. In fact they works a Great Ancient Worm. It’s not purple. It’s not magical. It’s just a really big worm.","weight":1,"range":[71,71],"drawn":false},{"_id":"13GFhF2tDfZlAl7U","flags":{},"type":0,"text":"18 - All the stalactites and stalagmites in one cavern have swapped position. It’s really freaking out the party’s guide.","weight":1,"range":[72,72],"drawn":false},{"_id":"1MoDv7L0R8PGcwTQ","flags":{},"type":0,"text":"19 - The party stumbles across Ickysburg, a troglodyte encampment led by Icky-Icky, an escaped slave from a distant deugar city. Icky-Icky has seen the grandeur of the dwarves and deugar cities and is convinced that Ickysburg rivals them all in splender and ingenuity. He is entirely wrong.","weight":1,"range":[73,73],"drawn":false},{"_id":"wHd5dc11yPs1wZKD","flags":{},"type":0,"text":"20 - A mine shaft cuts through a cavern going down from the ceiling through the floor. There is no visible top or bottom. Anything you drop down falls down from the ceiling an hour later.","weight":1,"range":[74,74],"drawn":false},{"_id":"QDCDAK87NI74Hhqg","flags":{},"type":0,"text":"21 - Underground quicklings trying to hold their bloodlust at bay so they don't turn unseelie. Might be able to be bypassed with Diplomacy, but failure leads to fighting off a kill squad like you're the enemy in Attack on Titan.","weight":1,"range":[75,75],"drawn":false},{"_id":"ssSfKur07zMN0CQt","flags":{},"type":0,"text":"22 - A Purple worm suddenly zooms in-front of your group. Make a wisdom check to keep quiet otherwise the Purple worm hears your group and attacks. If you stay quiet the path the worm makes leads to two new directions for your group.","weight":1,"range":[76,76],"drawn":false},{"_id":"4MwOlWyvhx6FgvAR","flags":{},"type":0,"text":"23 - In the distance lava suddenly bursts from the ground. A stampede of creatures are running in your direction away from the lava.","weight":1,"range":[77,77],"drawn":false},{"_id":"ocovzMVS0zOAl06h","flags":{},"type":0,"text":"24 - You come across a lone inn run by a Duergar couple. The inn servers underdark food and has a hot spring and is safe but expensive. Both Duergar are quite capable fighters and that skill allows them to run an inn in such a dangerous environment.","weight":1,"range":[78,78],"drawn":false},{"_id":"PBDHM8A9VtA62vlz","flags":{},"type":0,"text":"25 - You come across a strange temple that seems carved from a hanging stalactite. The temple seems unreachable from the ground without flight or far reaching climbing gear.","weight":1,"range":[79,79],"drawn":false},{"_id":"6XoJMBEZnIdxp6xE","flags":{},"type":0,"text":"26 - A group of bipedal amphibioid blindheim are searching a large cavern with their spotlight eyes. There are plenty of stalagmites, large ancient skeletons, shallow pools, ditches, and other obstacles to hide behind or in. Can you keep out of the light and mind your shadows well enough to reach the other side of the room without being seen?","weight":1,"range":[80,80],"drawn":false},{"_id":"26Q6FR5buA34gyue","flags":{},"type":0,"text":"27 - You discover a blindfolded monk doing a handstand with but a single finger on the tip of a tall, slippery stalagmite. S/He'll explain that s/he's in training and does not want to be bothered, but if someone can climb up to her/him without the aid of magic or device, s/he'll talk. If reached, the monk is cordial enough and will draw a map, mark it with resources and safe rest spots, and give advice about the surrounding dangers.","weight":1,"range":[81,81],"drawn":false},{"_id":"XjtnUX3LiiH8h6Lx","flags":{},"type":0,"text":"28 - You discover dwarves mining a vein of very valuable ore. They are very upset they have been discovered, but play down their tension. You can try to assure them you won't spread the word of their discovery.","weight":1,"range":[82,82],"drawn":false},{"_id":"aJ0aBi17QgQHtTqs","flags":{},"type":0,"text":"29 - You hear incessant thinks and groans from around the corner. As you approach, you find yourself in a cave with at least 1d100 dwarves. They look malnourished and tired, and won't respond to any PC approaching, as they mine the walls of this cave. In the middle, a skeleton of an ancient black dragon can be found, half of it's carcass coexisting with brute, pure gold ore, as if his body had melted the metal and it became solid after submerged. You can mine the gold. Attacking any dwarf will make them and the nearest 7 dwarves attack the group, but they are visibly weak.","weight":1,"range":[83,83],"drawn":false},{"_id":"bCMEGGSpyi0jvo6R","flags":{},"type":0,"text":"A beholder that just wants to tend to its garden of beautiful fluorescent mosses, but needs something to stop them from dying (fertilizer? Cure for a moss-killing disease? A gnome to help in the garden?) And will ask the party for it.","weight":1,"range":[84,84],"drawn":false},{"_id":"bJax0mf3csDyGyhB","flags":{},"type":0,"text":"Deep gnome colony/miner/merchant","weight":1,"range":[85,85],"drawn":false},{"_id":"zxaK9h2gb4binOEh","flags":{},"type":0,"text":"Giant Mushroom Maze","weight":1,"range":[86,86],"drawn":false},{"_id":"WAqI0FLLQgLC5XKJ","flags":{},"type":0,"text":"Myconids","weight":1,"range":[87,87],"drawn":false},{"_id":"cJO8mYzldjcqmOKV","flags":{},"type":0,"text":"A Xorn looking for gemstones to eat","weight":1,"range":[88,88],"drawn":false},{"_id":"ya5wT8FMpLCVktj1","flags":{},"type":0,"text":"Portal to the Earth Elemental Plane","weight":1,"range":[89,89],"drawn":false},{"_id":"xlZPpPLRrZ33EgRa","flags":{},"type":0,"text":"Lost adventurers","weight":1,"range":[90,90],"drawn":false},{"_id":"fgrS4j73SvU9jmUX","flags":{},"type":0,"text":"Rockslide blocking the way","weight":1,"range":[91,91],"drawn":false},{"_id":"KWruRaXRSqOG7fBG","flags":{},"type":0,"text":"Herd of underground beasts in the way","weight":1,"range":[92,92],"drawn":false},{"_id":"QCTrbAUcPh8PbtMQ","flags":{},"type":0,"text":"Friendly Flumph wanting some new people to telepathically chat too.","weight":1,"range":[93,93],"drawn":false},{"_id":"9A2sFfe1jya4z1ow","flags":{},"type":0,"text":"Mushroom spores making the players hallucinate or fall asleep, then waking up to find themselves in a drow, deuregar, deep gnome or Illithid colony.","weight":1,"range":[94,94],"drawn":false}],"formula":"1d94","replacement":true,"displayRoll":true}